/*
#include "phb_dataOpt.h"
#include "phb_index_search.h"


// ÊäÈëºº×ÖÃû×Ö£¬È»ºóµÃµ½×ª»»ºóµÄ4¸övalue(3¸ökeyºÍ1¸öpyKey)
// 'value' is 4 int data.
int phb_idxSearch_getValue(U8 *name, U32 *value)
{
	return PHB_SUCCESS;
}

// ÊäÈëPHB_IDX_ITEM½á¹¹Ìå£¬²éÕÒµ½ËüÔÚËùÓÐ¼ÇÂ¼ÖÐµÄÎ»ÖÃ
int phb_idxSearch_getPos(PHB_IDX_ITEM *item, PHB_IDX_ITEM *data, U32 *retIdx, U32 dataArrLen)
{
	return PHB_SUCCESS;
}

// ÊäÈëÆ´ÒôµÄÊ××ÖÄ¸»òºº×Ö£¬È»ºó·µ»ØÆ¥Åäµ½µÄÊ×ÌõkeyµÄË÷ÒýºÍ×Ü¹²Æ¥Åäµ½¶àÉÙkey¡£
// ÔÚº¯ÊýÖÐ»áÅÐ¶ÏpSrchKeyÊÇÓ¢ÎÄ»¹ÊÇÖÐÎÄ£¬Èç¹ûÊÇÖÐÎÄ£¬Ôò°´ÕÕ3valueÀ´²é£¬Èç¹ûÊÇÓ¢ÎÄ£¬°´ÕÕÆ´ÒôÊ××ÖÄ¸À´²é¡£
int phb_idxSearch_getSpkRange(U8 *pSrchKey, U32 *retArray, PHB_IDX_ITEM *data, U32 dataArrLen)
{
	return PHB_SUCCESS;
}
*/


#include "hyTypes.h"

#define PHB_SEARCH_DATA_NAME	"C:/system/phb_search_data.bin"


#define TOTAL_PHONETIC 409
#define PHB_FAIL			0
#define PHB_SUCCESS 		1

const U32 phonetic_hash[TOTAL_PHONETIC] = {
	0x2000000 , 0x2900000 , 0x2e00000 , 0x2e38000 , 0x2f00000 , 0x4100000 , 0x4148000 , 0x4170000 , 0x4171c00 , 0x4178000 , 
	0x4548000 , 0x4570000 , 0x4571c00 , 0x4900000 , 0x490b800 , 0x490bc00 , 0x4928000 , 0x4970000 , 0x4971c00 , 0x4f00000 , 
	0x5500000 , 0x6100000 , 0x6148000 , 0x6170000 , 0x6171c00 , 0x6178000 , 0x6500000 , 0x6570000 , 0x6571c00 , 0x6808000 , 
	0x680a400 , 0x680b800 , 0x680b8e0 , 0x680bc00 , 0x6828000 , 0x682b800 , 0x682b8e0 , 0x6848000 , 0x687b8e0 , 0x687d400 , 
	0x68a8000 , 0x68a8520 , 0x68a85c0 , 0x68a85c7 , 0x68aa400 , 0x68ab800 , 0x68abc00 , 0x6900000 , 0x6f71c00 , 0x6fa8000 , 
	0x7500000 , 0x750b800 , 0x7548000 , 0x7570000 , 0x7578000 , 0x8100000 , 0x8148000 , 0x8170000 , 0x8171c00 , 0x8178000 , 
	0x8500000 , 0x8548000 , 0x8571c00 , 0x8900000 , 0x8908000 , 0x890b800 , 0x890bc00 , 0x8928000 , 0x8971c00 , 0x89a8000 , 
	0x8f71c00 , 0x8fa8000 , 0x9500000 , 0x950b800 , 0x9548000 , 0x9570000 , 0x9578000 , 0xa000000 , 0xa900000 , 0xae00000 , 
	0xb200000 , 0xc100000 , 0xc170000 , 0xc171c00 , 0xc548000 , 0xc570000 , 0xc571c00 , 0xcf00000 , 0xcfa8000 , 0xd500000 , 
	0xe100000 , 0xe148000 , 0xe170000 , 0xe171c00 , 0xe178000 , 0xe500000 , 0xe548000 , 0xe570000 , 0xe571c00 , 0xef71c00 , 
	0xefa8000 , 0xf500000 , 0xf508000 , 0xf50a400 , 0xf50b800 , 0xf50b8e0 , 0xf548000 , 0xf570000 , 0xf578000 , 0x10100000, 
	0x10148000, 0x10170000, 0x10171c00, 0x10178000, 0x10500000, 0x10548000, 0x10570000, 0x10571c00, 0x10f71c00, 0x10fa8000, 
	0x11500000, 0x11508000, 0x1150a400, 0x1150b800, 0x1150b8e0, 0x11548000, 0x11570000, 0x11578000, 0x14900000, 0x14908000, 
	0x1490b800, 0x1490b8e0, 0x1490bc00, 0x14928000, 0x14970000, 0x14971c00, 0x1497b8e0, 0x149a8000, 0x15500000, 0x1550b800, 
	0x15528000, 0x15570000, 0x16100000, 0x16148000, 0x16170000, 0x16171c00, 0x16178000, 0x16500000, 0x16570000, 0x16571c00, 
	0x16f71c00, 0x16fa8000, 0x17500000, 0x17508000, 0x1750a400, 0x1750b800, 0x1750b8e0, 0x17548000, 0x17570000, 0x17578000, 
	0x18100000, 0x18148000, 0x18170000, 0x18171c00, 0x18178000, 0x18500000, 0x18548000, 0x18571c00, 0x18900000, 0x18908000, 
	0x1890b800, 0x1890b8e0, 0x1890bc00, 0x18928000, 0x18970000, 0x18971c00, 0x189a8000, 0x18f00000, 0x18f71c00, 0x18fa8000, 
	0x19500000, 0x1950b800, 0x19528000, 0x19570000, 0x19578000, 0x19600000, 0x1a000000, 0x1a100000, 0x1a148000, 0x1a170000, 
	0x1a171c00, 0x1a178000, 0x1a500000, 0x1a548000, 0x1a570000, 0x1a571c00, 0x1a900000, 0x1a90b800, 0x1a90bc00, 0x1a928000, 
	0x1a970000, 0x1a971c00, 0x1a9a8000, 0x1af00000, 0x1afa8000, 0x1b500000, 0x1c000000, 0x1c100000, 0x1c148000, 0x1c170000, 
	0x1c171c00, 0x1c178000, 0x1c500000, 0x1c548000, 0x1c570000, 0x1c571c00, 0x1c700000, 0x1c900000, 0x1c90b800, 0x1c90b8e0, 
	0x1c90bc00, 0x1c928000, 0x1c970000, 0x1c971c00, 0x1c9a8000, 0x1cf71c00, 0x1cfa8000, 0x1d500000, 0x1d50b800, 0x1d528000, 
	0x1d578000, 0x1d600000, 0x1e000000, 0x1f500000, 0x20100000, 0x20148000, 0x20170000, 0x20171c00, 0x20178000, 0x20548000, 
	0x20570000, 0x20571c00, 0x20900000, 0x2090b800, 0x2090bc00, 0x20928000, 0x20970000, 0x20971c00, 0x20f00000, 0x20fa8000, 
	0x21500000, 0x22900000, 0x22908000, 0x2290b800, 0x2290b8e0, 0x2290bc00, 0x22928000, 0x22970000, 0x22971c00, 0x2297b8e0, 
	0x229a8000, 0x23500000, 0x2350b800, 0x23528000, 0x23570000, 0x24170000, 0x24171c00, 0x24178000, 0x24500000, 0x24570000, 
	0x24571c00, 0x24900000, 0x24f71c00, 0x24fa8000, 0x25500000, 0x2550b800, 0x25548000, 0x25570000, 0x25578000, 0x26100000, 
	0x26148000, 0x26170000, 0x26171c00, 0x26178000, 0x26500000, 0x26570000, 0x26571c00, 0x26808000, 0x2680a400, 0x2680b800, 
	0x2680b8e0, 0x2680bc00, 0x26828000, 0x2682a400, 0x2682b800, 0x2682b8e0, 0x26848000, 0x2687d400, 0x268a8000, 0x268a8400, 
	0x268a8520, 0x268a85c0, 0x268a85c7, 0x268aa400, 0x268ab800, 0x268abc00, 0x26900000, 0x26f71c00, 0x26fa8000, 0x27500000, 
	0x2750b800, 0x27548000, 0x27570000, 0x27578000, 0x28100000, 0x28148000, 0x28170000, 0x28171c00, 0x28178000, 0x28500000, 
	0x28548000, 0x28571c00, 0x28900000, 0x2890b800, 0x2890bc00, 0x28928000, 0x28971c00, 0x28f71c00, 0x28fa8000, 0x29500000, 
	0x2950b800, 0x29548000, 0x29570000, 0x29578000, 0x2e100000, 0x2e148000, 0x2e170000, 0x2e171c00, 0x2e548000, 0x2e570000, 
	0x2e571c00, 0x2ef00000, 0x2f500000, 0x30900000, 0x30908000, 0x3090b800, 0x3090b8e0, 0x3090bc00, 0x30928000, 0x30970000, 
	0x30971c00, 0x3097b8e0, 0x309a8000, 0x31500000, 0x3150b800, 0x31528000, 0x31570000, 0x32100000, 0x32170000, 0x32171c00, 
	0x32178000, 0x32500000, 0x32900000, 0x32970000, 0x32971c00, 0x32f00000, 0x32f71c00, 0x32fa8000, 0x33500000, 0x3350b800, 
	0x33528000, 0x33570000, 0x34100000, 0x34148000, 0x34170000, 0x34171c00, 0x34178000, 0x34500000, 0x34548000, 0x34570000, 
	0x34571c00, 0x34808000, 0x3480a400, 0x3480b800, 0x3480b8e0, 0x3480bc00, 0x34828000, 0x3482a400, 0x3482b800, 0x3482b8e0, 
	0x34848000, 0x3487b8e0, 0x3487d400, 0x348a8000, 0x348a8400, 0x348a8520, 0x348a85c0, 0x348a85c7, 0x348aa400, 0x348ab800, 
	0x348abc00, 0x34900000, 0x34f71c00, 0x34fa8000, 0x35500000, 0x3550b800, 0x35548000, 0x35570000, 0x35578000
};

const char *phonetic_section = 
"°¢°¡ºÇàÄëçï¹ß¹°®°£´ô°¬°§°­°©°¤°«°¦°¥°¯àÈ°ªêÓÞßö°àÉ°¨ïÍæÈíÁè¨°²¹ã°´°¸°µ°¶³§°³âÖ°°÷ö°±ÚÏ°·ðÆáíèñï§ÛûÞî°º°¹°»°Â°Ä°Á°¾°½÷¡°¼Ïù°À°ÃÞÖ\
æÁ°¿à»öË÷éåÛÛêæñòüâÚéáñúá®°Ñ°Ë°É°Í°Õ°Ö°Î°Ô°Ó°È°Ï°Ç°Ì°Ê°Ð°Å°ÒôÎ÷É°Æå±îÙá±öÑÝÃÜØ°Ù°×²®°Ý°Ü°Ú°ØßÂêþ°Þ°ÛÞã°ì°ë°ã°à°æ°å°é°á°ç°ß°äñ£°ê\
°â°íÚæ°èÛàô²îÓñ­°ï°î°ò°ô°ø°ñ°ó°÷°ù°õäº°ö°ðÝò±¨±£°ü±¦ÅÚ±©±§±¡±¬°û±¤±«±¥°þ±ª°ý±¢°úÆÙð±ÆØÝáìÒÅÙöµæßñÙõÀ±»±±±¸±³±¯±´±­±²±¶±Û±°±®ã£±¹\
±·±µØÃ±ºÚéßÂ÷¹ÝíÝÉöÍíÕðÇñØÛýÚý±¾±¼±¿êÚ±½ÛÎº»ï¼ÛÐ±À±Ä±Á±Å±Â±Ã°öàÔê´±Ø±È±Ï±ÊÃØ±Ü±Ë±Ò±Õ±Ú±Ý±Ç±Æ±Û±Ù±Ì±Î±×æ¾±Éåö±Ö·÷±Ð±ÓÃÚèµÙÂ±ÔñÔêÚ\
Ø°õÏæÔ±Í±Ñ÷ÂÞµã¹ßÁî¯åþÝÉó÷ô°ÜêôÅå¨ßÙâØóÙïõÜÅÛýáùîéÝ©óëää±ã±ä±ß±à±é±ç±æ±â±Þ±áãêØÒÛÍóÖ±å±èòùÜÐí¾ìÔñ¹ñÛâíçÂöýíÜ±í±ê±ëïÚæôÉ×÷Ôæ»ì­ñÑ\
è¼ïð±ì÷§ì©ñ¦±ð±ï±îõ¿±ñ±ö±ó±õ±ò÷Þéë±ôçÍ±÷éÄÙÏë÷÷ÆáÙçãïÙ²¢±ø²¡±ù±ûÆÁÙ÷±ú±ü±ý±þéÄÞðÚû°Ù°ã²®²¨²©±¡²¥²ª°Ø²£²·²¦²´°þ²µ²¯²±ÆÇ²°²²²«à£²³\
ØÃ²§õËÙñô¤âÄ²­ð¾êþõÀ²¤ë¢îàõÛíç²¬éÞ²»²¿²½²¼²¹²¶±¤²·²À²¾²¸ÆÒåÍ²ºêÎîÐß²õ³ê³îß²Á²ðàêíå²Å²É²Æ²Ä²Ê²Ã²Ë²Ì²Â²È²Ç²Î²Ð²Í²Ò²Ñ²Ó²ÏôÓ²ôè²æîåî\
÷õ²Ø²Ö²Ô²Õ²×Ø÷²Ý²Ü²Ùäî²ÛàÐ²Úô½ó©²ß²â²à²á²Þâü²Îá¯ä¹Ôø²ã²äàá²é²ì²î²è²å²æÉ²²ï²íÔûàêïÊé¶²çñÃæ±²ëè¾²êâÇãâé«éßâªïï²î²ñ²ðîÎ²òò²Ù­ðû²úµ¥\
ìø²ø²ü²û²õ²÷ÚÆ²óó¸âã²ù²ôæ¿õðå¤²öäýêèåîâÜïâåñÝÛÙææö³¤³£³¡³§³¢²ý³ª³¥ÌÈ³¦³©³«ÉÑ³¨âêæÏæ½êÆ²þÜÉÛËãÑë©ÝÅØöáäã®öð³¯³¬³±³­³²³®³³½Ë³°êË´Â\
³´ìÌñéâ÷³µ³ß³¹³·³¶³¸³ºíºÛå³Æ³Â³¼³Á³½Éò³¿³¾³Ã³Äè¡å·ÚÈàÁ³À³Ó³ÈÚß³»ÞÓé´í×ö³Ø÷³É³Ç³Ì³Æ³Ð³ËÊ¢³ÏØ©³Ê³Í³Î³Å³Ñ³Ò³Ó³ÈñÎîªîõòÉîñèÇàáõ¨èßëó\
Ûô³Ö³Ô³ß³Ù³à³Ø³Ý³Ûë·³â³Õ³Ü³á³×ß³³ÞâÁ³ãàÍ³Úó×ñ¡à´÷Îò¿ßêÜ¯ð·æÊñÝó¤ÙÑÛæõØóøôùÜÝí÷áÜÖÖÖØ³ä³å³ç³æÓ¿³èâçã¿ô©ô¾ï¥Üû³é³ó³ð³î³ï³ê³ô³ñ³ë³ò\
³ì³íÙ±öÅã°ñ¬àü³ö´¦³ý³õ³þ´¡´¥´¢Ðó³ø´£ñÒ÷í³ù³÷Û»³ú³ûèÆ´¤³üéËç©èúâðõéãÀòÜØ¡´§à¨õßàÜÞõëú´«´¬´©´¨´®´­îËâ¶´ªå×ë°ô­çÝ´´´²´°´³´±´¯âë´µ´¹\
×µ´¸´¶´·é³Úïé¢´º´¿´½´¾´À´¼´»ðÈÝ»òí´Âê¡´ÁõÖà¨öº´Ë´Î²î´Ì´Ê´Ç´Í´È×È´Åìô´ÄËÅ´Æ´É´ÃðËßÚôÙÜë´Ó´Ï´Ò´Ô´ÐäÈçý´ÑÜÊèÈè®æõ´Õê£ëíé¨×ä´Ù´Ö´Ø´×\
õ¡õ¾â§éãõíáÞÝý´Ü´ÛÔÜ´Úß¥ìàÙàïéË¥´ä´Þ´ß´â´à´Ýã²ÝÍ´áßýéÁè­ö¿´ãë¥´æ´å´ç¶×ââñå´í´ë´ì´ê´é´èØÈõºï±áÏõãðîïóðûëâ´ó´ò´ï´ðËþ´îí³÷²ßÕ÷°óÎàª\
´ñÞÇæ§ñ×âòðã´ó´ú´ø´ý´÷´ô´ü´û´þ÷ìµ¡´ù´õá·åÊçé´öçªß¾ß°Ü¤ææµ«Ê¯µ¥µ¯µ£µ¤µ©µ¨µ­µ°µ®µ¢å£µ¬µ¦à¢µªíñééÙÙµ§ÝÌñõðãóìð÷êæµ±µ³µ´µµµ²ÚÔå´ñÉÛÊ\
í¸îõÝÐµ½µÀµ¼µ¹µºµ¶µÁµ»µ¸µ¾µ·µ¿ß¶ìâôîë®âáàüµÄµØµÃµÂµ×ï½µÃµÈµÇµÆµËµÉ³ÎµÊô£µÅïëàâíãáØê­µÄµØµÚÌáµÛµÜµÐµ×µÍµÖµÝµÏµÒµÙµÎµÌµÑÛ¡µÔµÞØµµÕ\
µÓàÖÚÐÙáé¦Ú®Ý¶íÆ÷¾æ·ôÆêëç°ÛæïáíûèÜíÚàÇµãµçµ÷µîµäµôµêÄñµõµñµßµìµöµéµæñ²µóô¡µèµíµòõõµáçèîäµïáÛµëµðµâµàñ°õÚµåÛãÚçï¢öôîöØ¼µôÄñµõµñµö\
µóµòõõµïµðï¢öôîöô†ŒÅtü—¬µøµùµþµûµýµüëºµúØýà©Ü¦õÚõÞñóÞéÛìð¬öø¶¨¶¡¶¥¶©¶¦¶¢¶¤¶£¶§íÖëëî®ôúîúØêà¤çàðÛñô¶ªîû¶¯¶«¶´¶¬¶®¶­¶³¶°ßËá¼¶±¶²\
ëËë±ð´íÏá´ëØÛí¶¼¶·¶Á¶¹¶¶ñ¼¶µ¶¸¶ºò½¶»Ýúóû¶¼¶È¶À¶Á¶½¶Ù¶¾¶Å¶É¶Ç¶Ä¶ÂóÆ¶Ã¶ÊäÂà½ë¹ó¼¶¿¶ÆÜ¶÷ò÷Çèü¶Ï¶Î¶Ë¶Ì¶Í¶Ðé²ìÑóý¶Ô¶Ó¶Ñ¶Ø¶Òí¡íÔí­ïæ¶Ù\
¶Ü¶Ø¶Ö¶Ý¶×¶Û¶ÕãçìÀíïõ»¶Úí»ïæíâ¶à¶È¶á¶ä¶ã¶éîìõâßÍÍÔ¶è¶æñÖ¶ß¶Þ¶å¶âßá¶çç¶èÞãõ°¢¶ñ¶î¶í¶öÅ¶¶ì¶ð¶ò¶õ¶ôãµ¶ó¶ë¶ïßÀÚÌ¶êÝàØ¬ðÊãÕïÉöùæ¹ò¦ÛÑ\
ÜÃï°éîëñåíÝ­ÚÀ¶÷ÞôÝì¶ø¶þ¶ù¶û¶ú·¡åÇ¶üçíð¹¶ýîïÙ¦öÜ·¢·¨·£·¥·¦·§·¤ÛÒíÀ·©·´·¸·¶·²·¹·­·¬·³·±·º·µÞ¬···ª·«·®á¦èóìÜî²·¯ÞÀ·°õì·½·Å·¿·À·Ã·¼\
·Â·Á·»·Ä·¾ô³áÝöÐèÊîÕÚú·Ç·É·Ñ·Ï·Æåú·Ê·Ë·Î·È·Ðì³ç³·Í·ÌáôìéëèôääÇÜÀòãö­é¼óõïÐã­öîðò·Ö·Ý·×·Ü·Û·ß·Ô·Ò·Ù·Ø·Õ·Þ·Ú·àÙÇ·Óçãèû÷÷å¯ö÷·ç·â·î\
·ï·á·ë·å·æ·ê·è·ì·ä·íÙº·ã·éÝ×Ûºããí¿ßô·ð·ñó¾·ò¸´¸®·þ¸¸¸£¸±¸¾¸º¸»·ð¸¶¸½·ü¸§·û¸¥¸¡¸³¸°·ö¸µ¸¨¸¹¸²·ù¸¦¸À¸¯·ô·ý¸©¸¿·÷¸«·óÜ½·ø¸·æÚ¸¬æâ¸¤\
¸­ÜÞ·õòð¸ªð¥ÞÔöÖò¶õÃÝÊ¸¢íë·ú¸¼ÙëÜÀÝ³êçÙìíÉî·õÆòóíêß»ç¦Û®Üòá¥äæèõâöòÝìðôïç¨åõïûöû¼Ð¿§Ù¤¸ìÞÎ¸Â¸ÁÔþê¸îÅæØæÙ¸Ä¸Ã¸Å¸ÇØ¤¸È¸Æ½æÛòÚëêàê®\
¸Ð¸É¸Ò¸Ï¸ÊÇ¬¸Î¸Ë¸ÍÞÏ¸ÓéÏäÆ¸ÌÜÕêº¸Ñç¤í·ß¦ãïðáä÷ôûÛá¸Õ¸Û¸Ö¸Ù¸Ú¸Ô¸×¿¸¸Üî¸¸Øí°óà¸ß¸æ¸ã¸å¸ÞÚ¾¸à¸âê½Øº¸á¸äéÂçÉ¸ÝÞ»éÀÛ¬ï¯¸öºÏ¸÷¸ñ¸ï¸ç¸Ç\
¸è¸ó¸ô¸î¸ð¸ê¸é¸ì¸ë¿©æü÷Àë¡ò¢àÃ¸í¸òô´ïÓÒÙò´ñËÛÙ¸õÛÁíÑØªëõØîÜª¸ø¸ù¸úØ¨ôÞßçÝ¢¸ü¸ý¸û¾±¹£¹¢¹¡¸þßìâÙöáç®¹«¹¤¹²¹¦ºì¹¥¹©¹¬¹±¹§¹­¹ª¹°¹®¹¨\
ö¡ëÅò¼¹¯çî¹¹¹»¾ä¹º¹·¹µ¹´¹³¹¶¹¸Ú¸ì°óÑæÅåÜ÷¸çÃóôèÛá¸Øþêí¹Ê¹Å¹É¹Ë¹Ì¹Ã¹È¹Ä¹Ç¼Ö¹Â¹À¹Í¹¼¹¾¹Á÷½ðÀ¹Æ¹½ßÉïÀ¹¿ì±ð³î¹òÁî­Ú¬ØÅãéÝÔèôáÄôþõýðó\
éïîÜêôöñëûêöÀ¨¹Ò¹Ñ¹Ï¹ÎØÔ¹ÓßÉÚ´ëÒ¹Ðð»èé¹Ö¹Õ¹ÔÞâ¹Ø¹Ù¹Ü¹Û¹Ý¹Ú¹á¹ß¹à¹×¹ÞñæÂÚäÊÙÄîÂÝ¸ðÙ÷¤Þè¹â¹ã¹äë×áîßÛèæ¹æ¹é¹ó¹í¹ï¹ð¹ò¹ì¹ê¹ñ¹å¹î¹ë¹ç\
èíæ£¹èêÐð§¿þêÁå³¹ôØÐâÑÈ²óþöÙØÛ÷¬¹ö¹÷Ùòçµöç¹õíÞ¹ú¹ý¹û¹ù¹ø¹üâ£ÎÐë½áÆñøé¤ÙåàþßÃòåÞâÛöòä¹þÏº¸òîþ»¹º£º¦º¢º¡º¥º§¿ÈºÙàËõ°º¤ëÜººº¬º«º®º°\
º¹º²ºµº±º¯º¶º­º³º·º¨º´ºªå«ò¥º©ìÊ÷ýº¸ÝÕêÏòÀãÛÚõñüÞþÐÐº½º¼Ïï¿Ôº»ãìçññþç¬ºÃºÅºÁºÀºÆºÄð©ºÂê»º¾å©º¿¸äò«å°àÆÝïòººÑÞ¶àãºÍºÎºÏºÓºËºÈºØºÕ\
ºÉÏÅºÇº×ºÐÛÀºÖºÌÛÖæüãØêÂºÔÚ­ºÊºÒò¢îÁàÀºÑòÂôçºÚºÙàËºÜºÞºÝºÛÐÐºáºâºãºßºàçñÞ¿èìºìºéºäºèºëºêÞ°ºçºåºæãÈãüÝ¦ÙêÚ§ÙäÞ®ºóºòºîºñááºíºïºðåË\
ö×ô×óó÷¿Ü©ðúºÍºõ»¤»§ºúºöºôºþ»¢»¥ºËÏ·ºý»£ºüºø»¡õú»¦ìèóËº÷ºùºûã±÷½ðÀä°ìïìÎçúð­ðÉéÎâïì²ìÃá²ð×äïâ©àñßüõ­ìæÙüéõ»°»¯»¨»ª»®»­»¬»©»í»«èë\
í¹æèîü»®»³»µ»´»±»²õ×»¹»¶»·»»»¼»º»½»Ã»¸»Â»À»¿»¾ä½ä¡÷ß»ÁÛ¼å¾à÷ÝÈâµåÕïÌß§Û¨çÙäñöé»Æ»Ê»Ä»Å»Î»Ì»Í»Ñ»Ð»È»Ë»Ï»É»ÇäÒÚòè«äêåØëÁáåóòöüó¨ñ¥\
»á»Ø»Ó»Ù»Ý»ã»Ò»ÖÀ£»Û»Ô»Ú»Õ»æ¶é»ä»ß»Þí£êÍ»²»à÷â»åÚ¶èíÞ¥åç»×»Üà¹ó³ßÔò³ÜöãÄä§çÀ»âçõä«ÜîßÜ»é»ì»ê»è»ëÚ»»çãÔâÆçõäãºÍ»ò»î»ð»ñ»õ»ï»ö»ó»ô\
»íó¶â·Þ½ïìïÁàëîØØåñëß«Æä»ú¼°¼º¸ø¼¸¼´Ïµ¼ÆÆÚ¼Ç»ù¼Ã¼«¼¯»÷¼¶¼Ê¼È¼¼Ææ¼±¼Í¸ï¼ÌÆë»ý¼ª¼¤¼²¼£¼¾¼À¼®¼¦¼Ä¼­¼¨¼É¼¢¼Å¼Á¼·¼¡»ü¼½¼§¼¹çáð¢½å¼ËÚµ\
¼³¼¥¼µØ½¼¬çÜî¿¼©êª»øêå¼¿¼»í¶ÙÊôß»þõÒß´÷Ùæ÷¼Â»ûßÒßóóÅñ¤ö«é®ØÀóÇêéïúá§ä©ÛÔÜ¸ÜÁê«ì´ò±õÕöêåìÙ¥Þáê÷éê÷äáÕÝðÜùßâöÝØÞÞªØ¢¼Ò¼Ó¼Û¼Ù½Ç¼×½Å\
¼Ü¼Ö¼Ý¼Î¼Ñ¼Ð¼Þ½É½ËÐ®½Á½Ã½ÆåÈ¼Ú½ÊÙ¤¼Õ½Ä¼ÏÇÑÛ£½Èð¨¼ÔõÊëÎäÐóÕáèáµñÊôÂ½Â¼ØÙ®Ýçä¤òÌØÅê©ë¸ðèçìí¢ÞØïØîòðý¼û¼ä½¨¼þ¼à¼ò¼ì¼á½£¼õ½¥½¢¼æ½¡¼é\
¼ý¼â¼çÚÉ¼ø¼ö¼ùÇ³¼ü¼è¼ú¼ß¼ó¼ô¼ê¼ðÙÔ¼å¼ã¼ñ¼í¼÷½§½¦¼î½¤å¿ôå¼ëê¯ïµ÷µóÈçÌåÀíúêùäÕÝÑñÐðÏõÂëì¼ïÝóÚÙê§é¥èÅàîë¦öäÞöõÝêð½«Ç¿½­½²½µ½¯½±½®½³\
½ªºçç­½©½¬½´½°çÖêñôøôÝä®íäñðÜü½Ì½Ð½»¾õ½ÏÐ£½Ç½Å½¹½¼½Î½¿½É½¾½º½Ë½Á½Ã½Æ½Ê½À½½òÔ½¶½·½¸½Ä½Ñ½È½Íõ´ð¨á½õÓäÐáè½ÂÙ®ðÔÙÕë¸æ¯Ü´öÞÜúàÝÞØ¼Ò½â\
½Ó½á½ç½Ú¼Û½Ô½ã½×½é½è½Ö½Ü½ä½à½Ø½Ù½Ò½Ý½ì½ß½åÚµàµ½ëò¡¿¬ÙÊ½Õèî½Û½ÞÞ×æ¼ôÉ½æò»Ú¦íÙæÝ÷º½êà®ðÜöÚ½ø½ð½ñ½ü¾¡½ö½ô½û½ú½ò¾¢½õ½÷½ï½í½î½þÝ£½óñæ\
èªêîçÆæ¡½ýâË½ùñÆàäÝÀéÈÚáêáâÛ¾­¾©¾«¾ª¾³¾¹¾°¾²¾¯¾´¾¦¾º¾¶¾µ¾®¾»¾¢¾£¾¸¾§¾±ìº¾¥¾¨ãþ¾¤åÉëÖÝ¼ÚåÙÓã½¾·ö¦ëÂâ°æº¾¬ØÙëæåòåÄ¾½¾¼êÁìç¾Í¾Å¾¿¾Æ\
¾Ã¾É¾È¾À¾Ë¾Ì¾¾¾Îð¯èÑ¾Â¾Ê¾ÇÙÖà±ãÎ¾ÄðÕ¾Áôñèê÷ÝÇÒ¾Ý³µ¾ß¾Ù¾Ó¾Ö¾ä¾Þ¾ç¾ã¾Û¾à¾Ü¾å¾Ð¹ñ¾Ø¾Õ¾Úåá¾ÏöÄ¾Ô¾â÷¶îÒ¾æ¾×¾á½Û¾ÒéÙÜì¾ÑÙÆñÕÞäì«ÜÚÚªõ¶\
ö´öÂñÀÜÄé°è¢é·åðï¸èÛôòõáé§êø¾í¿¡È¦¾î¾è¾ë¾ì¾ê¾éîÃä¸ïÔöÁÛ²ïÃáúèð¾ö¾õ¾ø½Ç½Å¾ôØÊ¾òàµ¾÷½ÀáÈâ±¾óéÓ¾ñ¾ðõêçåÛÇ¾ïÚÜÞ§àÙàåïãèöõûØãìßæÞ¾ü¾ý\
¿¤¾ù¿¡¾ú¹ê¿£¾þ¾û¿¥óÞ¿¢öÁ÷åÞÜñä¿¨¿¦¿§¿©ßÇëÌØû¿ª¿­¿®¿¬âýîø¿«ïÇï´âéØÜÛîÝÜ¿´¿¯¿°¿³¿±¿²Ç¶Ù©¼÷íèî«ê¬ãÛÝ¨¿µ¿¹¿¶¿»¿º¿¸îÖ¿·ãÊØø¿¼¿¿¿¾¿½êû\
îíåêèà¿É¿Ë¿Æ¿Í¿Ì¿Î¿ÅºÇ¿Â¿Ê¿Ç¿Ã¿È¿Äã¡¿Áçæéðñ½¿Àà¾òò÷Áî§ë´á³ç¼ï¾òÂò¤ðâïýäÛæìîÝ¿Ï¿Ò¿Ñ¿Ðö¸ñÌ¿Õ¿Ó¿Ôï¬áÇÙÅóí¿Õ¿Ö¿Ø¿×ÙÅ¿Ú¿Ü¿ÛßµÜÒ¿ÙóØÞ¢\
íî¿à¿Þ¿â¿á¿Ý¿ã¿ß÷¼à·ØÚç«Ü¥¿ç¿ä¿å¿æ¿èÙ¨»á¿ì¿é¿êØáßàëÚ¿ëáöä«Û¦¿î¿í÷Å¿ö¿ñ¿ó¿ï¿ò¿õ¿ô¿ðÚ¿Ú²ßÑêÜÚ÷ÛÛæþÞÅÀ£¿÷À¢¿ýÀ¡¿ú¿üåÓ¿øÙç¿ûØÑÞñ¿þÚó\
à°Ø¸êÒî¥ã´õÍñù¿ùã¦óñÝÞà­òñÀ§À¥À¤À¦çû÷ÕãÍï¿öïã§õ«ÊÊÀ¨À©À«ÀªòÒèéÀ­ÂäÀ¶À²À°À®À±À¯ØÝÀ¬ê¹íÇååðøÀ´À³Àµäµêãñ®ô¥íùäþáÁáâïªÀ¼À¶ÀÀÀÃÀ¹À¸ÀÁ\
ÀÄÀºá°À½À¿ÀÂÀ»À·ìµé­î½À¾ñÜïçäíÀÉÀËÀÊÀÇÀÈÀÅãÏòëÀÆï¶Ý¹à¥ÝõïüÀÏÂäÀÍÂçÀÎÀÑÀÌÁÊÀÓÀÒÀÐßëÀÔõ²áÀðìèáîîñìï©ÁËÀÖÀÕÀßß·ãîØì÷¦ÀàÀ×ÀÕÀÛÀáÀÝÀÞ\
Ú³ÀßÀÚÀÙÀÜÙúñçÀØæÐàÏçÐõªéÛÀäã¶ÀâÀãÜ¨ÀïÀíÁ¦ÀûÁ¢ÀîÀëÀúÀñÀýÀöÀôÀ÷Á¥ÀèÀøÁ¨Á£Á§ÀòÀåÀõÀæÀêÙµóÒÀéî¾ÀðÀçõ·ìåó»ÀìÀþîºö¨Á¡ÀóÝ°Á¤ÀùÞ¼Ù³æêíÂ\
åÎå¢ÞºÛªôÏòÃæËèÝõÈçÊæ²ðÝð¿äàèÀß¿ã¦à¦ØªòÛÜÂï®éöóöÀüöâ÷ó÷¯à¬áûÝñðßÛÞÁ©Á¬ÁªÁ³Á·Á¯ÁµÁ«Á®Á¶Á±Á²Á´çöÁ°éçì¡ÞÆÁ­å¥ó¹ñÍñÏöãäòé¬ÝüÁ½Á¿Á¼ÁÁ\
ÁºÁ¸Á¹Á¾Á©ÁÂé£õÔÁ»ÁÀ÷Ëö¦Ý¹Ü®ÁËÁÏÁÆÁÉÁÅÁÄÁÎÁÈÁÊÁÃçÔÁÇâ²å¼ÁÌîÉÁÍðÓÞ¤àÚÞÍÁÐÁÒÁÑÁÔÁÓßÖä£Ùý÷àÛøôóÞæõñÁÖÁÙÃØÁÚ÷ëÁÜÁÕÁÛÁØÁÝÁ×ÁÞâÞÁßôÔõï\
ãÁá×åàÝþê¥éÝßøî¬ì¢ÁîÁìÁíÁéÁêÁãÁäÁèÁëÁáÁåÁâÁæç±ÀâòÈôáßÊÁàñöÜßÁçãöê²èùÛ¹àòöìèÚÁùÁ÷ÁôÁõÂ½ÁøÁïÁöÂµÁñÁðÁòä¯ìÖïÖì¼ï³ðÒç¸åÞöÌæòÁó¿©ÁúÅª\
Â¡Â£ÁýÂ¤Â¢ëÊÁûÁüççÜ×ÁþèÐíÃãñÛâñªÂ¥Â¶Â©ÂªÂ§à¶Â¦ïÎ÷ÃÙÍÂ¨áÐò÷ðüÝäñïÂ·ÁùÂ½Â³Â¼Â¶ÂÌÂ¬Â»Â¹Â²Â¯Â®ß£Â«Â¾ÂµÂ¸ÂºÂ±ëÍààÂ­Â´Â°éûéÖäËðØåÖè´äõ\
ê¤öÔãòôµðµÞ¤èÓéñÛäóüëªïåÂÒÂÑð½ÂÎöÇÂÍèïÂÐÂÏÙõæ®ÂÔÂÓï²ÂÛÂ×ÂÖÂØÂÙÂÚÂÕàðÂÞÂäÂåÂçÂßÂãÂÝÂæÂÜ¿©Âàé¡ÂâÀÓöÃÙÀÞÛÂáãøÞûçóíÑÜýäðÙùëáâ¤ñ§ïÝÂÊ\
ÂÉÂÇÂÃÂÌÂÀÂÄÂÅÂ¿ÂÂÂÆãÌÂÈÂÁÂËÙÍéµÞÛëöñÚïùß¼Ã´ÂíÂðÂèÂéÄ¦ÂîÂêÂëÂïÄ¨Âìó¡æÖè¿áïßéÂòÂôÂóÂñÂöÂõö²Û½Ý¤ÂúÂýÂüÂþÂñÂùÂ÷ÂûÃ¡á£ì×Âø÷´çÏ÷©òýò©\
Ü¬ïÜÃ¦Ã£Ã§Ã¢Ã¤Ã¥òþÚøíËäÝÃ«Ã³Ã°Ã²Ã¬Ã®Ã±Ã¯Ã¨Ã©÷Öë£í®è£êÄÙóÃªì¸ó±á¹êóî¦ÜâÃ­ã÷òúÃ´÷áÃ»ÃÀÃ¿ÃÃÃ·Ã¼Ã½Ã¶ÃºÃÄÃÁÃµ÷ÈÃ¹ÃÕÃÂÃÓÃ¸ñÇáÒä¼é¹äØÃ¾\
Ý®ïÑðÌâ­ÃÇÃÅÃÆîÍÞÑìËí¯ÃÎÃÉÃÍÃËÃÏÃÈëüÃ¥ó·ÃÊãÂòµÃÌô¿ô»ÛÂòìÝùÞ«íæÃÜÃ×ÃØÃÔÃÖÃÛÃÒÃÙÃÕÃÚÃÐÃÓÚ×ßäåµåôôÍ÷ã÷çà×ÃÑìòÞÂãèØÂâ¨ÃÝëßôéÃæÃâÃãÃß\
ÃàÃÞÃåÃáãæäÏÃäö¼äÅëïííÃíÃîÃèÃçÃëÃéçÑÃìåãÃêç¿íðíµèÂß÷ðÅÃðÃïóºØ¿óúßãÃñÃôãÉÃöÃõçÅíªÃóáºÃòãýö¼çëÜåçä÷ªÃ÷ÃûÃüÃËÃùÃúÚ¤Üøî¨êÔäéÃøõ¤ÃýçÑ\
ÎÞÃ»ÍòÄªÄ£Ä©Ä¬Ã°Ä§Ä¦ÃþÄ«Ä¥ÂöÄ®Ä¨Ä¤Ä°ÚÓºÙÄ¯Ä­Ä¡÷áÝëéâÜÔâÉÄ¢ïÒï÷ºÑæÆõöñ¢õøñòÄ³Ä±Ä²çÑíøÙ°òÖöÊßèÄ¿Ä¸Ä¾Ä£Ä·Ä»ÄÂÄÁÄ½Ä¹ÄºÄ¼Ä¶ÀÑÄ²ÄÀÄµãå\
Ä´ÜÙîâØïÛéë¤àÅßíÄÇÄÏÄØÄÃÄÉÄÄÄÈÄÅÄÆÞàñÄëÇïÕÄËÄÄÄÌÄÍÄÎÄÊØ¾ÜµÝÁèÍÙ¦ÄÏÄÑÄÐà«éªôöàïòïàîëîÄÒâÎêÙàìß­ÄÔÅ¬ÄÖÄÕÄÓÄ×è§ßÎòÍîóíÐâ®Ø«ÛñÄØÄÄÄÅ\
Ú«ÄÇÄÚÄÄÄÙÄÛí¥ÄÜàÅßíÄãÄØÄáÄæÄàÄâÄòÄÝÄßÄäÄçÄåÙ£ÄÞêÇíþì»í«ìòâ¥âõöòîêÛèÄêÄîÕ³ÄðéýÄéÄíØ¥öÓÄëÄìð¤ÄèöóÛþÄïÄðÄñÄòÄçôÁæÕÜàëåÄóÄùÄõÄôõæà¿\
Äöô«Ø¿ÞÁÄøÄ÷ò¨ÚíÄúí¥ÄþÄýÅ¡ØúÄüßÌå¸Å¢ÜÑÄûñ÷Å£Å¤Å¦Å¥ÞÖæ¤âîáðÅ©ÅªÅ¨Ù¯ßæÅ§ññÅ­Å«Å¬åóæÛæåæÀÅ¯Å°Å±ÅµÄÈÅ²Å³ÙÐßöÅ´Þùï»Å®îÏô¬í¤Å¶àÞà¸ÇøÅ·\
Å¼Å»Å¹Å¸Åºê±Å½Ú©ñîâæÅÉÅÂÅÀÅÁ°ÇÅ¾ÅÃÅ¿°ÒÝâîÙèËóáÅÉÅÅÆÈÅÄÅÆÅÇÅÈÙ½ßßÝå°ãÅÐÅÌ·¬ÅÑÅËÅÖÅÎÅÊÅÏÞÕ°âÅÍó´ñÈõçãúñáãÝÅÔÅÓÅÖ°òÅÒ°õáÝäèó¦ÅÕåÌÅÜ\
ÅÚÅ×ÅÛÅÝâÒÞËÅØÅÙðåëãáóÅäÅàÅåÅãÅâÅáÅæàÎÅßÅÞì·ïÂàúö¬õ¬ÅçÅèäÔÅóÅíÅöÅôÅõÅîÅïÅòÅñÅéÅëÜ¡ÅêÅìâñó²àØÅð±ãÆ¬Åú·ñÆ¤»µÆªÆ±Æ«Æ¥Æ®Æ­Æ£Æ¯±ÙÅû±â\
ÆÓÆ¢Æ¨ÅüÆ©Æ¡Æ§ôææôØ§ñÔæÎÅþÅýÚÒÅùÚéñ±æéØâçÎÆ°Úüî¼æÇî©Ü±Å÷äÄÝ³ê¶Æ¦ßÁò·àÑÛÜâÏàèèÁÅøÚðõùç¢éèçÂî¢Û¯îëëÝÜÅÛýõäòçß¨Øòóªêúñâ±ãÆ¬ÆªÆ«Æ­±â\
ôæÚÒæéçÂëÝõäêúÆ±Æ®Æ¯ÆÓæôæÎØâçÎÆ°î©Ý³àÑéèóªÆ²Æ³ÜÖë­Ø¯Æ·Æ¶ÆµÆ¸Æ´Æ»ÞÕæÉêòò­æ°é¯Æ½ÆÀÆ¾·ëÆ¿ÆÁÆ¼Æ»ÆºÆ¹æ³öÒèÒÙ·ÆÆÆÅÆÈ·±ÆÄÆÂ²´ÆÓÆÃÆÇçêÚé\
Û¶ØÏóÍÆÉîÇãøê·ð«îÞÆÊÙöÞåÆÕ±©ÆÍÆÌÆË±¤ÆÖÆÓÆÑÆÐÆ×ÆÏå§¸¬ÆÔÆÒäßè±ÆÙÆØàÛÆÎÙéõëïèë«ïäÆäÆðÆøÆÚÆßÆ÷ÆóÆæÆëÆÞÆïÆñÆúÆìÆôÆûÆòÆõÆÛÆÝÆü»üÆåÆíÆà\
Ù¹ÆáÆçÆÜÆýÆùØ½áªç²Æîçù¼©ÆéêÈç÷÷¢è½ÆöéÊì÷àÒõè÷èä¿Þ­íÓòÓÜÎÆêÝÝí¬Ý½ÝÂØÁôëÜ»Ûßì¥ÆèæëÆãñýÜùôìèçãàÆâòàá¨¿¨Ç¡Ù¤Ç¢ÝÖ÷ÄÆþñÊÇ°Ç§Ç®Ç²Ç¨Ç±Ç©\
Ç£Ç¬Ç³Ç«Ç·ÏËÇ¸ò¯Ç´Ù»Ç¦Ý¡ÙÝÇ¶ÇµîÔÜçÇ­Ç¯í©å¹ëÉêùåºÜÍå½Úäç×Ü·ã»ã¥óéÞç÷ÜÇªÇ¤Ç¥èýá©½«Ç¿Ç¹Ç½ÇÀÇ»Ç¼õÄÇºïÏÇ¾éÉãÞæÍïºñßìÁôÇïêòÞê¨ÇÉÇÅÇÄÇÆ\
ÇÇÇÃ¿ÇÈ¸ÇÈÇÏÇÎÇÌ½¶ÇÍéÔÇÊõÎÚ½ÇËã¾ÚÛá½ÇÁÇÂ÷³ã¸íÍÜñØäçØÇÒÇÐÇÔæªÇÓÙ¤ÆöÇÑêüã«óæïÆã»ôòÛ§Ç×ÇØÇÖÇÚÇÙÇÕÇÜÇÞÇÝÇßñæôÀñûÇÛÜËßÄàºéÕàßï·ÞìäÚâÛ\
òûÇéÇ×ÇëÇåÇàÇáÇäÇìÇãÇêÇçÇâÇæóÀíàòß÷ôÇèéÑóäöëôìàõÜÜö¥ÇîÇíñ·òËÚöõ¼öÆóÌÜäÇóÇòÇï³ðÇðÇô¹êÇñôÃÇõò°äÐÙ´òÇöúåÏé±ÇöåÙêäôÜÛÏáìòø÷üÈ¥È¡ÇøÇú\
È¤Ç÷ÇüÇýÐçÈ¢ÇþÇûÈ£öÄêïáéó½Þ¡ëÔãÖÚ°òÐá«Þ¾Û¾ìîñ³ÇùÜÄè³ð¶÷ñôðë¬íáÈ«È¨È°ÈªÈ¦È¯È­È®Ú¹îýÈ¬ç¹Üõòéãªî°È§È©óÜ÷ÜéúÈ´È·È±ãÚÈ¸ÈµÈ¶ã×È³È²í¨Èº\
È¹åÒ÷åÈ»È¾È¼È½÷×ÜÛòÅÈÃÈÂÈÀÈÁð¦ìüÈ¿ÈÅÈÆÈÄèãÜéæ¬ÈôÈÈÈÇßöÈËÈÎÈÏÈÊÈÌÈÉÈÐÈÍÈÒÈÑïþØðâ¿ñÅÜóÝØéíÈÔÈÓÈÕÈÝÈÙÈÚÈÖÈÜÈØÈÞÈÛÈ×ÈßáÉéÅëÀòîáõÈâÈá\
Èàõå÷·ôÛÈçÈëÈêÈåÈèÈéÈäÈæÈìÈãä²å¦çÈàéÞ¸ñàÝêäáï¨ò¬ÈíÈîëÃÈðÈñî£ÈïÜÇÞ¨ò¸èÄÈóÈòÈôÈõÙ¼óèÈøÈöÈ÷ìªØ¦ØíêýëÛË¼ÈûÈüÈùÈúàçÈýÉ¢É¡ÈþôÖö±âÌë§É¥\
É£É¤òªÞúíßÉ¨É©É§ÉÒÜ£É¦çÒëýðþçØöþÉ«ÈûÉªð£É¬ØÄï¤É­É®É±É³É¶ÉµÉ´É·É²É¯ÏÃÉ°É¼ï¡ö®àÄôÄöèì¦êýððßþÉ«É¹É¸õ§É½µ¥ÉÆÉÁÉÂÉÈìøÉÀÉÃÉºÉ¾ÉÅÕ¤É¼ÉÄ\
ÉÉÉ¿Ú¨²ôóµÉÇõÇÉ»Û·÷ÔæÓÜÏæ©µ§ØßîÌäú÷­ëþô®ðÞÛïæóÉÏÉÌÉÐÉËÉÍÌÀÉÑÉÎõüÉÊç´éäìØÛðÉÙÕÙÉÕÉÜÉÔÉÛÉÚÉÒÉØÇÊÉÖÉ×ÉÓÛ¿ô¹è¼ÜæóâòÙäûÉçÉèÉäÉáÕÛÉæÉã\
ÉßÉâÉàÉÝÉå÷êì¨ÉÞî´ØÇÙÜäÜâ¦Ë­ÉíÊ²ÉñÉîÉõ²ÎÉóÉêÉìÉòÉ÷ÉðÉöÉøÉôÉëôÖÚ·Ý·ò×ÉïßÓäÉëÏÉéÚÅïòé©ÝØÉúÉùÊ¡Ê¤Ê¥Éý³ËÊ¢Ê£ÉüÉþÉûóÏêÉáÓäÅíòÊÇÊ±ÊÂÊ®\
Ê¹ÊµÊ²ÊÀÊ¿Ê¦ÊÐÊ·Ê¯Ê½Ê§Ê¼Ê¶ËÆÊÓÊ¾ÊÆÊ³Ê©ÊÔÊÒÊÏÊ«ÊÊÊÌÊÍÊ¬ÊÎÖ³Ê°Ê»ÚÖÊªÊËÊÄÊ¸ÊÅÊ¨ÊÑÊ´³×ÊÈéøÖÅÊÃÊÉÐêÊºß±õ¹ÊÁóßóÂÊ­ó§ÝéìÂêÛÝªõ§öåîæÛõöõ\
ÊÖÊÜÊÕÊ×ÊØÊÚÊìÊÙÊÛÊÞÊÝç·á÷ô¼ÊéÊýÊõÊôÊ÷ÊöÊäÊøÊìÊåÊâÊèÊðÊæÊüÊàÊñÊóË¡ÊùÊúÊçÊáÊîÊêÊëç£ÊßÙ¿ÓáÊûÊãÊþÊïÛÓÊòÊíÝÄäøæ­ì¯Þóïøãðëòë¨ñâØ­Ë£Ë¢\
à§ÂÊË§Ë¥Ë¤Ë¦ó°Ë©Ë¨ãÅäÌË«Ë¬Ëªæ×ãñËµË®Ë­Ë°Ë¯Ë³Ë´Ë²Ë±ËµÊýË·Ë¶Ë¸éÃîåÞ÷åùÝôËÄË¹Ë¾ËÀË¼ËÆÊ³Ë½Ë¿ËÂËÃËÈìëËÁØËËÇÙ¹ËÅËºË»²ÞãôóÓæáòÏçÁïÈãáßÐ\
æ¦ð¸ñêÙîäùÛÌËÍËÎËÉËÏËÊËÐËÌáÔÚ¡ËËã¤ñµäÁáÂÝ¿âìËÒËÑËÔÛÅËÓà²Þ´ì¬âÈäÑàÕïËî¤òôËÕËØËßËÙË×ËÞËàËõËÜËÚöÕËÖËÝÙíÚÕãºóùà¼ä³ËÛÝøö¢ËãËáâ¡ËâËäËæ\
ËêËìËéËåÄòËçÝ´î¡ËèËëËîå¡åäËíìÝÚÇíõËïËðËñöÀâ¸Ý¥é¾áøËùË÷ËõËøÉ¯ËöËóàÂæ¶ËôàÊËòôÈêýíüßïèøËûËýËüËþÌ¤ÍØé½Ëú÷£Ì£í³Ì¡Ì¢ãËàªõÁåÝäðäâîèÌ«Ì¨\
Ì¬Ì©Ì§Ì¥Ì­Ì¦ëÄîÑß¾ìÆÞ·õÌææÛ¢öØÌªÌ¸µ¯Ì½Ì¹Ì¾Ì°Ì³Ì²Ì·Ì¯Ì¿Ì¶å£Ì´ÌºÌ¼Ì±Ìµê¼Ì»Ì®ñûÛ°ìþïÄïâîãÌÆÌÃÌÀÌÉÌÈÌÇÌÁÌÊÌÄÌËÌÅÌÌÙÎàûôÊÌÂâ¼è©ó«õ±ïÛ\
éÌäçó¥ñíï¦ÌÖÌÓÌ×ÌÕÌÒÌÎÌÍÌÑÌÔÌÏß¶èºìâ÷Òä¬ÌÐØ»ßûÌØß¯í«ìýï«ß¯ÌÚÌÛÌÙëøÌÜÌåÌáÌâÌæÌÝÌéÌäÌßÌãÌèÌÞÌêÌëåÑã©ñÓÙÃÌçç¾ç°ðÃõ®ÜèÌàÌìÌïÌíÌîÌðµè\
ÌñãÃÌòî±îäéåãÙÌóÞÝÌõµ÷ÌøÌôÌ÷ÌöôÐñ»óÔìöö¶ÜæÙ¬÷ØòèöæÌúÌùÌû÷ÑÝÆÌýÍ£Í¥Í¢ÌüÍ¦Í¤Í§öªÍ¡æÃòÑî®îúèèÌþÝãÜðÍ¬Í¨Í³Í´Í¯Í­Í²Í°Í©Ù¡äüâúÍ®Í±á¼¶±\
Í«¶²àÌÍªÙÚíÅÜíÛíÍ·Í¶Í¸Íµ÷»î×Í¼ÍÁÍ»Í½Í¾ÍÂÍ¿ÍÀÍÃÍºÍ¹Ý±îÊÝËõ©Ü¢ÍÅÞÒÍÄî¶åèÍÆÍËÍÈÍÇß¯ÍÊÍÉìÕÍÍÍÌÍÊÍÎëàâ½êÕ¶ÚÙÛÍÐÍÑÍÏÍ×ÍÓÍØÆÇÍÕÍÙÍÖÍÔ¶æ\
éÒÍÒÙ¢ãûõÉØ±ö¾íÈâÕèØóêÛçèÞîèõ¢ÍßÍÚÍÞÍÛ°¼ÍàÍÜÍÝæ´ØôëðÍâÍááËÍòÍêÍíÍåÍæÍäÍëÍçÍìÍðÍèÍñÍóÂûæýçºÍîîµÜ¹ÍïÝ¸çþÝÒòêÃäÍãØàÍéëäÍõÍûÍùÍøÍöÍü\
ÍýÍôÍúÃ¢Í÷Øèã¯÷ÍÞÌéþÎªÎ»Î´Î¯Î½ÎÀÍþÎ§Î¬Î¢Î£ÒÅÎ¶ÎºÎ¨Î¾Î©Î¥Î°Î²Î¤Î¿Î±Î·Î¸Î¹Î³Î¼Î¡á¡ÎµÎ®Î­Þ±ÙËãÇìÐÚÃåÔâ«Î¦ì¿æ¸ÚóÛ×çâàøä¶áÍôºáËè¸â¬Î«\
ðôä¢öÛÚñÝÚãíê¦àíÎÄÎÊÎÅÎÂÎÈÎÆÎÇö©ÎÃÎÉÎÁãëØØãÓè·ÎÌÎËÎÍÞ³ÝîÎÒÎÕÎÔÎÖÎÑÅ¶ÙÁÎÐà¸ä×ÎÓÎÎá¢ÎÏíÒö»ë¿Ý«ÎÞÎïÎåÎñÎä¶ñÎáÎâÍöÎÝÎçÎóÎèÎÚÎÛÎéÎìÎð\
ÎòÎíì¶Î×Ø£ÎãÎØÎÜÎêÎîÎàÎßÎëâèÎæðÄßíâÐå»æÄöÈä´åüòÚìÉðÍæðÚùåÃè»ØõÚãÜÌÎÙâäÛØêõ÷ùðíÎ÷ÏµÏ¢Ï£Ï²Ï¸Ï°Ï¯Ï·ÎüÏ®Ï¤ÎöÏ´Ï§ÎôÏ¦À°ÏªÏ¡ÎõÎýáãÙâÎþ\
Ï±ìûÏ¶Ï¥ÆÜÎûÎúÞÉó£çôÏ­ÙÒôËÏ¬Ï¨æÒÜçìäêØõµõèÏ³ãÒäÀì¨ó¬ôâÚôâ¾ä»ðªÛ­ñ¶Ï«òáßñôªì¤ô¸Ï©Ý¾ôÑÎøåïêêÎùéØìùÝß÷ûÝûÏÂÏÄÏÀÏÅ»£Ï½Ï¼Ï¿ÏÁÏ¾Ï¹ÏÃÏº\
Ï»åÚè¦ßÈáò÷ïóÁíÌèÔðý¼ûÏÖÏÈÏØÏÔÏßÏÞÏÕÏÉÏ×ÏÊÏÍÏÝÏÐÏ´ÏÜÏÌÏÓÏÒÏÎÏËÏÛÏÆÏÙõ£ÏÏæµÏÑåßÏ³õÐÏÚÞºÜÈÏÇö±ò¹á­õÑðïôÌÝ²ðÂìììÞóÚáýÙþë¯ÏëÏàÏòÏóÏñ\
Ïì½µÏãÏîÏçÏíÏêÏéÏäÏåÏæÏèÏáÏïâÃ÷ÏÏâÏðæøâÔÜ¼ç½ößÝÙó­Ð¡Ð¦ÏûÐ£Ð§ÏúÐ¢ÏþÏôÏ÷Ð¤Ð¥ÏüÏöæçÏùóïäìÏøèÉåÐÏõÏýóã÷Ìç¯èÕáÅßØòÙÐ©½âÐ´ÑªÐ»Ð­Ò¶Ð°Ð²\
ÆõÐªÐµÐ¬Ð±Ð¹Ð¯Ð³Ð¶Ð¼Ð®Ð¸Ðºò¡ÙÉÐ·ÙôÛÆé¿ÛÄÐ«äÍçÓÐ¨â³åââÝß¢éÇç¥õóÞ¯å¬ÐÄÐÂÐÅÑ°ÐÁÐÀÐ½Ü°Ð¾ÐÆÐÃì§öÎÐ¿ê¿Ø¶ïâÐÐÐÔÐÎÐËÐÇÊ¡ÐÍÐÒÐÕÐÌÐÑÐÉÐÊÐÓ\
ÐÏÐÈÜþã¬íÊÚêâ¼Üôß©ÐÖÐÛÐ×ÐØÐÜÐÙÐÚÜºÐÞÐÝÐãËÞÐäÐßÐå³ôÐàÐáá¶ÐââÊâÓð¼ßÝäå÷Ûõ÷ÐíÐëÐèÐøÐòÐìÐéÐ÷ÐðÐçÐóÐîÓõÐöÐôÐñÐõñãÐæÐêÚ¼çïäÓÞ£ÛÃä°ìãèò\
Û×íìÐïí¹äªôÚõ¯Ñ¡ÐûÐþÐýÈ¯ÐüÐùè¯ÐúÑ£äÖÚÎìÅêÑìÓÑ¤îçäöÝæÑ¢é¸ãùÙØÞïïàíÛðçÑ§ÑªÑ©Ñ¦Ï÷Ñ¨ÚÊÑ¥õ½í´àå÷¨Ñ°ÑµÑ²Ñ¸Ñ¶Ñ·Ñ­Ñ¯Ñ«Ñ®¿£Ñ±Ü÷áßÑ¬Ñ³Þ¹Ñ´\
ä±âþõ¸êÖä­»çÙãá¾ñ¿â´Û÷öàÛ¨Þ¦ÑÇÑ¹ÑÀÑ½ÑÅÇÆÆ¥ÑºÑÃÑ¾ÑÂÑÈÑ¼Ñ»ÑÆÑÄÑ¿æ«ÔþØóåÂÑÁçðë²í¼èâíýÛëðéÞëá¬ñâÑÔÑÛÑÐÑÏÑéÑÝÑÓÑÌÑÉÑàÑØÑÕÑ×ÑÒÑÚÑÎÑçÑá\
ÒóÑåÑÊÑÞÑÜÑÖÑãÑæÑÍêÌóÛÙÈÇ¦éÜÙ²ÑÙæÌÑßäÎÑËÑâÙð÷ÊÑèçüÑÑãÕåû÷ÐÛ³ØÍëÙÝÎëçØÉìÍÜ¾Û±âûÚÝãÆØßî»ÑääÙáÃ÷úÚçõ¦÷üÑùÑôÑøÑîÑóÑëÑïÑòÑöÑõÑ÷Ñìì¾÷±\
ÑðÑêí¦âóÑúÑñÑíìÈòÕãóáàÒªÔ¼Ò©Ò¡ÑýÑüÌÕÒ£Ò§ÑûÒ«Ò¦Ò¢ÑþÔ¿Ò¤Ò¥Ø²ê×ëÈ½ÄßºôíèÃðÎØ³ñºáæÅ±çÛÒ¨áÊé÷ï¢çò÷¥Ò²ÒµÒ¹Ò¯Ò°Ò¶Ò³Ò®Ð°ÒºÑÊÚËÒ±»©Ò´Ò·×§\
êÊÚþÒ¸Ò­ìÇÒ¬ØÌÞÞîôÒ»ÒÔÒâÒÑÒåÒéÒ×ÒàÒÀÒÂÒ½ÒæÒìÒÉÒÓÒËÒÁÒÆÒÅÒÕÒÇÒÛÒÚÒÒÎ²ÒíÒë°¬ÒäÒÄÉßÒØÒÖÒÎÒèÒãÒÌÒßÒÐÒÝÒêÒçÜ²æäÒ¾ÒÏâùÒÃÒáÞÈÞÚÒÊÒÍêÝß×\
Òïñ´ÒÈÒî¶êçËåÆØýÒ¼â¢Ú±ÞÄï×ß®ÒÜâÂäôéóðùØ×áÚôèÒÙß½ÜÓÞ²âøì½àÉàæá»íôÒÞìÚÒ¿ôàßÞì¥òæÙ«ðêîÆã¨éìØæÛüÜèÛÝô¯÷ðØîñ¯ôýïîÒòÒýÒôÒøÓ¡ÒõÒþÑÌÒûÒú\
ÒóÒüÒ÷ÒùÒöØ·ÒñÒðäÎñ«â¹ë³ò¾ö¸à³Û´Ûóñ¿Ûßö¯Ü§ßÅáþä¦î÷ÜáÓ¦Ó¢Ó°ÓªÓ­Ó²Ó³Ó¯Ó®Ó¥Ó£Ó¤Ó±ò£ÝºÓ¨Ó«Ó¬âßÛ«çøå­ðÐÝÓÓ§àÓÜþÓ©éºó¿ÙøÜãëôäÞñ¨äëè¬Þü\
ÝöÓýÓ´à¡ÓÃÓÀÓµÓÂÓ¿ÓºÓ¹Ó¶Ó½Ó¾çßÓ»Ó¼ÛÕ÷ÓÓÁã¼Ù¸ð®Ó¸Ü­Ó·ïÞà¯÷«ÓÐÓÖÓÉÓÒÓÑÓÎÓÅÓÌÓÍÓÈÓÇÓÄÓ×ÓÏÓÕÓÊÓÆÓÓØüÓÔå¶ÓËéàôíòÊë»÷îØÕðàèÖàóÝµòÄÙ§ßÏ\
öÏÞÌÝ¬Ý¯÷øòöòøîðÓÚÓëÓïÓàÓûÓñÔ¤ÓýÓùÓöÓêÓã¹ÈÓòÓèÎ¾ÓîÓúÓüÓðÚÍâÅÔ¥ÓÞÔ£Óþì¶ÓæÓôÓÝÓßÔ¢ÓâÓäÔ¡Ó÷ÓõÓíÓéè¤Ø¹ÓìÓáì£ìÏÎµÖàÓçÓÜÓØô§â×Ô¦Ø®ÚÄîÚ\
í²ÓÙåýå÷ÓåêÅÓÛÙ¶ðÖÓøÝÒóÄðÁâÀëéãÐö¹ö§àöÝÇÓóáÎêìñÁñ¾ðöæúìÙô¨æ¥àôÞíòâìÛØñðõòõÝ÷áüÔ­Ô±ÔªÔºÔ¶Ô¸Ô´Ô°ÔµÔ²Ô®Ô¹Ô¬Ô©Ô¨Ô·Ô³Ô«Ô§Ô¯ë¼ÞòæÂà÷ãä\
ö½è¥Ü¾ð°ó¢éÚíóÜ«ÛùóîËµÔÂÔ»Ô¼Ô½ÀÖÔÀÔÄÔÃÔ¾Ô¿ÔÁîáë¾éÐèÝÙßå®Ô±ÔÆÔË¾ùÔÊÔÎÔÏÔÐÔÈÔÌÔÉÜ¿ÔÍóÞÔÇÛ©ç¡ëµÔÅã³ã¢éæè¹ìÙêÀáñÔÓÔÛÔúÔÒÕ¦ÔÑßÆÞÙÔÚÔÙ\
ÔØÔÖÔ×ÔÕ×ÐÔÔáÌçÞÔÞÔÛÔÝô¢ÔÜè¶öÉêÃôõÞÙôØ²ØÔáÔàÔßê°ÞÊÕàæàÔìÔçÔâÔãÔêÔäÔåÔîÔæÔëÔïÔíÔèÔéßðçØÔòÔðÔóÔñ²àÕ¦ØÓØÆßõóÐàýê¾ô·óååÅÔôÔõÚÚÔøÔöÔù\
×ÛÔ÷çÕêµîÀï­²éÕ¨ÔúÕ©Õ£À¯ÔýÕ¤Õ§Õ¢Õ¦ß¸Õ¡ÔþÔüÔûà©òÆÕ¥ßå×õé«íÄÞêßîðä÷þÔñ¼À²àÕ®Õ¬Õ¯Õ«ÕªÕ­µÔíÎñ©Õ½Õ¹Õ¾Õ¼Õ¶²üÕ²Õ´Õ³Õ°ÕµÕ¿Õ»Õ±ÕÀÕ¸Õ·Õºì¹\
ÚÞÞø³¤ÕÅÕÂÕÆÕÉÕÊÕÏÕÌÕÈÕÇÕÍÕËÕÃè°ÕÄÕÎáÖÕÁÛµâ¯ó¯æÑá¤Øë×Å³¯ÕÕÕÒÚ¯ÕÔÕÐÕÙÕÑÕ×ÕÖ×¦³°ÕÓÕØîÈèþóÉßúÕâ×ÅÕßÕÛÕÜÕãéüÕÚß¡ÚØÕÞñÞðÑÕÝô÷ÕáèÏíÝòØ\
ÕàÕâÕæÕòÕóÕðÕñÕäÕëÕêëÞÕïÕìÕíÛÚêâÕåìõÕçð¡ÕéèåÕîéôóðð²é»çÇî³ëÓÕèäÚé©Ýèä¥ÕýÕþÕùÖ¤ÕûÕ÷¶¡Ö£Ö¢ÕõÕöÕúï£ÕôáçÕüÖ¡ÚºóÝÕøá¿îÛöëÖ®Ö»ÖªÖÁÖÆÖ±\
Ö¸ÖÎÊ¶ÖÊÖ§ÖÂÖ¾ÖÃÖ¹Ö°ÖµÊÏÖ´Ö¯ÖÇÖ½Ö¼Ö²Ö¦Ö³ÖÈÖ¥Ö¶Ö·Ö¬ÖÍÖÀÖ«ÖÉáçÖ­ÖÄìóÖ¿ö£ÖºÖ¨ÖÅÖÏÖËÖ©ÚìïôòÎÜÆêÞìíåëØ´ÖÌèÎëÕÛ¤ðºÞýæïðëåéèäè×ôêõÅõ¥àù\
õÜõÙéòâåèÙÛúíééùëùõôÖÐÖÖÖØÖÚÖÕÖÒÖÓÖÙÖ×ÖÔÚ£õàïñÖÑô±âìó®ÖÝÖÜÖÞÖÛÖæÖçÖèÖåÖäÖáÖàëÐæûÖâôíÖãç§Ößæ¨íØô¦ôüßúÝ§Ö÷×¡Êõ×¢ÖîÊôÖúÖøÖðÖìÖéÖþ×¤\
Öñ×£ÖïÖùÖíÖòÖöÖýÖêÖóñÒÖüÖëóÃä¾îùÖõØùóçÙªÖôÛ¥èÌÖûô¶ìÄä¨÷æéÆÜÑôãäóéÍõîÜïðñðæ×¥×¦ÎÎ×ªÒ·×§àÜ´«×ª×¨×«×¬×©âÍ×­ãçò§ßù×°×´×¯×³×²×±×®´±Ù×\
ÞÊí°×·×¹×µ×º×¶×¸ã·çÄö¿æí×¼ÍÍ×»ëÆñ¸×ÅÖø×À×½×¿½Éßª×Ã×¾×Ç×Æ×ÁäÃ×Äí½ïíÙ¾åªä·×ÂÚÂìÌìú×Ó×Ô×Ê×Ö×Ï×Ð×È×Ëæ¢×Ì×É×Îí§è÷Ö¨×ÍÚÑóÊê¢êß×Õ×Ñ×ÒôÒ\
ç»ö·÷ÚæÜö¤õþíöïÅáÑßÚïöôôÜëööñè×Ü×Ú×Ý×Û×Ù×Ø××èÈôÕÙÌëê×ß×à×ÞÚÁ×áæãÚîÛ¸öí×é×ã×å×æ×ä×è×âÙÞÝÏ×çïß×ê×¬×ëß¬çÚõò×î×ï×ì¶Ñ×í¾×õþÞ©×ð×ñé×ß¤\
÷®×÷×ö×ø×ó×ù×ò×ôÔä×Á´éÚèóÐëÑ×õâôàÜ";


const U32 phonetic_offset[TOTAL_PHONETIC] = {
	0,  	14, 	60, 	100, 	106, 	154, 	206, 	230, 	272, 	300, 	356, 	414, 	432, 	450, 	568, 	620, 
	652, 	662, 	694, 	722, 	802, 	842, 	850, 	872, 	898, 	910, 	928, 	940, 	946, 	954, 	1004, 	1020, 
	1074, 	1130, 	1160, 	1178, 	1226, 	1282, 	1360, 	1388, 	1422, 	1480, 	1492, 	1518, 	1532, 	1550, 	1570, 	1582, 
	1622, 	1646, 	1654, 	1678, 	1694, 	1726, 	1738, 	1768, 	1804, 	1848, 	1902, 	1926, 	1962, 	1974, 	1976, 	2004, 
	2084, 	2086, 	2166, 	2202, 	2238, 	2276, 	2280, 	2318, 	2344, 	2394, 	2412, 	2430, 	2462, 	2506, 	2572, 	2574, 
	2580, 	2608, 	2628, 	2676, 	2710, 	2768, 	2810, 	2852, 	2854, 	2858, 	3024, 	3048, 	3072, 	3122, 	3148, 	3186, 
	3260, 	3262, 	3274, 	3298, 	3338, 	3382, 	3468, 	3494, 	3502, 	3542, 	3556, 	3616, 	3630, 	3668, 	3676, 	3702, 
	3762, 	3782, 	3824, 	3884, 	3890, 	3898, 	3916, 	3950, 	3980, 	4074, 	4102, 	4116, 	4174, 	4224, 	4310, 	4332, 
	4374, 	4594, 	4706, 	4846, 	4894, 	4988, 	5080, 	5148, 	5230, 	5240, 	5292, 	5404, 	5438, 	5500, 	5534, 	5548, 
	5574, 	5602, 	5622, 	5638, 	5708, 	5720, 	5734, 	5744, 	5762, 	5786, 	5798, 	5820, 	5826, 	5858, 	5914, 	5936, 
	5950, 	5978, 	6002, 	6046, 	6074, 	6114, 	6130, 	6170, 	6180, 	6338, 	6340, 	6392, 	6428, 	6470, 	6496, 	6546, 
	6604, 	6650, 	6652, 	6688, 	6720, 	6808, 	6830, 	6836, 	6852, 	6910, 	6952, 	6954, 	6988, 	7006, 	7044, 	7064, 
	7116, 	7120, 	7176, 	7190, 	7230, 	7288, 	7318, 	7350, 	7362, 	7394, 	7420, 	7424, 	7498, 	7516, 	7564, 	7568, 
	7594, 	7616, 	7636, 	7646, 	7674, 	7682, 	7690, 	7694, 	7696, 	7700, 	7748, 	7778, 	7782, 	7796, 	7824, 	7828, 
	7850, 	7866, 	7878, 	7880, 	7894, 	7896, 	7900, 	7918, 	7926, 	7932, 	7956, 	7982, 	8002, 	8040, 	8062, 	8086, 
	8116, 	8122, 	8158, 	8308, 	8334, 	8362, 	8372, 	8396, 	8424, 	8466, 	8472, 	8526, 	8674, 	8690, 	8782, 	8824, 
	8884, 	8914, 	8962, 	9012, 	9030, 	9080, 	9150, 	9192, 	9214, 	9222, 	9236, 	9250, 	9262, 	9270, 	9304, 	9308, 
	9310, 	9340, 	9352, 	9392, 	9398, 	9414, 	9418, 	9426, 	9442, 	9454, 	9470, 	9482, 	9504, 	9518, 	9520, 	9522, 
	9562, 	9570, 	9646, 	9674, 	9714, 	9754, 	9756, 	9814, 	9848, 	9984, 	10012, 	10108, 	10114, 	10126, 	10134, 	10144, 
	10154, 	10162, 	10182, 	10252, 	10284, 	10312, 	10356, 	10364, 	10402, 	10418, 	10452, 	10492, 	10528, 	10582, 	10634, 	10670, 
	10680, 	10682, 	10692, 	10740, 	10770, 	10802, 	10812, 	10848, 	10896, 	10908, 	10940, 	10950, 	10966, 	10984, 	11038, 	11060, 
	11066, 	11124, 	11156, 	11280, 	11310, 	11320, 	11356, 	11470, 	11622, 	11668, 	11766, 	11826, 	11886, 	11970, 	12004, 	12050, 
	12066, 	12104, 	12174, 	12228, 	12252, 	12316, 	12380, 	12516, 	12566, 	12638, 	12690, 	12908, 	12980, 	13058, 	13064, 	13114, 
	13200, 	13390, 	13460, 	13496, 	13548, 	13564, 	13584, 	13606, 	13622, 	13654, 	13684, 	13686, 	13690, 	13708, 	13762, 	13786, 
	13828, 	13876, 	13914, 	13954, 	13956, 	14022, 	14068, 	14228, 	14262, 	14310, 	14410, 	14416, 	14424, 	14446, 	14468, 	14488, 
	14498, 	14544, 	14622, 	14644, 	14662, 	14684, 	14696, 	14712, 	14722, 
};


int compare_U32(U32 a, U32 b, int bits)
{
	a = a >> bits;
	b = b >> bits;
	return (a > b) - (a < b);
}



U32 phb_sub_getPinyinValue(U8 *str)
{
	register U32 h;
	register U8 *p;
	int i = 0;

	p = (U8 *)str ;

	for ( h = 0; *p && i < 6; p++ )
	{
		h = h << 5 | ((*p - 'a' + 1) & 0x1F); 
		i++;
	}

	for ( ; i < 6; i++ )
		h = h << 5;

	return h;
}

// ÊäÈëÆ´Òô, ·µ»ØÆ´Òô¶ÔÓ¦µÄºº×Ö 
int phb_idxSearch_getChLtr(U8 *pinyin, const char** ChLtr)
{
	U32 value = phb_sub_getPinyinValue(pinyin);
	U32 start = 0, end = TOTAL_PHONETIC - 1, middle = (start + end) / 2;
	int bits = 30 - 5 * strlen(pinyin);

	*ChLtr = NULL;

	if (strlen(pinyin) > 6)
		return -1;

	if (compare_U32(phonetic_hash[start] , value, bits) > 0)
		return PHB_FAIL;

	if (compare_U32(value, phonetic_hash[end], bits) > 0)
		return PHB_FAIL;

	if (compare_U32(phonetic_hash[start], value, bits) == 0)
	{
		//strncpy((char*)ChLtr, phonetic_section[start], outMaxLen);
		*ChLtr = phonetic_section + phonetic_offset[start];
		return PHB_SUCCESS;
	}

	while (end - start > 1)
	{
		(compare_U32(phonetic_hash[middle], value, bits) < 0) ? (start = middle) : (end = middle);
		middle = (start + end) / 2;
	}

	if (compare_U32(phonetic_hash[++start], value, bits) == 0)
	{
		//strncpy((char*)ChLtr, phonetic_section[start], outMaxLen);
		*ChLtr = phonetic_section + phonetic_offset[start];
		return PHB_SUCCESS;
	}
	else 
		return PHB_FAIL;
}






