#ifndef CONVERT_UTF_H
#define CONVERT_UTF_H

/*************************************************************************
 * DEFINES
 *************************************************************************/

/*************************************************************************
 * TYPEDEFS
 *************************************************************************/

typedef enum
{
    UTF16BE_UE,
    UTF16LE_UE
    
} UTF16Endianness_en;

/*************************************************************************
 * FUNCTION DECLARATIONS
 *************************************************************************/

/*-----------------------------------------------------------------------------
* 函数:	ConvertUTF8toUTF16
* 功能:	将UTF8编码的字符串转化为UTF16编码的字符串
* 参数:	utf8	-- UTF8编码的字符串
*		utf16	-- UTF16编码的字符串
* 返回:	转换的字符的个数
*----------------------------------------------------------------------------*/
int ConvertUTF8toUTF16( char * utf8, char * utf16 );


/*-----------------------------------------------------------------------------
* 函数:	ConvertUTF16toUTF8
* 功能:	将UTF16编码的字符串转化为UTF8编码的字符串
* 参数:	utf16		-- UTF16编码的字符串
*		endianness	-- 大端或小端格式
*		utf8		-- UTF8编码的字符串
* 返回:	转换的字符的个数
*----------------------------------------------------------------------------*/
int ConvertUTF16toUTF8( char * utf16, UTF16Endianness_en endianness, char * utf8 );


/*-----------------------------------------------------------------------------
* 函数:	ConvertASCIItoUTF8
* 功能:	将ascii编码的字符串转化为UTF8编码的字符串
* 参数:	ascii		-- ASCII编码的字符串
*		utf8		-- UTF8编码的字符串
* 返回:	转换的字符的个数
*----------------------------------------------------------------------------*/
int ConvertASCIItoUTF8( char * ascii, char * utf8 );


#endif /* CONVERT_UTF_H */
