#ifndef CRC_DRV_H
#define CRC_DRV_H

/*************************************************************************
 * INCLUDES
 *************************************************************************/


/*-----------------------------------------------------------------------------
* 函数:	CRC32_Generate
* 功能:	计算一块内存中的数据的CRC
* 参数:	CRC		-- CRC的存放地址
*		Data	-- 校验的数据
*		Length	-- 校验的数据的长度（字节数）
* 返回:	CRC，	通过指针参数返回
*----------------------------------------------------------------------------*/
void CRC32_Generate(unsigned long *CRC, unsigned char *Data, int Length);

#endif //CRC_DRV_H
