/**********************************************************
*
* 行政区划 列表
*
*
*
***********************************************************/

/*
【华 北】 北京市 天津市 河北省 山西省 内蒙古自治区
【东 北】 辽宁省 吉林省 黑龙江省
【华 东】 上海市 江苏省 浙江省 安徽省 福建省 江西省 山东省
【中 南】 河南省 湖北省 湖南省 广东省 广西壮族自治区 海南省
【西 南】 重庆市 四川省 贵州省 云南省 西藏自治区
【西 北】 陕西省 甘肃省 青海省 宁夏回族自治区 新疆维吾尔自治区
【港澳台】 香港特别行政区 澳门特别行政区 台湾省

  XX XX XX
   |  |  |____两位字码，01-18表示市辖区或地辖区，21-80表示县(旗)，81-99表示省直辖县级市
   |  |_______两位字码，其中01-20、51-70表示省直辖市，21-50表示地区(州、盟)
   |__________两位字码，代表省
*/


#include "Op_Common.h"

#if 1
/* -------------------------县/区/县级市------------------------------ */


//130000",(U8 *)"河北省",

 //130100",(U8 *)"石家庄市",
 const AREAnode HB_shijiazh[23] = 
{
    (U8 *)"130102",(U8 *)"长安区", NULL,0,
    (U8 *)"130103",(U8 *)"桥东区",NULL,0,
    (U8 *)"130104",(U8 *)"桥西区",NULL,0,
    (U8 *)"130105",(U8 *)"新华区",NULL,0,
    (U8 *)"130107",(U8 *)"井陉矿区",NULL,0,
    (U8 *)"130108",(U8 *)"裕华区",NULL,0,
    (U8 *)"130121",(U8 *)"井陉县",NULL,0,
    (U8 *)"130123",(U8 *)"正定县",NULL,0,
    (U8 *)"130124",(U8 *)"栾城县",NULL,0,
    (U8 *)"130125",(U8 *)"行唐县",NULL,0,
    (U8 *)"130126",(U8 *)"灵寿县",NULL,0,
    (U8 *)"130127",(U8 *)"高邑县",NULL,0,
    (U8 *)"130128",(U8 *)"深泽县",NULL,0,
    (U8 *)"130129",(U8 *)"赞皇县",NULL,0,
    (U8 *)"130130",(U8 *)"无极县",NULL,0,
    (U8 *)"130131",(U8 *)"平山县",NULL,0,
    (U8 *)"130132",(U8 *)"元氏县",NULL,0,
    (U8 *)"130133",(U8 *)"赵　县",NULL,0,
    (U8 *)"130181",(U8 *)"辛集市",NULL,0,
    (U8 *)"130182",(U8 *)"藁城市",NULL,0,
    (U8 *)"130183",(U8 *)"晋州市",NULL,0,
    (U8 *)"130184",(U8 *)"新乐市",NULL,0,
    (U8 *)"130185",(U8 *)"鹿泉市",NULL,0,
  };
 //130200",(U8 *)"唐山市",
 const AREAnode HB_tangsh[14] = 
{
    (U8 *)"130202",(U8 *)"路南区",NULL,0,
    (U8 *)"130203",(U8 *)"路北区",NULL,0,
    (U8 *)"130204",(U8 *)"古冶区",NULL,0,
    (U8 *)"130205",(U8 *)"开平区",NULL,0,
    (U8 *)"130207",(U8 *)"丰南区",NULL,0,
    (U8 *)"130208",(U8 *)"丰润区",NULL,0,
    (U8 *)"130223",(U8 *)"滦　县",NULL,0,
    (U8 *)"130224",(U8 *)"滦南县",NULL,0,
    (U8 *)"130225",(U8 *)"乐亭县",NULL,0,
    (U8 *)"130227",(U8 *)"迁西县",NULL,0,
    (U8 *)"130229",(U8 *)"玉田县",NULL,0,
    (U8 *)"130230",(U8 *)"唐海县",NULL,0,
    (U8 *)"130281",(U8 *)"遵化市",NULL,0,
    (U8 *)"130283",(U8 *)"迁安市",NULL,0,
  };
 //130300",(U8 *)"秦皇岛市",
 const AREAnode  HB_qinhd[7] = 
{
    (U8 *)"130302",(U8 *)"海港区",NULL,0,
    (U8 *)"130303",(U8 *)"山海关区",NULL,0,
    (U8 *)"130304",(U8 *)"北戴河区",NULL,0,
    (U8 *)"130321",(U8 *)"青龙满族自治县",NULL,0,
    (U8 *)"130322",(U8 *)"昌黎县",NULL,0,
    (U8 *)"130323",(U8 *)"抚宁县",NULL,0,
    (U8 *)"130324",(U8 *)"卢龙县",NULL,0,
  };
 //130400",(U8 *)"邯郸市",
 const AREAnode HB_hand[19] = 
{
    (U8 *)"130402",(U8 *)"邯山区",NULL,0,
    (U8 *)"130403",(U8 *)"丛台区",NULL,0,
    (U8 *)"130404",(U8 *)"复兴区",NULL,0,
    (U8 *)"130406",(U8 *)"峰峰矿区",NULL,0,
    (U8 *)"130421",(U8 *)"邯郸县",NULL,0,
    (U8 *)"130423",(U8 *)"临漳县",NULL,0,
    (U8 *)"130424",(U8 *)"成安县",NULL,0,
    (U8 *)"130425",(U8 *)"大名县",NULL,0,
    (U8 *)"130426",(U8 *)"涉　县",NULL,0,
    (U8 *)"130427",(U8 *)"磁　县",NULL,0,
    (U8 *)"130428",(U8 *)"肥乡县",NULL,0,
    (U8 *)"130429",(U8 *)"永年县",NULL,0,
    (U8 *)"130430",(U8 *)"邱　县",NULL,0,
    (U8 *)"130431",(U8 *)"鸡泽县",NULL,0,
    (U8 *)"130432",(U8 *)"广平县",NULL,0,
    (U8 *)"130433",(U8 *)"馆陶县",NULL,0,
    (U8 *)"130434",(U8 *)"魏　县",NULL,0,
    (U8 *)"130435",(U8 *)"曲周县",NULL,0,
    (U8 *)"130481",(U8 *)"武安市",NULL,0,
  };
 //130500",(U8 *)"邢台市",
 const AREAnode HB_xingt[19] = 
{
    (U8 *)"130502",(U8 *)"桥东区",NULL,0,
    (U8 *)"130503",(U8 *)"桥西区",NULL,0,
    (U8 *)"130521",(U8 *)"邢台县",NULL,0,
    (U8 *)"130522",(U8 *)"临城县",NULL,0,
    (U8 *)"130523",(U8 *)"内丘县",NULL,0,
    (U8 *)"130524",(U8 *)"柏乡县",NULL,0,
    (U8 *)"130525",(U8 *)"隆尧县",NULL,0,
    (U8 *)"130526",(U8 *)"任　县",NULL,0,
    (U8 *)"130527",(U8 *)"南和县",NULL,0,
    (U8 *)"130528",(U8 *)"宁晋县",NULL,0,
    (U8 *)"130529",(U8 *)"巨鹿县",NULL,0,
    (U8 *)"130530",(U8 *)"新河县",NULL,0,
    (U8 *)"130531",(U8 *)"广宗县",NULL,0,
    (U8 *)"130532",(U8 *)"平乡县",NULL,0,
    (U8 *)"130533",(U8 *)"威　县",NULL,0,
    (U8 *)"130534",(U8 *)"清河县",NULL,0,
    (U8 *)"130535",(U8 *)"临西县",NULL,0,
    (U8 *)"130581",(U8 *)"南宫市",NULL,0,
    (U8 *)"130582",(U8 *)"沙河市",NULL,0,
  };
 //130600",(U8 *)"保定市",
 const AREAnode HB_baod[25] = 
{
    (U8 *)"130602",(U8 *)"新市区",NULL,0,
    (U8 *)"130603",(U8 *)"北市区",NULL,0,
    (U8 *)"130604",(U8 *)"南市区",NULL,0,
    (U8 *)"130621",(U8 *)"满城县",NULL,0,
    (U8 *)"130622",(U8 *)"清苑县",NULL,0,
    (U8 *)"130623",(U8 *)"涞水县",NULL,0,
    (U8 *)"130624",(U8 *)"阜平县",NULL,0,
    (U8 *)"130625",(U8 *)"徐水县",NULL,0,
    (U8 *)"130626",(U8 *)"定兴县",NULL,0,
    (U8 *)"130627",(U8 *)"唐　县",NULL,0,
    (U8 *)"130628",(U8 *)"高阳县",NULL,0,
    (U8 *)"130629",(U8 *)"容城县",NULL,0,
    (U8 *)"130630",(U8 *)"涞源县",NULL,0,
    (U8 *)"130631",(U8 *)"望都县",NULL,0,
    (U8 *)"130632",(U8 *)"安新县",NULL,0,
    (U8 *)"130633",(U8 *)"易　县",NULL,0,
    (U8 *)"130634",(U8 *)"曲阳县",NULL,0,
    (U8 *)"130635",(U8 *)"蠡　县",NULL,0,
    (U8 *)"130636",(U8 *)"顺平县",NULL,0,
    (U8 *)"130637",(U8 *)"博野县",NULL,0,
    (U8 *)"130638",(U8 *)"雄　县",NULL,0,
    (U8 *)"130681",(U8 *)"涿州市",NULL,0,
    (U8 *)"130682",(U8 *)"定州市",NULL,0,
    (U8 *)"130683",(U8 *)"安国市",NULL,0,
    (U8 *)"130684",(U8 *)"高碑店市",NULL,0,
  };
 //130700",(U8 *)"张家口市",
 const AREAnode HB_zhangjk[17] = 
{
    (U8 *)"130702",(U8 *)"桥东区",   NULL,0,
    (U8 *)"130703",(U8 *)"桥西区",	 NULL,0,
    (U8 *)"130705",(U8 *)"宣化区",	 NULL,0,
    (U8 *)"130706",(U8 *)"下花园区", NULL,0,
    (U8 *)"130721",(U8 *)"宣化县",	 NULL,0,
    (U8 *)"130722",(U8 *)"张北县",	 NULL,0,
    (U8 *)"130723",(U8 *)"康保县",	 NULL,0,
    (U8 *)"130724",(U8 *)"沽源县",	 NULL,0,
    (U8 *)"130725",(U8 *)"尚义县",	 NULL,0,
    (U8 *)"130726",(U8 *)"蔚　县",	 NULL,0,
    (U8 *)"130727",(U8 *)"阳原县",	 NULL,0,
    (U8 *)"130728",(U8 *)"怀安县",	 NULL,0,
    (U8 *)"130729",(U8 *)"万全县",	 NULL,0,
    (U8 *)"130730",(U8 *)"怀来县",	 NULL,0,
    (U8 *)"130731",(U8 *)"涿鹿县",	 NULL,0,
    (U8 *)"130732",(U8 *)"赤城县",	 NULL,0,
    (U8 *)"130733",(U8 *)"崇礼县",	 NULL,0,
  };								 
 //130800",(U8 *)"承德市",			 
 const AREAnode HB_chengd[11] = 
{									 
    (U8 *)"130802",(U8 *)"双桥区",                 NULL,0,
    (U8 *)"130803",(U8 *)"双滦区",				   NULL,0,
    (U8 *)"130804",(U8 *)"鹰手营子矿区",		   NULL,0,
    (U8 *)"130821",(U8 *)"承德县",				   NULL,0,
    (U8 *)"130822",(U8 *)"兴隆县",				   NULL,0,
    (U8 *)"130823",(U8 *)"平泉县",				   NULL,0,
    (U8 *)"130824",(U8 *)"滦平县",				   NULL,0,
    (U8 *)"130825",(U8 *)"隆化县",				   NULL,0,
    (U8 *)"130826",(U8 *)"丰宁满族自治县",		   NULL,0,
    (U8 *)"130827",(U8 *)"宽城满族自治县",		   NULL,0,
    (U8 *)"130828",(U8 *)"围场满族蒙古族自治县",   NULL,0,
  };
 //130900",(U8 *)"沧州市",
 const AREAnode HB_cangzh[16] = 
{
    (U8 *)"130902",(U8 *)"新华区",         NULL,0,
    (U8 *)"130903",(U8 *)"运河区",		   NULL,0,
    (U8 *)"130921",(U8 *)"沧　县",		   NULL,0,
    (U8 *)"130922",(U8 *)"青　县",		   NULL,0,
    (U8 *)"130923",(U8 *)"东光县",		   NULL,0,
    (U8 *)"130924",(U8 *)"海兴县",		   NULL,0,
    (U8 *)"130925",(U8 *)"盐山县",		   NULL,0,
    (U8 *)"130926",(U8 *)"肃宁县",		   NULL,0,
    (U8 *)"130927",(U8 *)"南皮县",		   NULL,0,
    (U8 *)"130928",(U8 *)"吴桥县",		   NULL,0,
    (U8 *)"130929",(U8 *)"献　县",		   NULL,0,
    (U8 *)"130930",(U8 *)"孟村回族自治县", NULL,0,
    (U8 *)"130981",(U8 *)"泊头市",		   NULL,0,
    (U8 *)"130982",(U8 *)"任丘市",		   NULL,0,
    (U8 *)"130983",(U8 *)"黄骅市",		   NULL,0,
    (U8 *)"130984",(U8 *)"河间市",		   NULL,0,
  };									  
 //131000",(U8 *)"廊坊市",				  
 const AREAnode HB_langf[10] =   
{										  
    (U8 *)"131002",(U8 *)"安次区",		   NULL,0,
    (U8 *)"131003",(U8 *)"广阳区",		   NULL,0,
    (U8 *)"131022",(U8 *)"固安县",		   NULL,0,
    (U8 *)"131023",(U8 *)"永清县",		   NULL,0,
    (U8 *)"131024",(U8 *)"香河县",		   NULL,0,
    (U8 *)"131025",(U8 *)"大城县",		   NULL,0,
    (U8 *)"131026",(U8 *)"文安县",		   NULL,0,
    (U8 *)"131028",(U8 *)"大厂回族自治县", NULL,0,
    (U8 *)"131081",(U8 *)"霸州市",		   NULL,0,
    (U8 *)"131082",(U8 *)"三河市",		   NULL,0,
  };									   
 //131100",(U8 *)"衡水市",
 const AREAnode HB_hengsh[11] = 
{
    (U8 *)"131102",(U8 *)"桃城区", NULL,0,
    (U8 *)"131121",(U8 *)"枣强县", NULL,0,
    (U8 *)"131122",(U8 *)"武邑县", NULL,0,
    (U8 *)"131123",(U8 *)"武强县", NULL,0,
    (U8 *)"131124",(U8 *)"饶阳县", NULL,0,
    (U8 *)"131125",(U8 *)"安平县", NULL,0,
    (U8 *)"131126",(U8 *)"故城县", NULL,0,
    (U8 *)"131127",(U8 *)"景　县", NULL,0,
    (U8 *)"131128",(U8 *)"阜城县", NULL,0,
    (U8 *)"131181",(U8 *)"冀州市", NULL,0,
    (U8 *)"131182",(U8 *)"深州市", NULL,0,
  };//140000",(U8 *)"山西省",
 //140100",(U8 *)"太原市",
 const AREAnode SX_taiy[10] = 
{
    (U8 *)"140105",(U8 *)"小店区",   NULL,0,
    (U8 *)"140106",(U8 *)"迎泽区",	 NULL,0,
    (U8 *)"140107",(U8 *)"杏花岭区", NULL,0,
    (U8 *)"140108",(U8 *)"尖草坪区", NULL,0,
    (U8 *)"140109",(U8 *)"万柏林区", NULL,0,
    (U8 *)"140110",(U8 *)"晋源区",	 NULL,0,
    (U8 *)"140121",(U8 *)"清徐县",	 NULL,0,
    (U8 *)"140122",(U8 *)"阳曲县",	 NULL,0,
    (U8 *)"140123",(U8 *)"娄烦县",	 NULL,0,
    (U8 *)"140181",(U8 *)"古交市",	 NULL,0,
  };								 
 //140200",(U8 *)"大同市",
 const AREAnode SX_dat[11] = 
{
    (U8 *)"140202",(U8 *)"城　区", NULL,0,
    (U8 *)"140203",(U8 *)"矿　区", NULL,0,
    (U8 *)"140211",(U8 *)"南郊区", NULL,0,
    (U8 *)"140212",(U8 *)"新荣区", NULL,0,
    (U8 *)"140221",(U8 *)"阳高县", NULL,0,
    (U8 *)"140222",(U8 *)"天镇县", NULL,0,
    (U8 *)"140223",(U8 *)"广灵县", NULL,0,
    (U8 *)"140224",(U8 *)"灵丘县", NULL,0,
    (U8 *)"140225",(U8 *)"浑源县", NULL,0,
    (U8 *)"140226",(U8 *)"左云县", NULL,0,
    (U8 *)"140227",(U8 *)"大同县", NULL,0,
  };
 //140300",(U8 *)"阳泉市",
 const AREAnode SX_yangq[5] = 
{
    (U8 *)"140302",(U8 *)"城　区",NULL,0,
    (U8 *)"140303",(U8 *)"矿　区",NULL,0,
    (U8 *)"140311",(U8 *)"郊　区",NULL,0,
    (U8 *)"140321",(U8 *)"平定县",NULL,0,
    (U8 *)"140322",(U8 *)"盂　县",NULL,0,
  };							 
 //140400",(U8 *)"长治市",
 const AREAnode SX_changzh[13] = 
{
    (U8 *)"140402",(U8 *)"城　区",NULL,0,
    (U8 *)"140411",(U8 *)"郊　区",NULL,0,
    (U8 *)"140421",(U8 *)"长治县",NULL,0,
    (U8 *)"140423",(U8 *)"襄垣县",NULL,0,
    (U8 *)"140424",(U8 *)"屯留县",NULL,0,
    (U8 *)"140425",(U8 *)"平顺县",NULL,0,
    (U8 *)"140426",(U8 *)"黎城县",NULL,0,
    (U8 *)"140427",(U8 *)"壶关县",NULL,0,
    (U8 *)"140428",(U8 *)"长子县",NULL,0,
    (U8 *)"140429",(U8 *)"武乡县",NULL,0,
    (U8 *)"140430",(U8 *)"沁　县",NULL,0,
    (U8 *)"140431",(U8 *)"沁源县",NULL,0,
    (U8 *)"140481",(U8 *)"潞城市",NULL,0,
  };
 //140500",(U8 *)"晋城市",
 const AREAnode SX_jich[6] = 
{
    (U8 *)"140502",(U8 *)"城　区",NULL,0,
    (U8 *)"140521",(U8 *)"沁水县",NULL,0,
    (U8 *)"140522",(U8 *)"阳城县",NULL,0,
    (U8 *)"140524",(U8 *)"陵川县",NULL,0,
    (U8 *)"140525",(U8 *)"泽州县",NULL,0,
    (U8 *)"140581",(U8 *)"高平市",NULL,0,
  };
 //140600",(U8 *)"朔州市",
 const AREAnode SX_shuozh[6] = 
{
    (U8 *)"140602",(U8 *)"朔城区",NULL,0,
    (U8 *)"140603",(U8 *)"平鲁区",NULL,0,
    (U8 *)"140621",(U8 *)"山阴县",NULL,0,
    (U8 *)"140622",(U8 *)"应　县",NULL,0,
    (U8 *)"140623",(U8 *)"右玉县",NULL,0,
    (U8 *)"140624",(U8 *)"怀仁县",NULL,0,
  };
 //140700",(U8 *)"晋中市",
 const AREAnode SX_jizh[11] = 
{
    (U8 *)"140702",(U8 *)"榆次区",NULL,0,
    (U8 *)"140721",(U8 *)"榆社县",NULL,0,
    (U8 *)"140722",(U8 *)"左权县",NULL,0,
    (U8 *)"140723",(U8 *)"和顺县",NULL,0,
    (U8 *)"140724",(U8 *)"昔阳县",NULL,0,
    (U8 *)"140725",(U8 *)"寿阳县",NULL,0,
    (U8 *)"140726",(U8 *)"太谷县",NULL,0,
    (U8 *)"140727",(U8 *)"祁　县",NULL,0,
    (U8 *)"140728",(U8 *)"平遥县",NULL,0,
    (U8 *)"140729",(U8 *)"灵石县",NULL,0,
    (U8 *)"140781",(U8 *)"介休市",NULL,0,
  };							  
 //140800",(U8 *)"运城市",
 const AREAnode SX_yunch[13] = 
{
    (U8 *)"140802",(U8 *)"盐湖区",NULL,0,
    (U8 *)"140821",(U8 *)"临猗县",NULL,0,
    (U8 *)"140822",(U8 *)"万荣县",NULL,0,
    (U8 *)"140823",(U8 *)"闻喜县",NULL,0,
    (U8 *)"140824",(U8 *)"稷山县",NULL,0,
    (U8 *)"140825",(U8 *)"新绛县",NULL,0,
    (U8 *)"140826",(U8 *)"绛　县",NULL,0,
    (U8 *)"140827",(U8 *)"垣曲县",NULL,0,
    (U8 *)"140828",(U8 *)"夏　县",NULL,0,
    (U8 *)"140829",(U8 *)"平陆县",NULL,0,
    (U8 *)"140830",(U8 *)"芮城县",NULL,0,
    (U8 *)"140881",(U8 *)"永济市",NULL,0,
    (U8 *)"140882",(U8 *)"河津市",NULL,0,
  };
 //140900",(U8 *)"忻州市",
 const AREAnode SX_qinzh[14] = 
{
    (U8 *)"140902",(U8 *)"忻府区",NULL,0,
    (U8 *)"140921",(U8 *)"定襄县",NULL,0,
    (U8 *)"140922",(U8 *)"五台县",NULL,0,
    (U8 *)"140923",(U8 *)"代　县",NULL,0,
    (U8 *)"140924",(U8 *)"繁峙县",NULL,0,
    (U8 *)"140925",(U8 *)"宁武县",NULL,0,
    (U8 *)"140926",(U8 *)"静乐县",NULL,0,
    (U8 *)"140927",(U8 *)"神池县",NULL,0,
    (U8 *)"140928",(U8 *)"五寨县",NULL,0,
    (U8 *)"140929",(U8 *)"岢岚县",NULL,0,
    (U8 *)"140930",(U8 *)"河曲县",NULL,0,
    (U8 *)"140931",(U8 *)"保德县",NULL,0,
    (U8 *)"140932",(U8 *)"偏关县",NULL,0,
    (U8 *)"140981",(U8 *)"原平市",NULL,0,
  };
 //141000",(U8 *)"临汾市",
 const AREAnode SX_linf[17] = 
{
    (U8 *)"141002",(U8 *)"尧都区",NULL,0,
    (U8 *)"141021",(U8 *)"曲沃县",NULL,0,
    (U8 *)"141022",(U8 *)"翼城县",NULL,0,
    (U8 *)"141023",(U8 *)"襄汾县",NULL,0,
    (U8 *)"141024",(U8 *)"洪洞县",NULL,0,
    (U8 *)"141025",(U8 *)"古　县",NULL,0,
    (U8 *)"141026",(U8 *)"安泽县",NULL,0,
    (U8 *)"141027",(U8 *)"浮山县",NULL,0,
    (U8 *)"141028",(U8 *)"吉　县",NULL,0,
    (U8 *)"141029",(U8 *)"乡宁县",NULL,0,
    (U8 *)"141030",(U8 *)"大宁县",NULL,0,
    (U8 *)"141031",(U8 *)"隰　县",NULL,0,
    (U8 *)"141032",(U8 *)"永和县",NULL,0,
    (U8 *)"141033",(U8 *)"蒲　县",NULL,0,
    (U8 *)"141034",(U8 *)"汾西县",NULL,0,
    (U8 *)"141081",(U8 *)"侯马市",NULL,0,
    (U8 *)"141082",(U8 *)"霍州市",NULL,0,
  };
 //141100",(U8 *)"吕梁市",
 const AREAnode SX_lvl[13] = 
{
    (U8 *)"141102",(U8 *)"离石区",NULL,0,
    (U8 *)"141121",(U8 *)"文水县",NULL,0,
    (U8 *)"141122",(U8 *)"交城县",NULL,0,
    (U8 *)"141123",(U8 *)"兴　县",NULL,0,
    (U8 *)"141124",(U8 *)"临　县",NULL,0,
    (U8 *)"141125",(U8 *)"柳林县",NULL,0,
    (U8 *)"141126",(U8 *)"石楼县",NULL,0,
    (U8 *)"141127",(U8 *)"岚　县",NULL,0,
    (U8 *)"141128",(U8 *)"方山县",NULL,0,
    (U8 *)"141129",(U8 *)"中阳县",NULL,0,
    (U8 *)"141130",(U8 *)"交口县",NULL,0,
    (U8 *)"141181",(U8 *)"孝义市",NULL,0,
    (U8 *)"141182",(U8 *)"汾阳市",NULL,0,
//150000",(U8 *)"内蒙古自治区",	  
  };							  
 //150100",(U8 *)"呼和浩特市",	  
 const AREAnode NM_huheh[9] = 
{
    (U8 *)"150102",(U8 *)"新城区",      NULL,0,
    (U8 *)"150103",(U8 *)"回民区",		NULL,0,
    (U8 *)"150104",(U8 *)"玉泉区",		NULL,0,
    (U8 *)"150105",(U8 *)"赛罕区",		NULL,0,
    (U8 *)"150121",(U8 *)"土默特左旗",  NULL,0,
    (U8 *)"150122",(U8 *)"托克托县",    NULL,0,
    (U8 *)"150123",(U8 *)"和林格尔县",  NULL,0,
    (U8 *)"150124",(U8 *)"清水河县",    NULL,0,
    (U8 *)"150125",(U8 *)"武川县",		NULL,0,
  };									
 //150200",(U8 *)"包头市",				
 const AREAnode NM_baot[9] =   
{										
    (U8 *)"150202",(U8 *)"东河区",		       NULL,0,
    (U8 *)"150203",(U8 *)"昆都仑区",    	   NULL,0,
    (U8 *)"150204",(U8 *)"青山区",			   NULL,0,
    (U8 *)"150205",(U8 *)"石拐区",			   NULL,0,
    (U8 *)"150206",(U8 *)"白云鄂博矿区",	   NULL,0,
    (U8 *)"150207",(U8 *)"九原区",			   NULL,0,
    (U8 *)"150221",(U8 *)"土默特右旗",		   NULL,0,
    (U8 *)"150222",(U8 *)"固阳县",			   NULL,0,
    (U8 *)"150223",(U8 *)"达尔罕茂明安联合旗", NULL,0,
  };										   
 //150300",(U8 *)"乌海市",					   
 const AREAnode NM_wuhai[3] = 		   
{											   
    (U8 *)"150302",(U8 *)"海勃湾区",	NULL,0,	   
    (U8 *)"150303",(U8 *)"海南区",		NULL,0,	   
    (U8 *)"150304",(U8 *)"乌达区",		NULL,0,	   
  };									   
 //150400",(U8 *)"赤峰市",				
 const AREAnode NM_chif[12] =   
{										
    (U8 *)"150402",(U8 *)"红山区",		NULL,0,
    (U8 *)"150403",(U8 *)"元宝山区",    NULL,0,
    (U8 *)"150404",(U8 *)"松山区",		NULL,0,
    (U8 *)"150421",(U8 *)"阿鲁科尔沁旗",NULL,0,
    (U8 *)"150422",(U8 *)"巴林左旗",    NULL,0,
    (U8 *)"150423",(U8 *)"巴林右旗",    NULL,0,
    (U8 *)"150424",(U8 *)"林西县",		NULL,0,
    (U8 *)"150425",(U8 *)"克什克腾旗",  NULL,0,
    (U8 *)"150426",(U8 *)"翁牛特旗",    NULL,0,
    (U8 *)"150428",(U8 *)"喀喇沁旗",    NULL,0,
    (U8 *)"150429",(U8 *)"宁城县",      NULL,0,
    (U8 *)"150430",(U8 *)"敖汉旗",		NULL,0,
  };
 //150500",(U8 *)"通辽市",
 const AREAnode NM_tongl[8] = 
{
    (U8 *)"150502",(U8 *)"科尔沁区",      NULL,0,
    (U8 *)"150521",(U8 *)"科尔沁左翼中旗",NULL,0,
    (U8 *)"150522",(U8 *)"科尔沁左翼后旗",NULL,0,
    (U8 *)"150523",(U8 *)"开鲁县",		  NULL,0,
    (U8 *)"150524",(U8 *)"库伦旗",		  NULL,0,
    (U8 *)"150525",(U8 *)"奈曼旗",		  NULL,0,
    (U8 *)"150526",(U8 *)"扎鲁特旗",	  NULL,0,
    (U8 *)"150581",(U8 *)"霍林郭勒市",	  NULL,0,
  };									  
 //150600",(U8 *)"鄂尔多斯市",			  
 const AREAnode NM_eerds[8] = 	  
{										  
    (U8 *)"150602",(U8 *)"东胜区",     NULL,0,
    (U8 *)"150621",(U8 *)"达拉特旗",   NULL,0,
    (U8 *)"150622",(U8 *)"准格尔旗",   NULL,0,
    (U8 *)"150623",(U8 *)"鄂托克前旗", NULL,0,
    (U8 *)"150624",(U8 *)"鄂托克旗",   NULL,0,
    (U8 *)"150625",(U8 *)"杭锦旗",	   NULL,0,
    (U8 *)"150626",(U8 *)"乌审旗",	   NULL,0,
    (U8 *)"150627",(U8 *)"伊金霍洛旗", NULL,0,
  };								   
 //150700",(U8 *)"呼伦贝尔市",		   
 const AREAnode NM_hulber[13] =
{									   
    (U8 *)"150702",(U8 *)"海拉尔区",              NULL,0,
    (U8 *)"150721",(U8 *)"阿荣旗",				  NULL,0,
    (U8 *)"150722",(U8 *)"莫力达瓦达斡尔族自治旗",NULL,0,
    (U8 *)"150723",(U8 *)"鄂伦春自治旗",		  NULL,0,
    (U8 *)"150724",(U8 *)"鄂温克族自治旗",		  NULL,0,
    (U8 *)"150725",(U8 *)"陈巴尔虎旗",			  NULL,0,
    (U8 *)"150726",(U8 *)"新巴尔虎左旗",		  NULL,0,
    (U8 *)"150727",(U8 *)"新巴尔虎右旗",		  NULL,0,
    (U8 *)"150781",(U8 *)"满洲里市",			  NULL,0,
    (U8 *)"150782",(U8 *)"牙克石市",			  NULL,0,
    (U8 *)"150783",(U8 *)"扎兰屯市",			  NULL,0,
    (U8 *)"150784",(U8 *)"额尔古纳市",			  NULL,0,
    (U8 *)"150785",(U8 *)"根河市",                NULL,0,
  };
 //150800",(U8 *)"巴彦淖尔市",
 const AREAnode NM_bayzer[7] = 
{
    (U8 *)"150802",(U8 *)"临河区",       NULL,0,
    (U8 *)"150821",(U8 *)"五原县",		 NULL,0,
    (U8 *)"150822",(U8 *)"磴口县",		 NULL,0,
    (U8 *)"150823",(U8 *)"乌拉特前旗",	 NULL,0,
    (U8 *)"150824",(U8 *)"乌拉特中旗",	 NULL,0,
    (U8 *)"150825",(U8 *)"乌拉特后旗",	 NULL,0,
    (U8 *)"150826",(U8 *)"杭锦后旗",	 NULL,0,
  };									 
 //150900",(U8 *)"乌兰察布市",			 
 const AREAnode NM_wulchb[11] = 
{
    (U8 *)"150902",(U8 *)"集宁区",         NULL,0,
    (U8 *)"150921",(U8 *)"卓资县",		   NULL,0,
    (U8 *)"150922",(U8 *)"化德县",		   NULL,0,
    (U8 *)"150923",(U8 *)"商都县",		   NULL,0,
    (U8 *)"150924",(U8 *)"兴和县",		   NULL,0,
    (U8 *)"150925",(U8 *)"凉城县",		   NULL,0,
    (U8 *)"150926",(U8 *)"察哈尔右翼前旗", NULL,0,
    (U8 *)"150927",(U8 *)"察哈尔右翼中旗", NULL,0,
    (U8 *)"150928",(U8 *)"察哈尔右翼后旗", NULL,0,
    (U8 *)"150929",(U8 *)"四子王旗",       NULL,0,
    (U8 *)"150981",(U8 *)"丰镇市",		   NULL,0,
  };
 //152200",(U8 *)"兴安盟",
 const AREAnode NM_xinga[6] = 
{
    (U8 *)"152201",(U8 *)"乌兰浩特市",NULL,0,
    (U8 *)"152202",(U8 *)"阿尔山市",NULL,0,
    (U8 *)"152221",(U8 *)"科尔沁右翼前旗",NULL,0,
    (U8 *)"152222",(U8 *)"科尔沁右翼中旗",NULL,0,
    (U8 *)"152223",(U8 *)"扎赉特旗",NULL,0,
    (U8 *)"152224",(U8 *)"突泉县",NULL,0,
  };
 //152500",(U8 *)"锡林郭勒盟",
 const AREAnode NM_xilgl[12] = 
{
    (U8 *)"152501",(U8 *)"二连浩特市",NULL,0,
    (U8 *)"152502",(U8 *)"锡林浩特市",NULL,0,
    (U8 *)"152522",(U8 *)"阿巴嘎旗",NULL,0,
    (U8 *)"152523",(U8 *)"苏尼特左旗",NULL,0,
    (U8 *)"152524",(U8 *)"苏尼特右旗",NULL,0,
    (U8 *)"152525",(U8 *)"东乌珠穆沁旗",NULL,0,
    (U8 *)"152526",(U8 *)"西乌珠穆沁旗",NULL,0,
    (U8 *)"152527",(U8 *)"太仆寺旗",NULL,0,
    (U8 *)"152528",(U8 *)"镶黄旗",NULL,0,
    (U8 *)"152529",(U8 *)"正镶白旗",NULL,0,
    (U8 *)"152530",(U8 *)"正蓝旗",NULL,0,
    (U8 *)"152531",(U8 *)"多伦县",NULL,0,
  };
 //152900",(U8 *)"阿拉善盟",
 const AREAnode NM_alsh[3] = 
{
    (U8 *)"152921",(U8 *)"阿拉善左旗",NULL,0,
    (U8 *)"152922",(U8 *)"阿拉善右旗",NULL,0,
    (U8 *)"152923",(U8 *)"额济纳旗",NULL,0,
  };//210000",(U8 *)"辽宁省",
 //210100",(U8 *)"沈阳市",
 const AREAnode LN_sheny[13] = 
{
    (U8 *)"210102",(U8 *)"和平区",NULL,0,
    (U8 *)"210103",(U8 *)"沈河区",NULL,0,
    (U8 *)"210104",(U8 *)"大东区",NULL,0,
    (U8 *)"210105",(U8 *)"皇姑区",NULL,0,
    (U8 *)"210106",(U8 *)"铁西区",NULL,0,
    (U8 *)"210111",(U8 *)"苏家屯区",NULL,0,
    (U8 *)"210112",(U8 *)"东陵区",NULL,0,
    (U8 *)"210113",(U8 *)"沈北新区",NULL,0,
    (U8 *)"210114",(U8 *)"于洪区",NULL,0,
    (U8 *)"210122",(U8 *)"辽中县",NULL,0,
    (U8 *)"210123",(U8 *)"康平县",NULL,0,
    (U8 *)"210124",(U8 *)"法库县",NULL,0,
    (U8 *)"210181",(U8 *)"新民市",NULL,0,
  };
 //210200",(U8 *)"大连市",
 const AREAnode LN_dal[10] = 
{
    (U8 *)"210202",(U8 *)"中山区",NULL,0,
    (U8 *)"210203",(U8 *)"西岗区",NULL,0,
    (U8 *)"210204",(U8 *)"沙河口区",NULL,0,
    (U8 *)"210211",(U8 *)"甘井子区",NULL,0,
    (U8 *)"210212",(U8 *)"旅顺口区",NULL,0,
    (U8 *)"210213",(U8 *)"金州区",NULL,0,
    (U8 *)"210224",(U8 *)"长海县",NULL,0,
    (U8 *)"210281",(U8 *)"瓦房店市",NULL,0,
    (U8 *)"210282",(U8 *)"普兰店市",NULL,0,
    (U8 *)"210283",(U8 *)"庄河市",NULL,0,
  };
 //210300",(U8 *)"鞍山市",
 const AREAnode LN_ansh[7] = 
{
    (U8 *)"210302",(U8 *)"铁东区",NULL,0,
    (U8 *)"210303",(U8 *)"铁西区",NULL,0,
    (U8 *)"210304",(U8 *)"立山区",NULL,0,
    (U8 *)"210311",(U8 *)"千山区",NULL,0,
    (U8 *)"210321",(U8 *)"台安县",NULL,0,
    (U8 *)"210323",(U8 *)"岫岩满族自治县",NULL,0,
    (U8 *)"210381",(U8 *)"海城市",NULL,0,
  };
 //210400",(U8 *)"抚顺市",
 const AREAnode LN_fush[7] = 
{
    (U8 *)"210402",(U8 *)"新抚区",NULL,0,
    (U8 *)"210403",(U8 *)"东洲区",NULL,0,
    (U8 *)"210404",(U8 *)"望花区",NULL,0,
    (U8 *)"210411",(U8 *)"顺城区",NULL,0,
    (U8 *)"210421",(U8 *)"抚顺县",NULL,0,
    (U8 *)"210422",(U8 *)"新宾满族自治县",NULL,0,
    (U8 *)"210423",(U8 *)"清原满族自治县",NULL,0,
  };
 //210500",(U8 *)"本溪市",
 const AREAnode LN_benx[6] = 
{
    (U8 *)"210502",(U8 *)"平山区",NULL,0,
    (U8 *)"210503",(U8 *)"溪湖区",NULL,0,
    (U8 *)"210504",(U8 *)"明山区",NULL,0,
    (U8 *)"210505",(U8 *)"南芬区",NULL,0,
    (U8 *)"210521",(U8 *)"本溪满族自治县",NULL,0,
    (U8 *)"210522",(U8 *)"桓仁满族自治县",NULL,0,
  };
 //210600",(U8 *)"丹东市",
 const AREAnode LN_dand[6] = 
{
    (U8 *)"210602",(U8 *)"元宝区",NULL,0,
    (U8 *)"210603",(U8 *)"振兴区",NULL,0,
    (U8 *)"210604",(U8 *)"振安区",NULL,0,
    (U8 *)"210624",(U8 *)"宽甸满族自治县",NULL,0,
    (U8 *)"210681",(U8 *)"东港市",NULL,0,
    (U8 *)"210682",(U8 *)"凤城市",NULL,0,
  };
 //210700",(U8 *)"锦州市",
 const AREAnode LN_jinzh[7] = 
{
    (U8 *)"210702",(U8 *)"古塔区",NULL,0,
    (U8 *)"210703",(U8 *)"凌河区",NULL,0,
    (U8 *)"210711",(U8 *)"太和区",NULL,0,
    (U8 *)"210726",(U8 *)"黑山县",NULL,0,
    (U8 *)"210727",(U8 *)"义　县",NULL,0,
    (U8 *)"210781",(U8 *)"凌海市",NULL,0,
    (U8 *)"210782",(U8 *)"北镇市",NULL,0,
  };
 //210800",(U8 *)"营口市",
 const AREAnode LN_yingk[6] = 
{
    (U8 *)"210802",(U8 *)"站前区",NULL,0,
    (U8 *)"210803",(U8 *)"西市区",NULL,0,
    (U8 *)"210804",(U8 *)"鲅鱼圈区",NULL,0,
    (U8 *)"210811",(U8 *)"老边区",NULL,0,
    (U8 *)"210881",(U8 *)"盖州市",NULL,0,
    (U8 *)"210882",(U8 *)"大石桥市",NULL,0,
  };
 //210900",(U8 *)"阜新市",
 const AREAnode LN_fux[7] = 
{
    (U8 *)"210902",(U8 *)"海州区",NULL,0,
    (U8 *)"210903",(U8 *)"新邱区",NULL,0,
    (U8 *)"210904",(U8 *)"太平区",NULL,0,
    (U8 *)"210905",(U8 *)"清河门区",NULL,0,
    (U8 *)"210911",(U8 *)"细河区",NULL,0,
    (U8 *)"210921",(U8 *)"阜新蒙古族自治县",NULL,0,
    (U8 *)"210922",(U8 *)"彰武县",NULL,0,
  };
 //211000",(U8 *)"辽阳市",
 const AREAnode LN_liaoy[7] = 
{
    (U8 *)"211002",(U8 *)"白塔区",NULL,0,
    (U8 *)"211003",(U8 *)"文圣区",NULL,0,
    (U8 *)"211004",(U8 *)"宏伟区",NULL,0,
    (U8 *)"211005",(U8 *)"弓长岭区",NULL,0,
    (U8 *)"211011",(U8 *)"太子河区",NULL,0,
    (U8 *)"211021",(U8 *)"辽阳县",NULL,0,
    (U8 *)"211081",(U8 *)"灯塔市",NULL,0,
  };
 //211100",(U8 *)"盘锦市",
 const AREAnode LN_panj[4] = 
{
    (U8 *)"211102",(U8 *)"双台子区",NULL,0,
    (U8 *)"211103",(U8 *)"兴隆台区",NULL,0,
    (U8 *)"211121",(U8 *)"大洼县",NULL,0,
    (U8 *)"211122",(U8 *)"盘山县",NULL,0,
  };
 //211200",(U8 *)"铁岭市",
 const AREAnode LN_tiel[7] = 
{
    (U8 *)"211202",(U8 *)"银州区",NULL,0,
    (U8 *)"211204",(U8 *)"清河区",NULL,0,
    (U8 *)"211221",(U8 *)"铁岭县",NULL,0,
    (U8 *)"211223",(U8 *)"西丰县",NULL,0,
    (U8 *)"211224",(U8 *)"昌图县",NULL,0,
    (U8 *)"211281",(U8 *)"调兵山市",NULL,0,
    (U8 *)"211282",(U8 *)"开原市",NULL,0,
  };
 //211300",(U8 *)"朝阳市",
 const AREAnode LN_chaoy[7] = 
{
    (U8 *)"211302",(U8 *)"双塔区",NULL,0,
    (U8 *)"211303",(U8 *)"龙城区",NULL,0,
    (U8 *)"211321",(U8 *)"朝阳县",NULL,0,
    (U8 *)"211322",(U8 *)"建平县",NULL,0,
    (U8 *)"211324",(U8 *)"喀喇沁左翼蒙古族自治县",NULL,0,
    (U8 *)"211381",(U8 *)"北票市",NULL,0,
    (U8 *)"211382",(U8 *)"凌源市",NULL,0,
  };
 //211400",(U8 *)"葫芦岛市",
 const AREAnode LN_huld[6] = 
{
    (U8 *)"211402",(U8 *)"连山区",NULL,0,
    (U8 *)"211403",(U8 *)"龙港区",NULL,0,
    (U8 *)"211404",(U8 *)"南票区",NULL,0,
    (U8 *)"211421",(U8 *)"绥中县",NULL,0,
    (U8 *)"211422",(U8 *)"建昌县",NULL,0,
    (U8 *)"211481",(U8 *)"兴城市",NULL,0,
  };
  //220000",(U8 *)"吉林省",
 //220100",(U8 *)"长春市",
 const AREAnode JL_changch[10] = 
{
    (U8 *)"220102",(U8 *)"南关区",NULL,0,
    (U8 *)"220103",(U8 *)"宽城区",NULL,0,
    (U8 *)"220104",(U8 *)"朝阳区",NULL,0,
    (U8 *)"220105",(U8 *)"二道区",NULL,0,
    (U8 *)"220106",(U8 *)"绿园区",NULL,0,
    (U8 *)"220112",(U8 *)"双阳区",NULL,0,
    (U8 *)"220122",(U8 *)"农安县",NULL,0,
    (U8 *)"220181",(U8 *)"九台市",NULL,0,
    (U8 *)"220182",(U8 *)"榆树市",NULL,0,
    (U8 *)"220183",(U8 *)"德惠市",NULL,0,
  };
 //220200",(U8 *)"吉林市",
 const AREAnode JL_jil[9] = 
{
    (U8 *)"220202",(U8 *)"昌邑区",NULL,0,
    (U8 *)"220203",(U8 *)"龙潭区",NULL,0,
    (U8 *)"220204",(U8 *)"船营区",NULL,0,
    (U8 *)"220211",(U8 *)"丰满区",NULL,0,
    (U8 *)"220221",(U8 *)"永吉县",NULL,0,
    (U8 *)"220281",(U8 *)"蛟河市",NULL,0,
    (U8 *)"220282",(U8 *)"桦甸市",NULL,0,
    (U8 *)"220283",(U8 *)"舒兰市",NULL,0,
    (U8 *)"220284",(U8 *)"磐石市",NULL,0,
  };
 //220300",(U8 *)"四平市",
 const AREAnode JL_sip[6] = 
{
    (U8 *)"220302",(U8 *)"铁西区",NULL,0,
    (U8 *)"220303",(U8 *)"铁东区",NULL,0,
    (U8 *)"220322",(U8 *)"梨树县",NULL,0,
    (U8 *)"220323",(U8 *)"伊通满族自治县",NULL,0,
    (U8 *)"220381",(U8 *)"公主岭市",NULL,0,
    (U8 *)"220382",(U8 *)"双辽市",NULL,0,
  };
 //220400",(U8 *)"辽源市",
 const AREAnode JL_liaoy[4] = 
{
    (U8 *)"220402",(U8 *)"龙山区",NULL,0,
    (U8 *)"220403",(U8 *)"西安区",NULL,0,
    (U8 *)"220421",(U8 *)"东丰县",NULL,0,
    (U8 *)"220422",(U8 *)"东辽县",NULL,0,
  };
 //220500",(U8 *)"通化市",
 const AREAnode JL_tongh[7] = 
{
    (U8 *)"220502",(U8 *)"东昌区",NULL,0,
    (U8 *)"220503",(U8 *)"二道江区",NULL,0,
    (U8 *)"220521",(U8 *)"通化县",NULL,0,
    (U8 *)"220523",(U8 *)"辉南县",NULL,0,
    (U8 *)"220524",(U8 *)"柳河县",NULL,0,
    (U8 *)"220581",(U8 *)"梅河口市",NULL,0,
    (U8 *)"220582",(U8 *)"集安市",NULL,0,
  };
 //220600",(U8 *)"白山市",
 const AREAnode JL_changbsh[6] = 
{
    (U8 *)"220602",(U8 *)"八道江区",NULL,0,
    (U8 *)"220605",(U8 *)"江源区",NULL,0,
    (U8 *)"220621",(U8 *)"抚松县",NULL,0,
    (U8 *)"220622",(U8 *)"靖宇县",NULL,0,
    (U8 *)"220623",(U8 *)"长白朝鲜族自治县",NULL,0,
    (U8 *)"220681",(U8 *)"临江市",NULL,0,
  };
 //220700",(U8 *)"松原市",
 const AREAnode JL_songy[5] = 
{
    (U8 *)"220702",(U8 *)"宁江区",NULL,0,
    (U8 *)"220721",(U8 *)"前郭尔罗斯蒙古族自治县",NULL,0,
    (U8 *)"220722",(U8 *)"长岭县",NULL,0,
    (U8 *)"220723",(U8 *)"乾安县",NULL,0,
    (U8 *)"220724",(U8 *)"扶余县",NULL,0,
  };
 //220800",(U8 *)"白城市",
 const AREAnode JL_baich[5] = 
{
    (U8 *)"220802",(U8 *)"洮北区",NULL,0,
    (U8 *)"220821",(U8 *)"镇赉县",NULL,0,
    (U8 *)"220822",(U8 *)"通榆县",NULL,0,
    (U8 *)"220881",(U8 *)"洮南市",NULL,0,
    (U8 *)"220882",(U8 *)"大安市",NULL,0,
  };
 //222400",(U8 *)"延边朝鲜族自治州",
 const AREAnode JL_yanb[8] = 
{
    (U8 *)"222401",(U8 *)"延吉市",NULL,0,
    (U8 *)"222402",(U8 *)"图们市",NULL,0,
    (U8 *)"222403",(U8 *)"敦化市",NULL,0,
    (U8 *)"222404",(U8 *)"珲春市",NULL,0,
    (U8 *)"222405",(U8 *)"龙井市",NULL,0,
    (U8 *)"222406",(U8 *)"和龙市",NULL,0,
    (U8 *)"222424",(U8 *)"汪清县",NULL,0,
    (U8 *)"222426",(U8 *)"安图县",NULL,0,
  };//230000",(U8 *)"黑龙江省",
 //230100",(U8 *)"哈尔滨市",
 const AREAnode HLJ_haerb[17] = 
{
    (U8 *)"230102",(U8 *)"道里区",NULL,0,
    (U8 *)"230103",(U8 *)"南岗区",NULL,0,
    (U8 *)"230104",(U8 *)"道外区",NULL,0,
    (U8 *)"230108",(U8 *)"平房区",NULL,0,
    (U8 *)"230109",(U8 *)"松北区",NULL,0,
    (U8 *)"230110",(U8 *)"香坊区",NULL,0,
    (U8 *)"230111",(U8 *)"呼兰区",NULL,0,
    (U8 *)"230123",(U8 *)"依兰县",NULL,0,
    (U8 *)"230124",(U8 *)"方正县",NULL,0,
    (U8 *)"230125",(U8 *)"宾　县",NULL,0,
    (U8 *)"230126",(U8 *)"巴彦县",NULL,0,
    (U8 *)"230127",(U8 *)"木兰县",NULL,0,
    (U8 *)"230128",(U8 *)"通河县",NULL,0,
    (U8 *)"230129",(U8 *)"延寿县",NULL,0,
    (U8 *)"230182",(U8 *)"双城市",NULL,0,
    (U8 *)"230183",(U8 *)"尚志市",NULL,0,
    (U8 *)"230184",(U8 *)"五常市",NULL,0,
  };
 //230200",(U8 *)"齐齐哈尔市",
 const AREAnode HLJ_qiqher[16] = 
{
    (U8 *)"230202",(U8 *)"龙沙区",NULL,0,
    (U8 *)"230203",(U8 *)"建华区",NULL,0,
    (U8 *)"230204",(U8 *)"铁锋区",NULL,0,
    (U8 *)"230205",(U8 *)"昂昂溪区",NULL,0,
    (U8 *)"230206",(U8 *)"富拉尔基区",NULL,0,
    (U8 *)"230207",(U8 *)"碾子山区",NULL,0,
    (U8 *)"230208",(U8 *)"梅里斯达斡尔族区",NULL,0,
    (U8 *)"230221",(U8 *)"龙江县",NULL,0,
    (U8 *)"230223",(U8 *)"依安县",NULL,0,
    (U8 *)"230224",(U8 *)"泰来县",NULL,0,
    (U8 *)"230225",(U8 *)"甘南县",NULL,0,
    (U8 *)"230227",(U8 *)"富裕县",NULL,0,
    (U8 *)"230229",(U8 *)"克山县",NULL,0,
    (U8 *)"230230",(U8 *)"克东县",NULL,0,
    (U8 *)"230231",(U8 *)"拜泉县",NULL,0,
    (U8 *)"230281",(U8 *)"讷河市",NULL,0,
  };
 //230300",(U8 *)"鸡西市",
 const AREAnode HLJ_jix[9] = 
{
    (U8 *)"230302",(U8 *)"鸡冠区",NULL,0,
    (U8 *)"230303",(U8 *)"恒山区",NULL,0,
    (U8 *)"230304",(U8 *)"滴道区",NULL,0,
    (U8 *)"230305",(U8 *)"梨树区",NULL,0,
    (U8 *)"230306",(U8 *)"城子河区",NULL,0,
    (U8 *)"230307",(U8 *)"麻山区",NULL,0,
    (U8 *)"230321",(U8 *)"鸡东县",NULL,0,
    (U8 *)"230381",(U8 *)"虎林市",NULL,0,
    (U8 *)"230382",(U8 *)"密山市",NULL,0,
  };
 //230400",(U8 *)"鹤岗市",
 const AREAnode HLJ_heg[8] = 
{
    (U8 *)"230402",(U8 *)"向阳区",NULL,0,
    (U8 *)"230403",(U8 *)"工农区",NULL,0,
    (U8 *)"230404",(U8 *)"南山区",NULL,0,
    (U8 *)"230405",(U8 *)"兴安区",NULL,0,
    (U8 *)"230406",(U8 *)"东山区",NULL,0,
    (U8 *)"230407",(U8 *)"兴山区",NULL,0,
    (U8 *)"230421",(U8 *)"萝北县",NULL,0,
    (U8 *)"230422",(U8 *)"绥滨县",NULL,0,
  };
 //230500",(U8 *)"双鸭山市",
 const AREAnode HLJ_shuangysh[8] = 
{
    (U8 *)"230502",(U8 *)"尖山区",NULL,0,
    (U8 *)"230503",(U8 *)"岭东区",NULL,0,
    (U8 *)"230505",(U8 *)"四方台区",NULL,0,
    (U8 *)"230506",(U8 *)"宝山区",NULL,0,
    (U8 *)"230521",(U8 *)"集贤县",NULL,0,
    (U8 *)"230522",(U8 *)"友谊县",NULL,0,
    (U8 *)"230523",(U8 *)"宝清县",NULL,0,
    (U8 *)"230524",(U8 *)"饶河县",NULL,0,
  };
 //230600",(U8 *)"大庆市",
 const AREAnode HLJ_daq[9] = 
{
    (U8 *)"230602",(U8 *)"萨尔图区",NULL,0,
    (U8 *)"230603",(U8 *)"龙凤区",NULL,0,
    (U8 *)"230604",(U8 *)"让胡路区",NULL,0,
    (U8 *)"230605",(U8 *)"红岗区",NULL,0,
    (U8 *)"230606",(U8 *)"大同区",NULL,0,
    (U8 *)"230621",(U8 *)"肇州县",NULL,0,
    (U8 *)"230622",(U8 *)"肇源县",NULL,0,
    (U8 *)"230623",(U8 *)"林甸县",NULL,0,
    (U8 *)"230624",(U8 *)"杜尔伯特蒙古族自治县",NULL,0,
  };
 //230700",(U8 *)"伊春市",
 const AREAnode HLJ_yich[17] = 
{
    (U8 *)"230702",(U8 *)"伊春区",NULL,0,
    (U8 *)"230703",(U8 *)"南岔区",NULL,0,
    (U8 *)"230704",(U8 *)"友好区",NULL,0,
    (U8 *)"230705",(U8 *)"西林区",NULL,0,
    (U8 *)"230706",(U8 *)"翠峦区",NULL,0,
    (U8 *)"230707",(U8 *)"新青区",NULL,0,
    (U8 *)"230708",(U8 *)"美溪区",NULL,0,
    (U8 *)"230709",(U8 *)"金山屯区",NULL,0,
    (U8 *)"230710",(U8 *)"五营区",NULL,0,
    (U8 *)"230711",(U8 *)"乌马河区",NULL,0,
    (U8 *)"230712",(U8 *)"汤旺河区",NULL,0,
    (U8 *)"230713",(U8 *)"带岭区",NULL,0,
    (U8 *)"230714",(U8 *)"乌伊岭区",NULL,0,
    (U8 *)"230715",(U8 *)"红星区",NULL,0,
    (U8 *)"230716",(U8 *)"上甘岭区",NULL,0,
    (U8 *)"230722",(U8 *)"嘉荫县",NULL,0,
    (U8 *)"230781",(U8 *)"铁力市",NULL,0,
  };
 //230800",(U8 *)"佳木斯市",
 const AREAnode HLJ_jiams[10] = 
{
    (U8 *)"230803",(U8 *)"向阳区",NULL,0,
    (U8 *)"230804",(U8 *)"前进区",NULL,0,
    (U8 *)"230805",(U8 *)"东风区",NULL,0,
    (U8 *)"230811",(U8 *)"郊　区",NULL,0,
    (U8 *)"230822",(U8 *)"桦南县",NULL,0,
    (U8 *)"230826",(U8 *)"桦川县",NULL,0,
    (U8 *)"230828",(U8 *)"汤原县",NULL,0,
    (U8 *)"230833",(U8 *)"抚远县",NULL,0,
    (U8 *)"230881",(U8 *)"同江市",NULL,0,
    (U8 *)"230882",(U8 *)"富锦市",NULL,0,
  };
 //230900",(U8 *)"七台河市",
 const AREAnode HLJ_qith[4] = 
{
    (U8 *)"230902",(U8 *)"新兴区",NULL,0,
    (U8 *)"230903",(U8 *)"桃山区",NULL,0,
    (U8 *)"230904",(U8 *)"茄子河区",NULL,0,
    (U8 *)"230921",(U8 *)"勃利县",NULL,0,
  };
 //231000",(U8 *)"牡丹江市",
 const AREAnode HLJ_mudj[10] = 
{
    (U8 *)"231002",(U8 *)"东安区",NULL,0,
    (U8 *)"231003",(U8 *)"阳明区",NULL,0,
    (U8 *)"231004",(U8 *)"爱民区",NULL,0,
    (U8 *)"231005",(U8 *)"西安区",NULL,0,
    (U8 *)"231024",(U8 *)"东宁县",NULL,0,
    (U8 *)"231025",(U8 *)"林口县",NULL,0,
    (U8 *)"231081",(U8 *)"绥芬河市",NULL,0,
    (U8 *)"231083",(U8 *)"海林市",NULL,0,
    (U8 *)"231084",(U8 *)"宁安市",NULL,0,
    (U8 *)"231085",(U8 *)"穆棱市",NULL,0,
  };
 //231100",(U8 *)"黑河市",
 const AREAnode HLJ_heih[6] = 
{
    (U8 *)"231102",(U8 *)"爱辉区",NULL,0,
    (U8 *)"231121",(U8 *)"嫩江县",NULL,0,
    (U8 *)"231123",(U8 *)"逊克县",NULL,0,
    (U8 *)"231124",(U8 *)"孙吴县",NULL,0,
    (U8 *)"231181",(U8 *)"北安市",NULL,0,
    (U8 *)"231182",(U8 *)"五大连池市",NULL,0,
  };
 //231200",(U8 *)"绥化市",
 const AREAnode HLJ_suih[10] = 
{
    (U8 *)"231202",(U8 *)"北林区",NULL,0,
    (U8 *)"231221",(U8 *)"望奎县",NULL,0,
    (U8 *)"231222",(U8 *)"兰西县",NULL,0,
    (U8 *)"231223",(U8 *)"青冈县",NULL,0,
    (U8 *)"231224",(U8 *)"庆安县",NULL,0,
    (U8 *)"231225",(U8 *)"明水县",NULL,0,
    (U8 *)"231226",(U8 *)"绥棱县",NULL,0,
    (U8 *)"231281",(U8 *)"安达市",NULL,0,
    (U8 *)"231282",(U8 *)"肇东市",NULL,0,
    (U8 *)"231283",(U8 *)"海伦市",NULL,0,
  };
 //232700",(U8 *)"大兴安岭地区",
 const AREAnode HLJ_daxal[3] = 
{
    (U8 *)"232721",(U8 *)"呼玛县",NULL,0,
    (U8 *)"232722",(U8 *)"塔河县",NULL,0,
    (U8 *)"232723",(U8 *)"漠河县"
};
//310000",(U8 *)"上海市",

//320000",(U8 *)"江苏省",

 //320100",(U8 *)"南京市",
 const AREAnode JS_nanj[13] = 
{
    (U8 *)"320102",(U8 *)"玄武区",NULL,0,
    (U8 *)"320103",(U8 *)"白下区",NULL,0,
    (U8 *)"320104",(U8 *)"秦淮区",NULL,0,
    (U8 *)"320105",(U8 *)"建邺区",NULL,0,
    (U8 *)"320106",(U8 *)"鼓楼区",NULL,0,
    (U8 *)"320107",(U8 *)"下关区",NULL,0,
    (U8 *)"320111",(U8 *)"浦口区",NULL,0,
    (U8 *)"320113",(U8 *)"栖霞区",NULL,0,
    (U8 *)"320114",(U8 *)"雨花台区",NULL,0,
    (U8 *)"320115",(U8 *)"江宁区",NULL,0,
    (U8 *)"320116",(U8 *)"六合区",NULL,0,
    (U8 *)"320124",(U8 *)"溧水县",NULL,0,
    (U8 *)"320125",(U8 *)"高淳县",NULL,0,
  };
 //320200",(U8 *)"无锡市",
 const AREAnode JS_wux[8] = 
{
    (U8 *)"320202",(U8 *)"崇安区",NULL,0,
    (U8 *)"320203",(U8 *)"南长区",NULL,0,
    (U8 *)"320204",(U8 *)"北塘区",NULL,0,
    (U8 *)"320205",(U8 *)"锡山区",NULL,0,
    (U8 *)"320206",(U8 *)"惠山区",NULL,0,
    (U8 *)"320211",(U8 *)"滨湖区",NULL,0,
    (U8 *)"320281",(U8 *)"江阴市",NULL,0,
    (U8 *)"320282",(U8 *)"宜兴市",NULL,0,
  };
 //320300",(U8 *)"徐州市",
 const AREAnode JS_xuzh[11] = 
{
    (U8 *)"320302",(U8 *)"鼓楼区",NULL,0,
    (U8 *)"320303",(U8 *)"云龙区",NULL,0,
    (U8 *)"320304",(U8 *)"九里区",NULL,0,
    (U8 *)"320305",(U8 *)"贾汪区",NULL,0,
    (U8 *)"320311",(U8 *)"泉山区",NULL,0,
    (U8 *)"320321",(U8 *)"丰　县",NULL,0,
    (U8 *)"320322",(U8 *)"沛　县",NULL,0,
    (U8 *)"320323",(U8 *)"铜山县",NULL,0,
    (U8 *)"320324",(U8 *)"睢宁县",NULL,0,
    (U8 *)"320381",(U8 *)"新沂市",NULL,0,
    (U8 *)"320382",(U8 *)"邳州市",NULL,0,
  };
 //320400",(U8 *)"常州市",
 const AREAnode JS_changzh[7] = 
{
    (U8 *)"320402",(U8 *)"天宁区",NULL,0,
    (U8 *)"320404",(U8 *)"钟楼区",NULL,0,
    (U8 *)"320405",(U8 *)"戚墅堰区",NULL,0,
    (U8 *)"320411",(U8 *)"新北区",NULL,0,
    (U8 *)"320412",(U8 *)"武进区",NULL,0,
    (U8 *)"320481",(U8 *)"溧阳市",NULL,0,
    (U8 *)"320482",(U8 *)"金坛市",NULL,0,
  };
 //320500",(U8 *)"苏州市",
 const AREAnode JS_suzh[11] = 
{
    (U8 *)"320502",(U8 *)"沧浪区",NULL,0,
    (U8 *)"320503",(U8 *)"平江区",NULL,0,
    (U8 *)"320504",(U8 *)"金阊区",NULL,0,
    (U8 *)"320505",(U8 *)"虎丘区",NULL,0,
    (U8 *)"320506",(U8 *)"吴中区",NULL,0,
    (U8 *)"320507",(U8 *)"相城区",NULL,0,
    (U8 *)"320581",(U8 *)"常熟市",NULL,0,
    (U8 *)"320582",(U8 *)"张家港市",NULL,0,
    (U8 *)"320583",(U8 *)"昆山市",NULL,0,
    (U8 *)"320584",(U8 *)"吴江市",NULL,0,
    (U8 *)"320585",(U8 *)"太仓市",NULL,0,
  };
 //320600",(U8 *)"南通市",
 const AREAnode JS_nant[7] = 
{
    (U8 *)"320602",(U8 *)"崇川区",NULL,0,
    (U8 *)"320611",(U8 *)"港闸区",NULL,0,
    (U8 *)"320621",(U8 *)"海安县",NULL,0,
    (U8 *)"320623",(U8 *)"如东县",NULL,0,
    (U8 *)"320681",(U8 *)"启东市",NULL,0,
    (U8 *)"320682",(U8 *)"如皋市",NULL,0,
    (U8 *)"320684",(U8 *)"海门市",NULL,0,
  };
 //320700",(U8 *)"连云港市",
 const AREAnode JS_lianyg[7] = 
{
    (U8 *)"320703",(U8 *)"连云区",NULL,0,
    (U8 *)"320705",(U8 *)"新浦区",NULL,0,
    (U8 *)"320706",(U8 *)"海州区",NULL,0,
    (U8 *)"320721",(U8 *)"赣榆县",NULL,0,
    (U8 *)"320722",(U8 *)"东海县",NULL,0,
    (U8 *)"320723",(U8 *)"灌云县",NULL,0,
    (U8 *)"320724",(U8 *)"灌南县",NULL,0,
  };
 //320800",(U8 *)"淮安市",
 const AREAnode JS_huaia[8] = 
{
    (U8 *)"320802",(U8 *)"清河区",NULL,0,
    (U8 *)"320803",(U8 *)"楚州区",NULL,0,
    (U8 *)"320804",(U8 *)"淮阴区",NULL,0,
    (U8 *)"320811",(U8 *)"清浦区",NULL,0,
    (U8 *)"320826",(U8 *)"涟水县",NULL,0,
    (U8 *)"320829",(U8 *)"洪泽县",NULL,0,
    (U8 *)"320830",(U8 *)"盱眙县",NULL,0,
    (U8 *)"320831",(U8 *)"金湖县",NULL,0,
  };
 //320900",(U8 *)"盐城市",
 const AREAnode JS_yanch[9] = 
{
    (U8 *)"320902",(U8 *)"亭湖区",NULL,0,
    (U8 *)"320903",(U8 *)"盐都区",NULL,0,
    (U8 *)"320921",(U8 *)"响水县",NULL,0,
    (U8 *)"320922",(U8 *)"滨海县",NULL,0,
    (U8 *)"320923",(U8 *)"阜宁县",NULL,0,
    (U8 *)"320924",(U8 *)"射阳县",NULL,0,
    (U8 *)"320925",(U8 *)"建湖县",NULL,0,
    (U8 *)"320981",(U8 *)"东台市",NULL,0,
    (U8 *)"320982",(U8 *)"大丰市",NULL,0,
  };
 //321000",(U8 *)"扬州市",
 const AREAnode JS_yangzh[7] = 
{
    (U8 *)"321002",(U8 *)"广陵区",NULL,0,
    (U8 *)"321003",(U8 *)"邗江区",NULL,0,
    (U8 *)"321011",(U8 *)"维扬区",NULL,0,
    (U8 *)"321023",(U8 *)"宝应县",NULL,0,
    (U8 *)"321081",(U8 *)"仪征市",NULL,0,
    (U8 *)"321084",(U8 *)"高邮市",NULL,0,
    (U8 *)"321088",(U8 *)"江都市",NULL,0,
  };
 //321100",(U8 *)"镇江市",
 const AREAnode JS_zhenj[6] = 
{
    (U8 *)"321102",(U8 *)"京口区",NULL,0,
    (U8 *)"321111",(U8 *)"润州区",NULL,0,
    (U8 *)"321112",(U8 *)"丹徒区",NULL,0,
    (U8 *)"321181",(U8 *)"丹阳市",NULL,0,
    (U8 *)"321182",(U8 *)"扬中市",NULL,0,
    (U8 *)"321183",(U8 *)"句容市",NULL,0,
  };
 //321200",(U8 *)"泰州市",
 const AREAnode JS_taizh[6] = 
{
    (U8 *)"321202",(U8 *)"海陵区",NULL,0,
    (U8 *)"321203",(U8 *)"高港区",NULL,0,
    (U8 *)"321281",(U8 *)"兴化市",NULL,0,
    (U8 *)"321282",(U8 *)"靖江市",NULL,0,
    (U8 *)"321283",(U8 *)"泰兴市",NULL,0,
    (U8 *)"321284",(U8 *)"姜堰市",NULL,0,
  };
 //321300",(U8 *)"宿迁市",
 const AREAnode JS_suq[5] = 
{
    (U8 *)"321302",(U8 *)"宿城区",NULL,0,
    (U8 *)"321311",(U8 *)"宿豫区",NULL,0,
    (U8 *)"321322",(U8 *)"沭阳县",NULL,0,
    (U8 *)"321323",(U8 *)"泗阳县",NULL,0,
    (U8 *)"321324",(U8 *)"泗洪县",NULL,0,
  };//330000",(U8 *)"浙江省",
 //330100",(U8 *)"杭州市",
 const AREAnode ZJ_hangzh[13] = 
{
    (U8 *)"330102",(U8 *)"上城区",NULL,0,
    (U8 *)"330103",(U8 *)"下城区",NULL,0,
    (U8 *)"330104",(U8 *)"江干区",NULL,0,
    (U8 *)"330105",(U8 *)"拱墅区",NULL,0,
    (U8 *)"330106",(U8 *)"西湖区",NULL,0,
    (U8 *)"330108",(U8 *)"滨江区",NULL,0,
    (U8 *)"330109",(U8 *)"萧山区",NULL,0,
    (U8 *)"330110",(U8 *)"余杭区",NULL,0,
    (U8 *)"330122",(U8 *)"桐庐县",NULL,0,
    (U8 *)"330127",(U8 *)"淳安县",NULL,0,
    (U8 *)"330182",(U8 *)"建德市",NULL,0,
    (U8 *)"330183",(U8 *)"富阳市",NULL,0,
    (U8 *)"330185",(U8 *)"临安市",NULL,0,
  };
 //330200",(U8 *)"宁波市",
 const AREAnode ZJ_ningb[11] = 
{
    (U8 *)"330203",(U8 *)"海曙区",NULL,0,
    (U8 *)"330204",(U8 *)"江东区",NULL,0,
    (U8 *)"330205",(U8 *)"江北区",NULL,0,
    (U8 *)"330206",(U8 *)"北仑区",NULL,0,
    (U8 *)"330211",(U8 *)"镇海区",NULL,0,
    (U8 *)"330212",(U8 *)"鄞州区",NULL,0,
    (U8 *)"330225",(U8 *)"象山县",NULL,0,
    (U8 *)"330226",(U8 *)"宁海县",NULL,0,
    (U8 *)"330281",(U8 *)"余姚市",NULL,0,
    (U8 *)"330282",(U8 *)"慈溪市",NULL,0,
    (U8 *)"330283",(U8 *)"奉化市",NULL,0,
  };
 //330300",(U8 *)"温州市",
 const AREAnode ZJ_wenzh[11] = 
{
    (U8 *)"330302",(U8 *)"鹿城区",NULL,0,
    (U8 *)"330303",(U8 *)"龙湾区",NULL,0,
    (U8 *)"330304",(U8 *)"瓯海区",NULL,0,
    (U8 *)"330322",(U8 *)"洞头县",NULL,0,
    (U8 *)"330324",(U8 *)"永嘉县",NULL,0,
    (U8 *)"330326",(U8 *)"平阳县",NULL,0,
    (U8 *)"330327",(U8 *)"苍南县",NULL,0,
    (U8 *)"330328",(U8 *)"文成县",NULL,0,
    (U8 *)"330329",(U8 *)"泰顺县",NULL,0,
    (U8 *)"330381",(U8 *)"瑞安市",NULL,0,
    (U8 *)"330382",(U8 *)"乐清市",NULL,0,
  };
 //330400",(U8 *)"嘉兴市",
 const AREAnode ZJ_xingh[7] = 
{
    (U8 *)"330402",(U8 *)"南湖区",NULL,0,
    (U8 *)"330411",(U8 *)"秀洲区",NULL,0,
    (U8 *)"330421",(U8 *)"嘉善县",NULL,0,
    (U8 *)"330424",(U8 *)"海盐县",NULL,0,
    (U8 *)"330481",(U8 *)"海宁市",NULL,0,
    (U8 *)"330482",(U8 *)"平湖市",NULL,0,
    (U8 *)"330483",(U8 *)"桐乡市",NULL,0,
  };
 //330500",(U8 *)"湖州市",
 const AREAnode ZJ_huzh[5] = 
{
    (U8 *)"330502",(U8 *)"吴兴区",NULL,0,
    (U8 *)"330503",(U8 *)"南浔区",NULL,0,
    (U8 *)"330521",(U8 *)"德清县",NULL,0,
    (U8 *)"330522",(U8 *)"长兴县",NULL,0,
    (U8 *)"330523",(U8 *)"安吉县",NULL,0,
  };
 //330600",(U8 *)"绍兴市",
 const AREAnode ZJ_shaox[6] = 
{
    (U8 *)"330602",(U8 *)"越城区",NULL,0,
    (U8 *)"330621",(U8 *)"绍兴县",NULL,0,
    (U8 *)"330624",(U8 *)"新昌县",NULL,0,
    (U8 *)"330681",(U8 *)"诸暨市",NULL,0,
    (U8 *)"330682",(U8 *)"上虞市",NULL,0,
    (U8 *)"330683",(U8 *)"嵊州市",NULL,0,
  };
 //330700",(U8 *)"金华市",
 const AREAnode ZJ_jinh[9] = 
{
    (U8 *)"330702",(U8 *)"婺城区",NULL,0,
    (U8 *)"330703",(U8 *)"金东区",NULL,0,
    (U8 *)"330723",(U8 *)"武义县",NULL,0,
    (U8 *)"330726",(U8 *)"浦江县",NULL,0,
    (U8 *)"330727",(U8 *)"磐安县",NULL,0,
    (U8 *)"330781",(U8 *)"兰溪市",NULL,0,
    (U8 *)"330782",(U8 *)"义乌市",NULL,0,
    (U8 *)"330783",(U8 *)"东阳市",NULL,0,
    (U8 *)"330784",(U8 *)"永康市",NULL,0,
  };
 //330800",(U8 *)"衢州市",
 const AREAnode ZJ_yingzh[6] = 
{
    (U8 *)"330802",(U8 *)"柯城区",NULL,0,
    (U8 *)"330803",(U8 *)"衢江区",NULL,0,
    (U8 *)"330822",(U8 *)"常山县",NULL,0,
    (U8 *)"330824",(U8 *)"开化县",NULL,0,
    (U8 *)"330825",(U8 *)"龙游县",NULL,0,
    (U8 *)"330881",(U8 *)"江山市",NULL,0,
  };
 //330900",(U8 *)"舟山市",
 const AREAnode ZJ_zhoush[4] = 
{
    (U8 *)"330902",(U8 *)"定海区",NULL,0,
    (U8 *)"330903",(U8 *)"普陀区",NULL,0,
    (U8 *)"330921",(U8 *)"岱山县",NULL,0,
    (U8 *)"330922",(U8 *)"嵊泗县",NULL,0,
  };
 //331000",(U8 *)"台州市",
 const AREAnode ZJ_taizh[9] = 
{
    (U8 *)"331002",(U8 *)"椒江区",NULL,0,
    (U8 *)"331003",(U8 *)"黄岩区",NULL,0,
    (U8 *)"331004",(U8 *)"路桥区",NULL,0,
    (U8 *)"331021",(U8 *)"玉环县",NULL,0,
    (U8 *)"331022",(U8 *)"三门县",NULL,0,
    (U8 *)"331023",(U8 *)"天台县",NULL,0,
    (U8 *)"331024",(U8 *)"仙居县",NULL,0,
    (U8 *)"331081",(U8 *)"温岭市",NULL,0,
    (U8 *)"331082",(U8 *)"临海市",NULL,0,
  };
 //331100",(U8 *)"丽水市",
 const AREAnode ZJ_lish[9] = 
{
    (U8 *)"331102",(U8 *)"莲都区",NULL,0,
    (U8 *)"331121",(U8 *)"青田县",NULL,0,
    (U8 *)"331122",(U8 *)"缙云县",NULL,0,
    (U8 *)"331123",(U8 *)"遂昌县",NULL,0,
    (U8 *)"331124",(U8 *)"松阳县",NULL,0,
    (U8 *)"331125",(U8 *)"云和县",NULL,0,
    (U8 *)"331126",(U8 *)"庆元县",NULL,0,
    (U8 *)"331127",(U8 *)"景宁畲族自治县",NULL,0,
    (U8 *)"331181",(U8 *)"龙泉市",NULL,0,
  };//340000",(U8 *)"安徽省",
 //340100",(U8 *)"合肥市",
 const AREAnode AH_hef[7] = 
{
    (U8 *)"340102",(U8 *)"瑶海区",NULL,0,
    (U8 *)"340103",(U8 *)"庐阳区",NULL,0,
    (U8 *)"340104",(U8 *)"蜀山区",NULL,0,
    (U8 *)"340111",(U8 *)"包河区",NULL,0,
    (U8 *)"340121",(U8 *)"长丰县",NULL,0,
    (U8 *)"340122",(U8 *)"肥东县",NULL,0,
    (U8 *)"340123",(U8 *)"肥西县",NULL,0,
  };
 //340200",(U8 *)"芜湖市",
 const AREAnode AH_wuh[7] = 
{
    (U8 *)"340202",(U8 *)"镜湖区",NULL,0,
    (U8 *)"340203",(U8 *)"弋江区",NULL,0,
    (U8 *)"340207",(U8 *)"鸠江区",NULL,0,
    (U8 *)"340208",(U8 *)"三山区",NULL,0,
    (U8 *)"340221",(U8 *)"芜湖县",NULL,0,
    (U8 *)"340222",(U8 *)"繁昌县",NULL,0,
    (U8 *)"340223",(U8 *)"南陵县",NULL,0,
  };
 //340300",(U8 *)"蚌埠市",
 const AREAnode AH_bengb[7] = 
{
    (U8 *)"340302",(U8 *)"龙子湖区",NULL,0,
    (U8 *)"340303",(U8 *)"蚌山区",NULL,0,
    (U8 *)"340304",(U8 *)"禹会区",NULL,0,
    (U8 *)"340311",(U8 *)"淮上区",NULL,0,
    (U8 *)"340321",(U8 *)"怀远县",NULL,0,
    (U8 *)"340322",(U8 *)"五河县",NULL,0,
    (U8 *)"340323",(U8 *)"固镇县",NULL,0,
  };
 //340400",(U8 *)"淮南市",
 const AREAnode AH_huain[6] = 
{
    (U8 *)"340402",(U8 *)"大通区",NULL,0,
    (U8 *)"340403",(U8 *)"田家庵区",NULL,0,
    (U8 *)"340404",(U8 *)"谢家集区",NULL,0,
    (U8 *)"340405",(U8 *)"八公山区",NULL,0,
    (U8 *)"340406",(U8 *)"潘集区",NULL,0,
    (U8 *)"340421",(U8 *)"凤台县",NULL,0,
  };
 //340500",(U8 *)"马鞍山市",
 const AREAnode AH_maash[4] = 
{
    (U8 *)"340502",(U8 *)"金家庄区",NULL,0,
    (U8 *)"340503",(U8 *)"花山区",NULL,0,
    (U8 *)"340504",(U8 *)"雨山区",NULL,0,
    (U8 *)"340521",(U8 *)"当涂县",NULL,0,
  };
 //340600",(U8 *)"淮北市",
 const AREAnode AH_huaib[4] = 
{
    (U8 *)"340602",(U8 *)"杜集区",NULL,0,
    (U8 *)"340603",(U8 *)"相山区",NULL,0,
    (U8 *)"340604",(U8 *)"烈山区",NULL,0,
    (U8 *)"340621",(U8 *)"濉溪县",NULL,0,
  };
 //340700",(U8 *)"铜陵市",
 const AREAnode AH_tongl[4] = 
{
    (U8 *)"340702",(U8 *)"铜官山区",NULL,0,
    (U8 *)"340703",(U8 *)"狮子山区",NULL,0,
    (U8 *)"340711",(U8 *)"郊　区",NULL,0,
    (U8 *)"340721",(U8 *)"铜陵县",NULL,0,
  };
 //340800",(U8 *)"安庆市",
 const AREAnode AH_anq[11] = 
{
    (U8 *)"340802",(U8 *)"迎江区",NULL,0,
    (U8 *)"340803",(U8 *)"大观区",NULL,0,
    (U8 *)"340811",(U8 *)"宜秀区",NULL,0,
    (U8 *)"340822",(U8 *)"怀宁县",NULL,0,
    (U8 *)"340823",(U8 *)"枞阳县",NULL,0,
    (U8 *)"340824",(U8 *)"潜山县",NULL,0,
    (U8 *)"340825",(U8 *)"太湖县",NULL,0,
    (U8 *)"340826",(U8 *)"宿松县",NULL,0,
    (U8 *)"340827",(U8 *)"望江县",NULL,0,
    (U8 *)"340828",(U8 *)"岳西县",NULL,0,
    (U8 *)"340881",(U8 *)"桐城市",NULL,0,
  };
 //341000",(U8 *)"黄山市",
 const AREAnode AH_huangsh[7] = 
{
    (U8 *)"341002",(U8 *)"屯溪区",NULL,0,
    (U8 *)"341003",(U8 *)"黄山区",NULL,0,
    (U8 *)"341004",(U8 *)"徽州区",NULL,0,
    (U8 *)"341021",(U8 *)"歙　县",NULL,0,
    (U8 *)"341022",(U8 *)"休宁县",NULL,0,
    (U8 *)"341023",(U8 *)"黟　县",NULL,0,
    (U8 *)"341024",(U8 *)"祁门县",NULL,0,
  };
 //341100",(U8 *)"滁州市",
 const AREAnode AH_chuzh[8] = 
{
    (U8 *)"341102",(U8 *)"琅琊区",NULL,0,
    (U8 *)"341103",(U8 *)"南谯区",NULL,0,
    (U8 *)"341122",(U8 *)"来安县",NULL,0,
    (U8 *)"341124",(U8 *)"全椒县",NULL,0,
    (U8 *)"341125",(U8 *)"定远县",NULL,0,
    (U8 *)"341126",(U8 *)"凤阳县",NULL,0,
    (U8 *)"341181",(U8 *)"天长市",NULL,0,
    (U8 *)"341182",(U8 *)"明光市",NULL,0,
  };
 //341200",(U8 *)"阜阳市",
 const AREAnode AH_fuy[8] = 
{
    (U8 *)"341202",(U8 *)"颍州区",NULL,0,
    (U8 *)"341203",(U8 *)"颍东区",NULL,0,
    (U8 *)"341204",(U8 *)"颍泉区",NULL,0,
    (U8 *)"341221",(U8 *)"临泉县",NULL,0,
    (U8 *)"341222",(U8 *)"太和县",NULL,0,
    (U8 *)"341225",(U8 *)"阜南县",NULL,0,
    (U8 *)"341226",(U8 *)"颍上县",NULL,0,
    (U8 *)"341282",(U8 *)"界首市",NULL,0,
  };
 //341300",(U8 *)"宿州市",
 const AREAnode AH_suq[5] = 
{
    (U8 *)"341302",(U8 *)"埇桥区",NULL,0,
    (U8 *)"341321",(U8 *)"砀山县",NULL,0,
    (U8 *)"341322",(U8 *)"萧　县",NULL,0,
    (U8 *)"341323",(U8 *)"灵璧县",NULL,0,
    (U8 *)"341324",(U8 *)"泗　县",NULL,0,
  };
 //341400",(U8 *)"巢湖市",
 const AREAnode AH_chaoh[5] = 
{
    (U8 *)"341402",(U8 *)"居巢区",NULL,0,
    (U8 *)"341421",(U8 *)"庐江县",NULL,0,
    (U8 *)"341422",(U8 *)"无为县",NULL,0,
    (U8 *)"341423",(U8 *)"含山县",NULL,0,
    (U8 *)"341424",(U8 *)"和　县",NULL,0,
  };
 //341500",(U8 *)"六安市",
 const AREAnode AH_liuan[7] = 
{
    (U8 *)"341502",(U8 *)"金安区",NULL,0,
    (U8 *)"341503",(U8 *)"裕安区",NULL,0,
    (U8 *)"341521",(U8 *)"寿　县",NULL,0,
    (U8 *)"341522",(U8 *)"霍邱县",NULL,0,
    (U8 *)"341523",(U8 *)"舒城县",NULL,0,
    (U8 *)"341524",(U8 *)"金寨县",NULL,0,
    (U8 *)"341525",(U8 *)"霍山县",NULL,0,
  };
 //341600",(U8 *)"亳州市",
 const AREAnode AH_haozh[4] = 
{
    (U8 *)"341602",(U8 *)"谯城区",NULL,0,
    (U8 *)"341621",(U8 *)"涡阳县",NULL,0,
    (U8 *)"341622",(U8 *)"蒙城县",NULL,0,
    (U8 *)"341623",(U8 *)"利辛县",NULL,0,
  };
 //341700",(U8 *)"池州市",
 const AREAnode AH_chizh[4] = 
{
    (U8 *)"341702",(U8 *)"贵池区",NULL,0,
    (U8 *)"341721",(U8 *)"东至县",NULL,0,
    (U8 *)"341722",(U8 *)"石台县",NULL,0,
    (U8 *)"341723",(U8 *)"青阳县",NULL,0,
  };
 //341800",(U8 *)"宣城市",
 const AREAnode AH_yich[7] = 
{
    (U8 *)"341802",(U8 *)"宣州区",NULL,0,
    (U8 *)"341821",(U8 *)"郎溪县",NULL,0,
    (U8 *)"341822",(U8 *)"广德县",NULL,0,
    (U8 *)"341823",(U8 *)"泾　县",NULL,0,
    (U8 *)"341824",(U8 *)"绩溪县",NULL,0,
    (U8 *)"341825",(U8 *)"旌德县",NULL,0,
    (U8 *)"341881",(U8 *)"宁国市",NULL,0,
  };//350000",(U8 *)"福建省",
 //350100",(U8 *)"福州市",
 const AREAnode FJ_fuzh[13] = 
{
    (U8 *)"350102",(U8 *)"鼓楼区",NULL,0,
    (U8 *)"350103",(U8 *)"台江区",NULL,0,
    (U8 *)"350104",(U8 *)"仓山区",NULL,0,
    (U8 *)"350105",(U8 *)"马尾区",NULL,0,
    (U8 *)"350111",(U8 *)"晋安区",NULL,0,
    (U8 *)"350121",(U8 *)"闽侯县",NULL,0,
    (U8 *)"350122",(U8 *)"连江县",NULL,0,
    (U8 *)"350123",(U8 *)"罗源县",NULL,0,
    (U8 *)"350124",(U8 *)"闽清县",NULL,0,
    (U8 *)"350125",(U8 *)"永泰县",NULL,0,
    (U8 *)"350128",(U8 *)"平潭县",NULL,0,
    (U8 *)"350181",(U8 *)"福清市",NULL,0,
    (U8 *)"350182",(U8 *)"长乐市",NULL,0,
  };
 //350200",(U8 *)"厦门市",
 const AREAnode FJ_xiam[6] = 
{
    (U8 *)"350203",(U8 *)"思明区",NULL,0,
    (U8 *)"350205",(U8 *)"海沧区",NULL,0,
    (U8 *)"350206",(U8 *)"湖里区",NULL,0,
    (U8 *)"350211",(U8 *)"集美区",NULL,0,
    (U8 *)"350212",(U8 *)"同安区",NULL,0,
    (U8 *)"350213",(U8 *)"翔安区",NULL,0,
  };
 //350300",(U8 *)"莆田市",
 const AREAnode FJ_put[5] = 
{
    (U8 *)"350302",(U8 *)"城厢区",NULL,0,
    (U8 *)"350303",(U8 *)"涵江区",NULL,0,
    (U8 *)"350304",(U8 *)"荔城区",NULL,0,
    (U8 *)"350305",(U8 *)"秀屿区",NULL,0,
    (U8 *)"350322",(U8 *)"仙游县",NULL,0,
  };
 //350400",(U8 *)"三明市",
 const AREAnode FJ_sanm[12] = 
{
    (U8 *)"350402",(U8 *)"梅列区",NULL,0,
    (U8 *)"350403",(U8 *)"三元区",NULL,0,
    (U8 *)"350421",(U8 *)"明溪县",NULL,0,
    (U8 *)"350423",(U8 *)"清流县",NULL,0,
    (U8 *)"350424",(U8 *)"宁化县",NULL,0,
    (U8 *)"350425",(U8 *)"大田县",NULL,0,
    (U8 *)"350426",(U8 *)"尤溪县",NULL,0,
    (U8 *)"350427",(U8 *)"沙　县",NULL,0,
    (U8 *)"350428",(U8 *)"将乐县",NULL,0,
    (U8 *)"350429",(U8 *)"泰宁县",NULL,0,
    (U8 *)"350430",(U8 *)"建宁县",NULL,0,
    (U8 *)"350481",(U8 *)"永安市",NULL,0,
  };
 //350500",(U8 *)"泉州市",
 const AREAnode FJ_quanzh[12] = 
{
    (U8 *)"350502",(U8 *)"鲤城区",NULL,0,
    (U8 *)"350503",(U8 *)"丰泽区",NULL,0,
    (U8 *)"350504",(U8 *)"洛江区",NULL,0,
    (U8 *)"350505",(U8 *)"泉港区",NULL,0,
    (U8 *)"350521",(U8 *)"惠安县",NULL,0,
    (U8 *)"350524",(U8 *)"安溪县",NULL,0,
    (U8 *)"350525",(U8 *)"永春县",NULL,0,
    (U8 *)"350526",(U8 *)"德化县",NULL,0,
    (U8 *)"350527",(U8 *)"金门县",NULL,0,
    (U8 *)"350581",(U8 *)"石狮市",NULL,0,
    (U8 *)"350582",(U8 *)"晋江市",NULL,0,
    (U8 *)"350583",(U8 *)"南安市",NULL,0,
  };
 //350600",(U8 *)"漳州市",
 const AREAnode FJ_zhangzh[11] = 
{
    (U8 *)"350602",(U8 *)"芗城区",NULL,0,
    (U8 *)"350603",(U8 *)"龙文区",NULL,0,
    (U8 *)"350622",(U8 *)"云霄县",NULL,0,
    (U8 *)"350623",(U8 *)"漳浦县",NULL,0,
    (U8 *)"350624",(U8 *)"诏安县",NULL,0,
    (U8 *)"350625",(U8 *)"长泰县",NULL,0,
    (U8 *)"350626",(U8 *)"东山县",NULL,0,
    (U8 *)"350627",(U8 *)"南靖县",NULL,0,
    (U8 *)"350628",(U8 *)"平和县",NULL,0,
    (U8 *)"350629",(U8 *)"华安县",NULL,0,
    (U8 *)"350681",(U8 *)"龙海市",NULL,0,
  };
 //350700",(U8 *)"南平市",
 const AREAnode FJ_nanp[10] = 
{
    (U8 *)"350702",(U8 *)"延平区",NULL,0,
    (U8 *)"350721",(U8 *)"顺昌县",NULL,0,
    (U8 *)"350722",(U8 *)"浦城县",NULL,0,
    (U8 *)"350723",(U8 *)"光泽县",NULL,0,
    (U8 *)"350724",(U8 *)"松溪县",NULL,0,
    (U8 *)"350725",(U8 *)"政和县",NULL,0,
    (U8 *)"350781",(U8 *)"邵武市",NULL,0,
    (U8 *)"350782",(U8 *)"武夷山市",NULL,0,
    (U8 *)"350783",(U8 *)"建瓯市",NULL,0,
    (U8 *)"350784",(U8 *)"建阳市",NULL,0,
  };
 //350800",(U8 *)"龙岩市",
 const AREAnode FJ_longy[7] = 
{
    (U8 *)"350802",(U8 *)"新罗区",NULL,0,
    (U8 *)"350821",(U8 *)"长汀县",NULL,0,
    (U8 *)"350822",(U8 *)"永定县",NULL,0,
    (U8 *)"350823",(U8 *)"上杭县",NULL,0,
    (U8 *)"350824",(U8 *)"武平县",NULL,0,
    (U8 *)"350825",(U8 *)"连城县",NULL,0,
    (U8 *)"350881",(U8 *)"漳平市",NULL,0,
  };
 //350900",(U8 *)"宁德市",
 const AREAnode FJ_ningd[9] = 
{
    (U8 *)"350902",(U8 *)"蕉城区",NULL,0,
    (U8 *)"350921",(U8 *)"霞浦县",NULL,0,
    (U8 *)"350922",(U8 *)"古田县",NULL,0,
    (U8 *)"350923",(U8 *)"屏南县",NULL,0,
    (U8 *)"350924",(U8 *)"寿宁县",NULL,0,
    (U8 *)"350925",(U8 *)"周宁县",NULL,0,
    (U8 *)"350926",(U8 *)"柘荣县",NULL,0,
    (U8 *)"350981",(U8 *)"福安市",NULL,0,
    (U8 *)"350982",(U8 *)"福鼎市",NULL,0,
  };//360000",(U8 *)"江西省",
 //360100",(U8 *)"南昌市",
 const AREAnode JX_nanch[9] = 
{
    (U8 *)"360102",(U8 *)"东湖区",NULL,0,
    (U8 *)"360103",(U8 *)"西湖区",NULL,0,
    (U8 *)"360104",(U8 *)"青云谱区",NULL,0,
    (U8 *)"360105",(U8 *)"湾里区",NULL,0,
    (U8 *)"360111",(U8 *)"青山湖区",NULL,0,
    (U8 *)"360121",(U8 *)"南昌县",NULL,0,
    (U8 *)"360122",(U8 *)"新建县",NULL,0,
    (U8 *)"360123",(U8 *)"安义县",NULL,0,
    (U8 *)"360124",(U8 *)"进贤县",NULL,0,
  };
 //360200",(U8 *)"景德镇市",
 const AREAnode JX_jingdzh[4] = 
{
    (U8 *)"360202",(U8 *)"昌江区",NULL,0,
    (U8 *)"360203",(U8 *)"珠山区",NULL,0,
    (U8 *)"360222",(U8 *)"浮梁县",NULL,0,
    (U8 *)"360281",(U8 *)"乐平市",NULL,0,
  };
 //360300",(U8 *)"萍乡市",
 const AREAnode JX_pingx[5] = 
{
    (U8 *)"360302",(U8 *)"安源区",NULL,0,
    (U8 *)"360313",(U8 *)"湘东区",NULL,0,
    (U8 *)"360321",(U8 *)"莲花县",NULL,0,
    (U8 *)"360322",(U8 *)"上栗县",NULL,0,
    (U8 *)"360323",(U8 *)"芦溪县",NULL,0,
  };
 //360400",(U8 *)"九江市",
 const AREAnode JX_jiuj[12] = 
{
    (U8 *)"360402",(U8 *)"庐山区",NULL,0,
    (U8 *)"360403",(U8 *)"浔阳区",NULL,0,
    (U8 *)"360421",(U8 *)"九江县",NULL,0,
    (U8 *)"360423",(U8 *)"武宁县",NULL,0,
    (U8 *)"360424",(U8 *)"修水县",NULL,0,
    (U8 *)"360425",(U8 *)"永修县",NULL,0,
    (U8 *)"360426",(U8 *)"德安县",NULL,0,
    (U8 *)"360427",(U8 *)"星子县",NULL,0,
    (U8 *)"360428",(U8 *)"都昌县",NULL,0,
    (U8 *)"360429",(U8 *)"湖口县",NULL,0,
    (U8 *)"360430",(U8 *)"彭泽县",NULL,0,
    (U8 *)"360481",(U8 *)"瑞昌市",NULL,0,
  };
 //360500",(U8 *)"新余市",
 const AREAnode JX_xiny[2] = 
{
    (U8 *)"360502",(U8 *)"渝水区",NULL,0,
    (U8 *)"360521",(U8 *)"分宜县",NULL,0,
  };
 //360600",(U8 *)"鹰潭市",
 const AREAnode JX_yingt[3] = 
{
    (U8 *)"360602",(U8 *)"月湖区",NULL,0,
    (U8 *)"360622",(U8 *)"余江县",NULL,0,
    (U8 *)"360681",(U8 *)"贵溪市",NULL,0,
  };
 //360700",(U8 *)"赣州市",
 const AREAnode JX_ganzh[18] = 
{
    (U8 *)"360702",(U8 *)"章贡区",NULL,0,
    (U8 *)"360721",(U8 *)"赣　县",NULL,0,
    (U8 *)"360722",(U8 *)"信丰县",NULL,0,
    (U8 *)"360723",(U8 *)"大余县",NULL,0,
    (U8 *)"360724",(U8 *)"上犹县",NULL,0,
    (U8 *)"360725",(U8 *)"崇义县",NULL,0,
    (U8 *)"360726",(U8 *)"安远县",NULL,0,
    (U8 *)"360727",(U8 *)"龙南县",NULL,0,
    (U8 *)"360728",(U8 *)"定南县",NULL,0,
    (U8 *)"360729",(U8 *)"全南县",NULL,0,
    (U8 *)"360730",(U8 *)"宁都县",NULL,0,
    (U8 *)"360731",(U8 *)"于都县",NULL,0,
    (U8 *)"360732",(U8 *)"兴国县",NULL,0,
    (U8 *)"360733",(U8 *)"会昌县",NULL,0,
    (U8 *)"360734",(U8 *)"寻乌县",NULL,0,
    (U8 *)"360735",(U8 *)"石城县",NULL,0,
    (U8 *)"360781",(U8 *)"瑞金市",NULL,0,
    (U8 *)"360782",(U8 *)"南康市",NULL,0,
  };
 //360800",(U8 *)"吉安市",
 const AREAnode JX_jia[13] = 
{
    (U8 *)"360802",(U8 *)"吉州区",NULL,0,
    (U8 *)"360803",(U8 *)"青原区",NULL,0,
    (U8 *)"360821",(U8 *)"吉安县",NULL,0,
    (U8 *)"360822",(U8 *)"吉水县",NULL,0,
    (U8 *)"360823",(U8 *)"峡江县",NULL,0,
    (U8 *)"360824",(U8 *)"新干县",NULL,0,
    (U8 *)"360825",(U8 *)"永丰县",NULL,0,
    (U8 *)"360826",(U8 *)"泰和县",NULL,0,
    (U8 *)"360827",(U8 *)"遂川县",NULL,0,
    (U8 *)"360828",(U8 *)"万安县",NULL,0,
    (U8 *)"360829",(U8 *)"安福县",NULL,0,
    (U8 *)"360830",(U8 *)"永新县",NULL,0,
    (U8 *)"360881",(U8 *)"井冈山市",NULL,0,
  };
 //360900",(U8 *)"宜春市",
 const AREAnode JX_yich[10] = 
{
    (U8 *)"360902",(U8 *)"袁州区",NULL,0,
    (U8 *)"360921",(U8 *)"奉新县",NULL,0,
    (U8 *)"360922",(U8 *)"万载县",NULL,0,
    (U8 *)"360923",(U8 *)"上高县",NULL,0,
    (U8 *)"360924",(U8 *)"宜丰县",NULL,0,
    (U8 *)"360925",(U8 *)"靖安县",NULL,0,
    (U8 *)"360926",(U8 *)"铜鼓县",NULL,0,
    (U8 *)"360981",(U8 *)"丰城市",NULL,0,
    (U8 *)"360982",(U8 *)"樟树市",NULL,0,
    (U8 *)"360983",(U8 *)"高安市",NULL,0,
  };
 //361000",(U8 *)"抚州市",
 const AREAnode JX_fuzh[11] = 
{
    (U8 *)"361002",(U8 *)"临川区",NULL,0,
    (U8 *)"361021",(U8 *)"南城县",NULL,0,
    (U8 *)"361022",(U8 *)"黎川县",NULL,0,
    (U8 *)"361023",(U8 *)"南丰县",NULL,0,
    (U8 *)"361024",(U8 *)"崇仁县",NULL,0,
    (U8 *)"361025",(U8 *)"乐安县",NULL,0,
    (U8 *)"361026",(U8 *)"宜黄县",NULL,0,
    (U8 *)"361027",(U8 *)"金溪县",NULL,0,
    (U8 *)"361028",(U8 *)"资溪县",NULL,0,
    (U8 *)"361029",(U8 *)"东乡县",NULL,0,
    (U8 *)"361030",(U8 *)"广昌县",NULL,0,
  };
 //361100",(U8 *)"上饶市",
 const AREAnode JX_shangr[12] = 
{
    (U8 *)"361102",(U8 *)"信州区",NULL,0,
    (U8 *)"361121",(U8 *)"上饶县",NULL,0,
    (U8 *)"361122",(U8 *)"广丰县",NULL,0,
    (U8 *)"361123",(U8 *)"玉山县",NULL,0,
    (U8 *)"361124",(U8 *)"铅山县",NULL,0,
    (U8 *)"361125",(U8 *)"横峰县",NULL,0,
    (U8 *)"361126",(U8 *)"弋阳县",NULL,0,
    (U8 *)"361127",(U8 *)"余干县",NULL,0,
    (U8 *)"361128",(U8 *)"鄱阳县",NULL,0,
    (U8 *)"361129",(U8 *)"万年县",NULL,0,
    (U8 *)"361130",(U8 *)"婺源县",NULL,0,
    (U8 *)"361181",(U8 *)"德兴市",NULL,0,
  };//370000",(U8 *)"山东省",
 //370100",(U8 *)"济南市",
 const AREAnode SD_jin[10] = 
{
    (U8 *)"370102",(U8 *)"历下区",NULL,0,
    (U8 *)"370103",(U8 *)"市中区",NULL,0,
    (U8 *)"370104",(U8 *)"槐荫区",NULL,0,
    (U8 *)"370105",(U8 *)"天桥区",NULL,0,
    (U8 *)"370112",(U8 *)"历城区",NULL,0,
    (U8 *)"370113",(U8 *)"长清区",NULL,0,
    (U8 *)"370124",(U8 *)"平阴县",NULL,0,
    (U8 *)"370125",(U8 *)"济阳县",NULL,0,
    (U8 *)"370126",(U8 *)"商河县",NULL,0,
    (U8 *)"370181",(U8 *)"章丘市",NULL,0,
  };
 //370200",(U8 *)"青岛市",
 const AREAnode SD_qingd[12] = 
{
    (U8 *)"370202",(U8 *)"市南区",NULL,0,
    (U8 *)"370203",(U8 *)"市北区",NULL,0,
    (U8 *)"370205",(U8 *)"四方区",NULL,0,
    (U8 *)"370211",(U8 *)"黄岛区",NULL,0,
    (U8 *)"370212",(U8 *)"崂山区",NULL,0,
    (U8 *)"370213",(U8 *)"李沧区",NULL,0,
    (U8 *)"370214",(U8 *)"城阳区",NULL,0,
    (U8 *)"370281",(U8 *)"胶州市",NULL,0,
    (U8 *)"370282",(U8 *)"即墨市",NULL,0,
    (U8 *)"370283",(U8 *)"平度市",NULL,0,
    (U8 *)"370284",(U8 *)"胶南市",NULL,0,
    (U8 *)"370285",(U8 *)"莱西市",NULL,0,
  };
 //370300",(U8 *)"淄博市",
 const AREAnode SD_zib[8] = 
{
    (U8 *)"370302",(U8 *)"淄川区",NULL,0,
    (U8 *)"370303",(U8 *)"张店区",NULL,0,
    (U8 *)"370304",(U8 *)"博山区",NULL,0,
    (U8 *)"370305",(U8 *)"临淄区",NULL,0,
    (U8 *)"370306",(U8 *)"周村区",NULL,0,
    (U8 *)"370321",(U8 *)"桓台县",NULL,0,
    (U8 *)"370322",(U8 *)"高青县",NULL,0,
    (U8 *)"370323",(U8 *)"沂源县",NULL,0,
  };
 //370400",(U8 *)"枣庄市",
 const AREAnode SD_zaozh[6] = 
{
    (U8 *)"370402",(U8 *)"市中区",NULL,0,
    (U8 *)"370403",(U8 *)"薛城区",NULL,0,
    (U8 *)"370404",(U8 *)"峄城区",NULL,0,
    (U8 *)"370405",(U8 *)"台儿庄区",NULL,0,
    (U8 *)"370406",(U8 *)"山亭区",NULL,0,
    (U8 *)"370481",(U8 *)"滕州市",NULL,0,
  };
 //370500",(U8 *)"东营市",
 const AREAnode SD_dongy[5] = 
{
    (U8 *)"370502",(U8 *)"东营区",NULL,0,
    (U8 *)"370503",(U8 *)"河口区",NULL,0,
    (U8 *)"370521",(U8 *)"垦利县",NULL,0,
    (U8 *)"370522",(U8 *)"利津县",NULL,0,
    (U8 *)"370523",(U8 *)"广饶县",NULL,0,
  };
 //370600",(U8 *)"烟台市",
 const AREAnode SD_yant[12] = 
{
    (U8 *)"370602",(U8 *)"芝罘区",NULL,0,
    (U8 *)"370611",(U8 *)"福山区",NULL,0,
    (U8 *)"370612",(U8 *)"牟平区",NULL,0,
    (U8 *)"370613",(U8 *)"莱山区",NULL,0,
    (U8 *)"370634",(U8 *)"长岛县",NULL,0,
    (U8 *)"370681",(U8 *)"龙口市",NULL,0,
    (U8 *)"370682",(U8 *)"莱阳市",NULL,0,
    (U8 *)"370683",(U8 *)"莱州市",NULL,0,
    (U8 *)"370684",(U8 *)"蓬莱市",NULL,0,
    (U8 *)"370685",(U8 *)"招远市",NULL,0,
    (U8 *)"370686",(U8 *)"栖霞市",NULL,0,
    (U8 *)"370687",(U8 *)"海阳市",NULL,0,
  };
 //370700",(U8 *)"潍坊市",
 const AREAnode SD_weif[12] = 
{
    (U8 *)"370702",(U8 *)"潍城区",NULL,0,
    (U8 *)"370703",(U8 *)"寒亭区",NULL,0,
    (U8 *)"370704",(U8 *)"坊子区",NULL,0,
    (U8 *)"370705",(U8 *)"奎文区",NULL,0,
    (U8 *)"370724",(U8 *)"临朐县",NULL,0,
    (U8 *)"370725",(U8 *)"昌乐县",NULL,0,
    (U8 *)"370781",(U8 *)"青州市",NULL,0,
    (U8 *)"370782",(U8 *)"诸城市",NULL,0,
    (U8 *)"370783",(U8 *)"寿光市",NULL,0,
    (U8 *)"370784",(U8 *)"安丘市",NULL,0,
    (U8 *)"370785",(U8 *)"高密市",NULL,0,
    (U8 *)"370786",(U8 *)"昌邑市",NULL,0,
  };
 //370800",(U8 *)"济宁市",
 const AREAnode SD_jining[12] = 
{
    (U8 *)"370802",(U8 *)"市中区",NULL,0,
    (U8 *)"370811",(U8 *)"任城区",NULL,0,
    (U8 *)"370826",(U8 *)"微山县",NULL,0,
    (U8 *)"370827",(U8 *)"鱼台县",NULL,0,
    (U8 *)"370828",(U8 *)"金乡县",NULL,0,
    (U8 *)"370829",(U8 *)"嘉祥县",NULL,0,
    (U8 *)"370830",(U8 *)"汶上县",NULL,0,
    (U8 *)"370831",(U8 *)"泗水县",NULL,0,
    (U8 *)"370832",(U8 *)"梁山县",NULL,0,
    (U8 *)"370881",(U8 *)"曲阜市",NULL,0,
    (U8 *)"370882",(U8 *)"兖州市",NULL,0,
    (U8 *)"370883",(U8 *)"邹城市",NULL,0,
  };
 //370900",(U8 *)"泰安市",
 const AREAnode SD_taia[6] = 
{
    (U8 *)"370902",(U8 *)"泰山区",NULL,0,
    (U8 *)"370911",(U8 *)"岱岳区",NULL,0,
    (U8 *)"370921",(U8 *)"宁阳县",NULL,0,
    (U8 *)"370923",(U8 *)"东平县",NULL,0,
    (U8 *)"370982",(U8 *)"新泰市",NULL,0,
    (U8 *)"370983",(U8 *)"肥城市",NULL,0,
  };
 //371000",(U8 *)"威海市",
 const AREAnode SD_weih[4] = 
{
    (U8 *)"371002",(U8 *)"环翠区",NULL,0,
    (U8 *)"371081",(U8 *)"文登市",NULL,0,
    (U8 *)"371082",(U8 *)"荣成市",NULL,0,
    (U8 *)"371083",(U8 *)"乳山市",NULL,0,
  };
 //371100",(U8 *)"日照市",
 const AREAnode SD_rizh[4] = 
{
    (U8 *)"371102",(U8 *)"东港区",NULL,0,
    (U8 *)"371103",(U8 *)"岚山区",NULL,0,
    (U8 *)"371121",(U8 *)"五莲县",NULL,0,
    (U8 *)"371122",(U8 *)"莒　县",NULL,0,
  };
 //371200",(U8 *)"莱芜市",
 const AREAnode SD_laiw[2] = 
{
    (U8 *)"371202",(U8 *)"莱城区",NULL,0,
    (U8 *)"371203",(U8 *)"钢城区",NULL,0,
  };
 //371300",(U8 *)"临沂市",
 const AREAnode SD_liny[12] = 
{
    (U8 *)"371302",(U8 *)"兰山区",NULL,0,
    (U8 *)"371311",(U8 *)"罗庄区",NULL,0,
    (U8 *)"371312",(U8 *)"河东区",NULL,0,
    (U8 *)"371321",(U8 *)"沂南县",NULL,0,
    (U8 *)"371322",(U8 *)"郯城县",NULL,0,
    (U8 *)"371323",(U8 *)"沂水县",NULL,0,
    (U8 *)"371324",(U8 *)"苍山县",NULL,0,
    (U8 *)"371325",(U8 *)"费　县",NULL,0,
    (U8 *)"371326",(U8 *)"平邑县",NULL,0,
    (U8 *)"371327",(U8 *)"莒南县",NULL,0,
    (U8 *)"371328",(U8 *)"蒙阴县",NULL,0,
    (U8 *)"371329",(U8 *)"临沭县",NULL,0,
  };
 //371400",(U8 *)"德州市",
 const AREAnode SD_dezh[11] = 
{
    (U8 *)"371402",(U8 *)"德城区",NULL,0,
    (U8 *)"371421",(U8 *)"陵　县",NULL,0,
    (U8 *)"371422",(U8 *)"宁津县",NULL,0,
    (U8 *)"371423",(U8 *)"庆云县",NULL,0,
    (U8 *)"371424",(U8 *)"临邑县",NULL,0,
    (U8 *)"371425",(U8 *)"齐河县",NULL,0,
    (U8 *)"371426",(U8 *)"平原县",NULL,0,
    (U8 *)"371427",(U8 *)"夏津县",NULL,0,
    (U8 *)"371428",(U8 *)"武城县",NULL,0,
    (U8 *)"371481",(U8 *)"乐陵市",NULL,0,
    (U8 *)"371482",(U8 *)"禹城市",NULL,0,
  };
 //371500",(U8 *)"聊城市",
 const AREAnode SD_liaoch[8] = 
{
    (U8 *)"371502",(U8 *)"东昌府区",NULL,0,
    (U8 *)"371521",(U8 *)"阳谷县",NULL,0,
    (U8 *)"371522",(U8 *)"莘　县",NULL,0,
    (U8 *)"371523",(U8 *)"茌平县",NULL,0,
    (U8 *)"371524",(U8 *)"东阿县",NULL,0,
    (U8 *)"371525",(U8 *)"冠　县",NULL,0,
    (U8 *)"371526",(U8 *)"高唐县",NULL,0,
    (U8 *)"371581",(U8 *)"临清市",NULL,0,
  };
 //371600",(U8 *)"滨州市",
 const AREAnode SD_binzh[7] = 
{
    (U8 *)"371602",(U8 *)"滨城区",NULL,0,
    (U8 *)"371621",(U8 *)"惠民县",NULL,0,
    (U8 *)"371622",(U8 *)"阳信县",NULL,0,
    (U8 *)"371623",(U8 *)"无棣县",NULL,0,
    (U8 *)"371624",(U8 *)"沾化县",NULL,0,
    (U8 *)"371625",(U8 *)"博兴县",NULL,0,
    (U8 *)"371626",(U8 *)"邹平县",NULL,0,
  };
 //371700",(U8 *)"菏泽市",
 const AREAnode SD_hez[9] = 
{
    (U8 *)"371702",(U8 *)"牡丹区",NULL,0,
    (U8 *)"371721",(U8 *)"曹　县",NULL,0,
    (U8 *)"371722",(U8 *)"单　县",NULL,0,
    (U8 *)"371723",(U8 *)"成武县",NULL,0,
    (U8 *)"371724",(U8 *)"巨野县",NULL,0,
    (U8 *)"371725",(U8 *)"郓城县",NULL,0,
    (U8 *)"371726",(U8 *)"鄄城县",NULL,0,
    (U8 *)"371727",(U8 *)"定陶县",NULL,0,
    (U8 *)"371728",(U8 *)"东明县",NULL,0,
  };//410000",(U8 *)"河南省",
 //410100",(U8 *)"郑州市",
 const AREAnode HN_zhengzh[12] = 
{
    (U8 *)"410102",(U8 *)"中原区",NULL,0,
    (U8 *)"410103",(U8 *)"二七区",NULL,0,
    (U8 *)"410104",(U8 *)"管城回族区",NULL,0,
    (U8 *)"410105",(U8 *)"金水区",NULL,0,
    (U8 *)"410106",(U8 *)"上街区",NULL,0,
    (U8 *)"410108",(U8 *)"惠济区",NULL,0,
    (U8 *)"410122",(U8 *)"中牟县",NULL,0,
    (U8 *)"410181",(U8 *)"巩义市",NULL,0,
    (U8 *)"410182",(U8 *)"荥阳市",NULL,0,
    (U8 *)"410183",(U8 *)"新密市",NULL,0,
    (U8 *)"410184",(U8 *)"新郑市",NULL,0,
    (U8 *)"410185",(U8 *)"登封市",NULL,0,
  };
 //410200",(U8 *)"开封市",
 const AREAnode HN_kaif[10] = 
{
    (U8 *)"410202",(U8 *)"龙亭区",NULL,0,
    (U8 *)"410203",(U8 *)"顺河回族区",NULL,0,
    (U8 *)"410204",(U8 *)"鼓楼区",NULL,0,
    (U8 *)"410205",(U8 *)"禹王台区",NULL,0,
    (U8 *)"410211",(U8 *)"金明区",NULL,0,
    (U8 *)"410221",(U8 *)"杞　县",NULL,0,
    (U8 *)"410222",(U8 *)"通许县",NULL,0,
    (U8 *)"410223",(U8 *)"尉氏县",NULL,0,
    (U8 *)"410224",(U8 *)"开封县",NULL,0,
    (U8 *)"410225",(U8 *)"兰考县",NULL,0,
  };
 //410300",(U8 *)"洛阳市",
 const AREAnode HN_luoy[15] = 
{
    (U8 *)"410302",(U8 *)"老城区",NULL,0,
    (U8 *)"410303",(U8 *)"西工区",NULL,0,
    (U8 *)"410304",(U8 *)"瀍河回族区",NULL,0,
    (U8 *)"410305",(U8 *)"涧西区",NULL,0,
    (U8 *)"410306",(U8 *)"吉利区",NULL,0,
    (U8 *)"410311",(U8 *)"洛龙区",NULL,0,
    (U8 *)"410322",(U8 *)"孟津县",NULL,0,
    (U8 *)"410323",(U8 *)"新安县",NULL,0,
    (U8 *)"410324",(U8 *)"栾川县",NULL,0,
    (U8 *)"410325",(U8 *)"嵩　县",NULL,0,
    (U8 *)"410326",(U8 *)"汝阳县",NULL,0,
    (U8 *)"410327",(U8 *)"宜阳县",NULL,0,
    (U8 *)"410328",(U8 *)"洛宁县",NULL,0,
    (U8 *)"410329",(U8 *)"伊川县",NULL,0,
    (U8 *)"410381",(U8 *)"偃师市",NULL,0,
  };
 //410400",(U8 *)"平顶山市",
 const AREAnode HN_pingdsh[10] = 
{
    (U8 *)"410402",(U8 *)"新华区",NULL,0,
    (U8 *)"410403",(U8 *)"卫东区",NULL,0,
    (U8 *)"410404",(U8 *)"石龙区",NULL,0,
    (U8 *)"410411",(U8 *)"湛河区",NULL,0,
    (U8 *)"410421",(U8 *)"宝丰县",NULL,0,
    (U8 *)"410422",(U8 *)"叶　县",NULL,0,
    (U8 *)"410423",(U8 *)"鲁山县",NULL,0,
    (U8 *)"410425",(U8 *)"郏　县",NULL,0,
    (U8 *)"410481",(U8 *)"舞钢市",NULL,0,
    (U8 *)"410482",(U8 *)"汝州市",NULL,0,
  };
 //410500",(U8 *)"安阳市",
 const AREAnode HN_any[9] = 
{
    (U8 *)"410502",(U8 *)"文峰区",NULL,0,
    (U8 *)"410503",(U8 *)"北关区",NULL,0,
    (U8 *)"410505",(U8 *)"殷都区",NULL,0,
    (U8 *)"410506",(U8 *)"龙安区",NULL,0,
    (U8 *)"410522",(U8 *)"安阳县",NULL,0,
    (U8 *)"410523",(U8 *)"汤阴县",NULL,0,
    (U8 *)"410526",(U8 *)"滑　县",NULL,0,
    (U8 *)"410527",(U8 *)"内黄县",NULL,0,
    (U8 *)"410581",(U8 *)"林州市",NULL,0,
  };
 //410600",(U8 *)"鹤壁市",
 const AREAnode HN_heb[5] = 
{
    (U8 *)"410602",(U8 *)"鹤山区",NULL,0,
    (U8 *)"410603",(U8 *)"山城区",NULL,0,
    (U8 *)"410611",(U8 *)"淇滨区",NULL,0,
    (U8 *)"410621",(U8 *)"浚　县",NULL,0,
    (U8 *)"410622",(U8 *)"淇　县",NULL,0,
  };
 //410700",(U8 *)"新乡市",
 const AREAnode HN_xinx[12] = 
{
    (U8 *)"410702",(U8 *)"红旗区",NULL,0,
    (U8 *)"410703",(U8 *)"卫滨区",NULL,0,
    (U8 *)"410704",(U8 *)"凤泉区",NULL,0,
    (U8 *)"410711",(U8 *)"牧野区",NULL,0,
    (U8 *)"410721",(U8 *)"新乡县",NULL,0,
    (U8 *)"410724",(U8 *)"获嘉县",NULL,0,
    (U8 *)"410725",(U8 *)"原阳县",NULL,0,
    (U8 *)"410726",(U8 *)"延津县",NULL,0,
    (U8 *)"410727",(U8 *)"封丘县",NULL,0,
    (U8 *)"410728",(U8 *)"长垣县",NULL,0,
    (U8 *)"410781",(U8 *)"卫辉市",NULL,0,
    (U8 *)"410782",(U8 *)"辉县市",NULL,0,
  };
 //410800",(U8 *)"焦作市",
 const AREAnode HN_jiaoz[10] = 
{
    (U8 *)"410802",(U8 *)"解放区",NULL,0,
    (U8 *)"410803",(U8 *)"中站区",NULL,0,
    (U8 *)"410804",(U8 *)"马村区",NULL,0,
    (U8 *)"410811",(U8 *)"山阳区",NULL,0,
    (U8 *)"410821",(U8 *)"修武县",NULL,0,
    (U8 *)"410822",(U8 *)"博爱县",NULL,0,
    (U8 *)"410823",(U8 *)"武陟县",NULL,0,
    (U8 *)"410825",(U8 *)"温　县",NULL,0,
    (U8 *)"410882",(U8 *)"沁阳市",NULL,0,
    (U8 *)"410883",(U8 *)"孟州市",NULL,0,
  };
 //410900",(U8 *)"濮阳市",
 const AREAnode HN_puy[6] = 
{
    (U8 *)"410902",(U8 *)"华龙区",NULL,0,
    (U8 *)"410922",(U8 *)"清丰县",NULL,0,
    (U8 *)"410923",(U8 *)"南乐县",NULL,0,
    (U8 *)"410926",(U8 *)"范　县",NULL,0,
    (U8 *)"410927",(U8 *)"台前县",NULL,0,
    (U8 *)"410928",(U8 *)"濮阳县",NULL,0,
  };
 //411000",(U8 *)"许昌市",
 const AREAnode HN_xuch[6] = 
{
    (U8 *)"411002",(U8 *)"魏都区",NULL,0,
    (U8 *)"411023",(U8 *)"许昌县",NULL,0,
    (U8 *)"411024",(U8 *)"鄢陵县",NULL,0,
    (U8 *)"411025",(U8 *)"襄城县",NULL,0,
    (U8 *)"411081",(U8 *)"禹州市",NULL,0,
    (U8 *)"411082",(U8 *)"长葛市",NULL,0,
  };
 //411100",(U8 *)"漯河市",
 const AREAnode HN_luoh[5] = 
{
    (U8 *)"411102",(U8 *)"源汇区",NULL,0,
    (U8 *)"411103",(U8 *)"郾城区",NULL,0,
    (U8 *)"411104",(U8 *)"召陵区",NULL,0,
    (U8 *)"411121",(U8 *)"舞阳县",NULL,0,
    (U8 *)"411122",(U8 *)"临颍县",NULL,0,
  };
 //411200",(U8 *)"三门峡市",
 const AREAnode HN_sanmx[6] = 
{
    (U8 *)"411202",(U8 *)"湖滨区",NULL,0,
    (U8 *)"411221",(U8 *)"渑池县",NULL,0,
    (U8 *)"411222",(U8 *)"陕　县",NULL,0,
    (U8 *)"411224",(U8 *)"卢氏县",NULL,0,
    (U8 *)"411281",(U8 *)"义马市",NULL,0,
    (U8 *)"411282",(U8 *)"灵宝市",NULL,0,
  };
 //411300",(U8 *)"南阳市",
 const AREAnode HN_nany[13] = 
{
    (U8 *)"411302",(U8 *)"宛城区",NULL,0,
    (U8 *)"411303",(U8 *)"卧龙区",NULL,0,
    (U8 *)"411321",(U8 *)"南召县",NULL,0,
    (U8 *)"411322",(U8 *)"方城县",NULL,0,
    (U8 *)"411323",(U8 *)"西峡县",NULL,0,
    (U8 *)"411324",(U8 *)"镇平县",NULL,0,
    (U8 *)"411325",(U8 *)"内乡县",NULL,0,
    (U8 *)"411326",(U8 *)"淅川县",NULL,0,
    (U8 *)"411327",(U8 *)"社旗县",NULL,0,
    (U8 *)"411328",(U8 *)"唐河县",NULL,0,
    (U8 *)"411329",(U8 *)"新野县",NULL,0,
    (U8 *)"411330",(U8 *)"桐柏县",NULL,0,
    (U8 *)"411381",(U8 *)"邓州市",NULL,0,
  };
 //411400",(U8 *)"商丘市",
 const AREAnode HN_shangq[9] = 
{
    (U8 *)"411402",(U8 *)"梁园区",NULL,0,
    (U8 *)"411403",(U8 *)"睢阳区",NULL,0,
    (U8 *)"411421",(U8 *)"民权县",NULL,0,
    (U8 *)"411422",(U8 *)"睢　县",NULL,0,
    (U8 *)"411423",(U8 *)"宁陵县",NULL,0,
    (U8 *)"411424",(U8 *)"柘城县",NULL,0,
    (U8 *)"411425",(U8 *)"虞城县",NULL,0,
    (U8 *)"411426",(U8 *)"夏邑县",NULL,0,
    (U8 *)"411481",(U8 *)"永城市",NULL,0,
  };
 //411500",(U8 *)"信阳市",
 const AREAnode HN_xiny[10] = 
{
    (U8 *)"411502",(U8 *)"浉河区",NULL,0,
    (U8 *)"411503",(U8 *)"平桥区",NULL,0,
    (U8 *)"411521",(U8 *)"罗山县",NULL,0,
    (U8 *)"411522",(U8 *)"光山县",NULL,0,
    (U8 *)"411523",(U8 *)"新　县",NULL,0,
    (U8 *)"411524",(U8 *)"商城县",NULL,0,
    (U8 *)"411525",(U8 *)"固始县",NULL,0,
    (U8 *)"411526",(U8 *)"潢川县",NULL,0,
    (U8 *)"411527",(U8 *)"淮滨县",NULL,0,
    (U8 *)"411528",(U8 *)"息　县",NULL,0,
  };
 //411600",(U8 *)"周口市",
 const AREAnode HN_zhouk[10] = 
{
    (U8 *)"411602",(U8 *)"川汇区",NULL,0,
    (U8 *)"411621",(U8 *)"扶沟县",NULL,0,
    (U8 *)"411622",(U8 *)"西华县",NULL,0,
    (U8 *)"411623",(U8 *)"商水县",NULL,0,
    (U8 *)"411624",(U8 *)"沈丘县",NULL,0,
    (U8 *)"411625",(U8 *)"郸城县",NULL,0,
    (U8 *)"411626",(U8 *)"淮阳县",NULL,0,
    (U8 *)"411627",(U8 *)"太康县",NULL,0,
    (U8 *)"411628",(U8 *)"鹿邑县",NULL,0,
    (U8 *)"411681",(U8 *)"项城市",NULL,0,
  };
 //411700",(U8 *)"驻马店市",
 const AREAnode HN_zhumd[11] = 
{
    (U8 *)"411702",(U8 *)"驿城区",NULL,0,
    (U8 *)"411721",(U8 *)"西平县",NULL,0,
    (U8 *)"411722",(U8 *)"上蔡县",NULL,0,
    (U8 *)"411723",(U8 *)"平舆县",NULL,0,
    (U8 *)"411724",(U8 *)"正阳县",NULL,0,
    (U8 *)"411725",(U8 *)"确山县",NULL,0,
    (U8 *)"411726",(U8 *)"泌阳县",NULL,0,
    (U8 *)"411727",(U8 *)"汝南县",NULL,0,
    (U8 *)"411728",(U8 *)"遂平县",NULL,0,
    (U8 *)"411729",(U8 *)"新蔡县",NULL,0,
    (U8 *)"419001",(U8 *)"济源市",NULL,0,
  };//420000",(U8 *)"湖北省",
 //420100",(U8 *)"武汉市",
 const AREAnode HuB_wuh[13] = 
{
    (U8 *)"420102",(U8 *)"江岸区",NULL,0,
    (U8 *)"420103",(U8 *)"江汉区",NULL,0,
    (U8 *)"420104",(U8 *)"硚口区",NULL,0,
    (U8 *)"420105",(U8 *)"汉阳区",NULL,0,
    (U8 *)"420106",(U8 *)"武昌区",NULL,0,
    (U8 *)"420107",(U8 *)"青山区",NULL,0,
    (U8 *)"420111",(U8 *)"洪山区",NULL,0,
    (U8 *)"420112",(U8 *)"东西湖区",NULL,0,
    (U8 *)"420113",(U8 *)"汉南区",NULL,0,
    (U8 *)"420114",(U8 *)"蔡甸区",NULL,0,
    (U8 *)"420115",(U8 *)"江夏区",NULL,0,
    (U8 *)"420116",(U8 *)"黄陂区",NULL,0,
    (U8 *)"420117",(U8 *)"新洲区",NULL,0,
  };
 //420200",(U8 *)"黄石市",
 const AREAnode HuB_huangsh[6] = 
{
    (U8 *)"420202",(U8 *)"黄石港区",NULL,0,
    (U8 *)"420203",(U8 *)"西塞山区",NULL,0,
    (U8 *)"420204",(U8 *)"下陆区",NULL,0,
    (U8 *)"420205",(U8 *)"铁山区",NULL,0,
    (U8 *)"420222",(U8 *)"阳新县",NULL,0,
    (U8 *)"420281",(U8 *)"大冶市",NULL,0,
  };
 //420300",(U8 *)"十堰市",
 const AREAnode HuB_shiy[8] = 
{
    (U8 *)"420302",(U8 *)"茅箭区",NULL,0,
    (U8 *)"420303",(U8 *)"张湾区",NULL,0,
    (U8 *)"420321",(U8 *)"郧　县",NULL,0,
    (U8 *)"420322",(U8 *)"郧西县",NULL,0,
    (U8 *)"420323",(U8 *)"竹山县",NULL,0,
    (U8 *)"420324",(U8 *)"竹溪县",NULL,0,
    (U8 *)"420325",(U8 *)"房　县",NULL,0,
    (U8 *)"420381",(U8 *)"丹江口市",NULL,0,
  };
 //420500",(U8 *)"宜昌市",
 const AREAnode HuB_yich[13] = 
{
    (U8 *)"420502",(U8 *)"西陵区",NULL,0,
    (U8 *)"420503",(U8 *)"伍家岗区",NULL,0,
    (U8 *)"420504",(U8 *)"点军区",NULL,0,
    (U8 *)"420505",(U8 *)"猇亭区",NULL,0,
    (U8 *)"420506",(U8 *)"夷陵区",NULL,0,
    (U8 *)"420525",(U8 *)"远安县",NULL,0,
    (U8 *)"420526",(U8 *)"兴山县",NULL,0,
    (U8 *)"420527",(U8 *)"秭归县",NULL,0,
    (U8 *)"420528",(U8 *)"长阳土家族自治县",NULL,0,
    (U8 *)"420529",(U8 *)"五峰土家族自治县",NULL,0,
    (U8 *)"420581",(U8 *)"宜都市",NULL,0,
    (U8 *)"420582",(U8 *)"当阳市",NULL,0,
    (U8 *)"420583",(U8 *)"枝江市",NULL,0,
  };
 //420600",(U8 *)"襄樊市",
 const AREAnode HuB_xiangf[9] = 
{
    (U8 *)"420602",(U8 *)"襄城区",NULL,0,
    (U8 *)"420606",(U8 *)"樊城区",NULL,0,
    (U8 *)"420607",(U8 *)"襄阳区",NULL,0,
    (U8 *)"420624",(U8 *)"南漳县",NULL,0,
    (U8 *)"420625",(U8 *)"谷城县",NULL,0,
    (U8 *)"420626",(U8 *)"保康县",NULL,0,
    (U8 *)"420682",(U8 *)"老河口市",NULL,0,
    (U8 *)"420683",(U8 *)"枣阳市",NULL,0,
    (U8 *)"420684",(U8 *)"宜城市",NULL,0,
  };
 //420700",(U8 *)"鄂州市",
 const AREAnode HuB_ezh[3] = 
{
    (U8 *)"420702",(U8 *)"梁子湖区",NULL,0,
    (U8 *)"420703",(U8 *)"华容区",NULL,0,
    (U8 *)"420704",(U8 *)"鄂城区",NULL,0,
  };
 //420800",(U8 *)"荆门市",
 const AREAnode HuB_jingm[5] = 
{
    (U8 *)"420802",(U8 *)"东宝区",NULL,0,
    (U8 *)"420804",(U8 *)"掇刀区",NULL,0,
    (U8 *)"420821",(U8 *)"京山县",NULL,0,
    (U8 *)"420822",(U8 *)"沙洋县",NULL,0,
    (U8 *)"420881",(U8 *)"钟祥市",NULL,0,
  };
 //420900",(U8 *)"孝感市",
 const AREAnode HuB_xiaog[7] = 
{
    (U8 *)"420902",(U8 *)"孝南区",NULL,0,
    (U8 *)"420921",(U8 *)"孝昌县",NULL,0,
    (U8 *)"420922",(U8 *)"大悟县",NULL,0,
    (U8 *)"420923",(U8 *)"云梦县",NULL,0,
    (U8 *)"420981",(U8 *)"应城市",NULL,0,
    (U8 *)"420982",(U8 *)"安陆市",NULL,0,
    (U8 *)"420984",(U8 *)"汉川市",NULL,0,
  };
 //421000",(U8 *)"荆州市",
 const AREAnode HuB_jingzh[8] = 
{
    (U8 *)"421002",(U8 *)"沙市区",NULL,0,
    (U8 *)"421003",(U8 *)"荆州区",NULL,0,
    (U8 *)"421022",(U8 *)"公安县",NULL,0,
    (U8 *)"421023",(U8 *)"监利县",NULL,0,
    (U8 *)"421024",(U8 *)"江陵县",NULL,0,
    (U8 *)"421081",(U8 *)"石首市",NULL,0,
    (U8 *)"421083",(U8 *)"洪湖市",NULL,0,
    (U8 *)"421087",(U8 *)"松滋市",NULL,0,
  };
 //421100",(U8 *)"黄冈市",
 const AREAnode HuB_huangg[10] = 
{
    (U8 *)"421102",(U8 *)"黄州区",NULL,0,
    (U8 *)"421121",(U8 *)"团风县",NULL,0,
    (U8 *)"421122",(U8 *)"红安县",NULL,0,
    (U8 *)"421123",(U8 *)"罗田县",NULL,0,
    (U8 *)"421124",(U8 *)"英山县",NULL,0,
    (U8 *)"421125",(U8 *)"浠水县",NULL,0,
    (U8 *)"421126",(U8 *)"蕲春县",NULL,0,
    (U8 *)"421127",(U8 *)"黄梅县",NULL,0,
    (U8 *)"421181",(U8 *)"麻城市",NULL,0,
    (U8 *)"421182",(U8 *)"武穴市",NULL,0,
  };
 //421200",(U8 *)"咸宁市",
 const AREAnode HuB_xiann[6] = 
{
    (U8 *)"421202",(U8 *)"咸安区",NULL,0,
    (U8 *)"421221",(U8 *)"嘉鱼县",NULL,0,
    (U8 *)"421222",(U8 *)"通城县",NULL,0,
    (U8 *)"421223",(U8 *)"崇阳县",NULL,0,
    (U8 *)"421224",(U8 *)"通山县",NULL,0,
    (U8 *)"421281",(U8 *)"赤壁市",NULL,0,
  };
 //421300",(U8 *)"随州市",
 const AREAnode HuB_suizh[2] = 
{
    (U8 *)"421303",(U8 *)"曾都区 (*)",NULL,0,
    (U8 *)"421381",(U8 *)"广水市",NULL,0,
  };
 //422800",(U8 *)"恩施土家族苗族自治州",
 const AREAnode HuB_ensht[8] = 
{
    (U8 *)"422801",(U8 *)"恩施市",NULL,0,
    (U8 *)"422802",(U8 *)"利川市",NULL,0,
    (U8 *)"422822",(U8 *)"建始县",NULL,0,
    (U8 *)"422823",(U8 *)"巴东县",NULL,0,
    (U8 *)"422825",(U8 *)"宣恩县",NULL,0,
    (U8 *)"422826",(U8 *)"咸丰县",NULL,0,
    (U8 *)"422827",(U8 *)"来凤县",NULL,0,
    (U8 *)"422828",(U8 *)"鹤峰县",NULL,0,
  };
 //429000",(U8 *)"省直辖县级行政区划",
 const AREAnode HuB_quh[4] = 
{
    (U8 *)"429004",(U8 *)"仙桃市",NULL,0,
    (U8 *)"429005",(U8 *)"潜江市",NULL,0,
    (U8 *)"429006",(U8 *)"天门市",NULL,0,
    (U8 *)"429021",(U8 *)"神农架林区",

  };

//--------------------430000",(U8 *)"湖南省",------------------------------
 //430100",(U8 *)"长沙市",
 const AREAnode HN_changs[9] = 
{
    (U8 *)"430102",(U8 *)"芙蓉区",NULL,0,
    (U8 *)"430103",(U8 *)"天心区",NULL,0,
    (U8 *)"430104",(U8 *)"岳麓区",NULL,0,
    (U8 *)"430105",(U8 *)"开福区",NULL,0,
    (U8 *)"430111",(U8 *)"雨花区",NULL,0,
    (U8 *)"430121",(U8 *)"长沙县",NULL,0,
    (U8 *)"430122",(U8 *)"望城县",NULL,0,
    (U8 *)"430124",(U8 *)"宁乡县",NULL,0,
    (U8 *)"430181",(U8 *)"浏阳市",NULL,0,
  };
 //430200",(U8 *)"株洲市",
 const AREAnode HN_zhuz[9] = 
{
    (U8 *)"430202",(U8 *)"荷塘区",NULL,0,
    (U8 *)"430203",(U8 *)"芦淞区",NULL,0,
    (U8 *)"430204",(U8 *)"石峰区",NULL,0,
    (U8 *)"430211",(U8 *)"天元区",NULL,0,
    (U8 *)"430221",(U8 *)"株洲县",NULL,0,
    (U8 *)"430223",(U8 *)"攸　县",NULL,0,
    (U8 *)"430224",(U8 *)"茶陵县",NULL,0,
    (U8 *)"430225",(U8 *)"炎陵县",NULL,0,
    (U8 *)"430281",(U8 *)"醴陵市",NULL,0,
  };
 //430300",(U8 *)"湘潭市",
 const AREAnode HN_xiangt[5] = 
{
    (U8 *)"430302",(U8 *)"雨湖区",NULL,0,
    (U8 *)"430304",(U8 *)"岳塘区",NULL,0,
    (U8 *)"430321",(U8 *)"湘潭县",NULL,0,
    (U8 *)"430381",(U8 *)"湘乡市",NULL,0,
    (U8 *)"430382",(U8 *)"韶山市",NULL,0,
  };
 //430400",(U8 *)"衡阳市",
 const AREAnode HN_hengy[12] = 
{
    (U8 *)"430405",(U8 *)"珠晖区",NULL,0,
    (U8 *)"430406",(U8 *)"雁峰区",NULL,0,
    (U8 *)"430407",(U8 *)"石鼓区",NULL,0,
    (U8 *)"430408",(U8 *)"蒸湘区",NULL,0,
    (U8 *)"430412",(U8 *)"南岳区",NULL,0,
    (U8 *)"430421",(U8 *)"衡阳县",NULL,0,
    (U8 *)"430422",(U8 *)"衡南县",NULL,0,
    (U8 *)"430423",(U8 *)"衡山县",NULL,0,
    (U8 *)"430424",(U8 *)"衡东县",NULL,0,
    (U8 *)"430426",(U8 *)"祁东县",NULL,0,
    (U8 *)"430481",(U8 *)"耒阳市",NULL,0,
    (U8 *)"430482",(U8 *)"常宁市",NULL,0,
  };
 //430500",(U8 *)"邵阳市",
 const AREAnode HN_shaoy[12] = 
{
    (U8 *)"430502",(U8 *)"双清区",NULL,0,
    (U8 *)"430503",(U8 *)"大祥区",NULL,0,
    (U8 *)"430511",(U8 *)"北塔区",NULL,0,
    (U8 *)"430521",(U8 *)"邵东县",NULL,0,
    (U8 *)"430522",(U8 *)"新邵县",NULL,0,
    (U8 *)"430523",(U8 *)"邵阳县",NULL,0,
    (U8 *)"430524",(U8 *)"隆回县",NULL,0,
    (U8 *)"430525",(U8 *)"洞口县",NULL,0,
    (U8 *)"430527",(U8 *)"绥宁县",NULL,0,
    (U8 *)"430528",(U8 *)"新宁县",NULL,0,
    (U8 *)"430529",(U8 *)"城步苗族自治县",NULL,0,
    (U8 *)"430581",(U8 *)"武冈市",NULL,0,
  };
 //430600",(U8 *)"岳阳市",
 const AREAnode HN_yuey[9] = 
{
    (U8 *)"430602",(U8 *)"岳阳楼区",NULL,0,
    (U8 *)"430603",(U8 *)"云溪区",NULL,0,
    (U8 *)"430611",(U8 *)"君山区",NULL,0,
    (U8 *)"430621",(U8 *)"岳阳县",NULL,0,
    (U8 *)"430623",(U8 *)"华容县",NULL,0,
    (U8 *)"430624",(U8 *)"湘阴县",NULL,0,
    (U8 *)"430626",(U8 *)"平江县",NULL,0,
    (U8 *)"430681",(U8 *)"汨罗市",NULL,0,
    (U8 *)"430682",(U8 *)"临湘市",NULL,0,
  };
 //430700",(U8 *)"常德市",
 const AREAnode HN_changd[9] = 
{
    (U8 *)"430702",(U8 *)"武陵区",NULL,0,
    (U8 *)"430703",(U8 *)"鼎城区",NULL,0,
    (U8 *)"430721",(U8 *)"安乡县",NULL,0,
    (U8 *)"430722",(U8 *)"汉寿县",NULL,0,
    (U8 *)"430723",(U8 *)"澧　县",NULL,0,
    (U8 *)"430724",(U8 *)"临澧县",NULL,0,
    (U8 *)"430725",(U8 *)"桃源县",NULL,0,
    (U8 *)"430726",(U8 *)"石门县",NULL,0,
    (U8 *)"430781",(U8 *)"津市市",NULL,0,
  };
 //430800",(U8 *)"张家界市",
 const AREAnode HN_zhangjj[4] = 
{
    (U8 *)"430802",(U8 *)"永定区",NULL,0,
    (U8 *)"430811",(U8 *)"武陵源区",NULL,0,
    (U8 *)"430821",(U8 *)"慈利县",NULL,0,
    (U8 *)"430822",(U8 *)"桑植县",NULL,0,
  };
 //430900",(U8 *)"益阳市",
 const AREAnode HN_yiy[6] = 
{
    (U8 *)"430902",(U8 *)"资阳区",NULL,0,
    (U8 *)"430903",(U8 *)"赫山区",NULL,0,
    (U8 *)"430921",(U8 *)"南　县",NULL,0,
    (U8 *)"430922",(U8 *)"桃江县",NULL,0,
    (U8 *)"430923",(U8 *)"安化县",NULL,0,
    (U8 *)"430981",(U8 *)"沅江市",NULL,0,
  };
 //431000",(U8 *)"郴州市",
 const AREAnode HN_chenz[11] = 
{
    (U8 *)"431002",(U8 *)"北湖区",NULL,0,
    (U8 *)"431003",(U8 *)"苏仙区",NULL,0,
    (U8 *)"431021",(U8 *)"桂阳县",NULL,0,
    (U8 *)"431022",(U8 *)"宜章县",NULL,0,
    (U8 *)"431023",(U8 *)"永兴县",NULL,0,
    (U8 *)"431024",(U8 *)"嘉禾县",NULL,0,
    (U8 *)"431025",(U8 *)"临武县",NULL,0,
    (U8 *)"431026",(U8 *)"汝城县",NULL,0,
    (U8 *)"431027",(U8 *)"桂东县",NULL,0,
    (U8 *)"431028",(U8 *)"安仁县",NULL,0,
    (U8 *)"431081",(U8 *)"资兴市",NULL,0,
  };
 //431100",(U8 *)"永州市",
 const AREAnode HN_yongz[11] = 
{
    (U8 *)"431102",(U8 *)"零陵区",NULL,0,
    (U8 *)"431103",(U8 *)"冷水滩区",NULL,0,
    (U8 *)"431121",(U8 *)"祁阳县",NULL,0,
    (U8 *)"431122",(U8 *)"东安县",NULL,0,
    (U8 *)"431123",(U8 *)"双牌县",NULL,0,
    (U8 *)"431124",(U8 *)"道　县",NULL,0,
    (U8 *)"431125",(U8 *)"江永县",NULL,0,
    (U8 *)"431126",(U8 *)"宁远县",NULL,0,
    (U8 *)"431127",(U8 *)"蓝山县",NULL,0,
    (U8 *)"431128",(U8 *)"新田县",NULL,0,
    (U8 *)"431129",(U8 *)"江华瑶族自治县",NULL,0,
  };
 //431200",(U8 *)"怀化市",
 const AREAnode HN_huaih[12] = 
{
    (U8 *)"431202",(U8 *)"鹤城区",NULL,0,
    (U8 *)"431221",(U8 *)"中方县",NULL,0,
    (U8 *)"431222",(U8 *)"沅陵县",NULL,0,
    (U8 *)"431223",(U8 *)"辰溪县",NULL,0,
    (U8 *)"431224",(U8 *)"溆浦县",NULL,0,
    (U8 *)"431225",(U8 *)"会同县",NULL,0,
    (U8 *)"431226",(U8 *)"麻阳苗族自治县",NULL,0,
    (U8 *)"431227",(U8 *)"新晃侗族自治县",NULL,0,
    (U8 *)"431228",(U8 *)"芷江侗族自治县",NULL,0,
    (U8 *)"431229",(U8 *)"靖州苗族侗族自治县",NULL,0,
    (U8 *)"431230",(U8 *)"通道侗族自治县",NULL,0,
    (U8 *)"431281",(U8 *)"洪江市",NULL,0,
  };
 //431300",(U8 *)"娄底市",
 const AREAnode HN_loud[5] = 
{
    (U8 *)"431302",(U8 *)"娄星区",NULL,0,
    (U8 *)"431321",(U8 *)"双峰县",NULL,0,
    (U8 *)"431322",(U8 *)"新化县",NULL,0,
    (U8 *)"431381",(U8 *)"冷水江市",NULL,0,
    (U8 *)"431382",(U8 *)"涟源市",NULL,0,
  };
 //433100",(U8 *)"湘西土家族苗族自治州",
 const AREAnode HN_xiangxtj[8] = 
{
    (U8 *)"433101",(U8 *)"吉首市",NULL,0,
    (U8 *)"433122",(U8 *)"泸溪县",NULL,0,
    (U8 *)"433123",(U8 *)"凤凰县",NULL,0,
    (U8 *)"433124",(U8 *)"花垣县",NULL,0,
    (U8 *)"433125",(U8 *)"保靖县",NULL,0,
    (U8 *)"433126",(U8 *)"古丈县",NULL,0,
    (U8 *)"433127",(U8 *)"永顺县",NULL,0,
    (U8 *)"433130",(U8 *)"龙山县",

};
//------------------------------440000",(U8 *)"广东省",------------------------------
 //440100",(U8 *)"广州市",
 const AREAnode GD_guangz[12] = 
{
    (U8 *)"440103",(U8 *)"荔湾区",NULL,0,
    (U8 *)"440104",(U8 *)"越秀区",NULL,0,
    (U8 *)"440105",(U8 *)"海珠区",NULL,0,
    (U8 *)"440106",(U8 *)"天河区",NULL,0,
    (U8 *)"440111",(U8 *)"白云区",NULL,0,
    (U8 *)"440112",(U8 *)"黄埔区",NULL,0,
    (U8 *)"440113",(U8 *)"番禺区",NULL,0,
    (U8 *)"440114",(U8 *)"花都区",NULL,0,
    (U8 *)"440115",(U8 *)"南沙区",NULL,0,
    (U8 *)"440116",(U8 *)"萝岗区",NULL,0,
    (U8 *)"440183",(U8 *)"增城市",NULL,0,
    (U8 *)"440184",(U8 *)"从化市",NULL,0,
  };
 //440200",(U8 *)"韶关市",
 const AREAnode GD_shaog[10] = 
{
    (U8 *)"440203",(U8 *)"武江区",NULL,0,
    (U8 *)"440204",(U8 *)"浈江区",NULL,0,
    (U8 *)"440205",(U8 *)"曲江区",NULL,0,
    (U8 *)"440222",(U8 *)"始兴县",NULL,0,
    (U8 *)"440224",(U8 *)"仁化县",NULL,0,
    (U8 *)"440229",(U8 *)"翁源县",NULL,0,
    (U8 *)"440232",(U8 *)"乳源瑶族自治县",NULL,0,
    (U8 *)"440233",(U8 *)"新丰县",NULL,0,
    (U8 *)"440281",(U8 *)"乐昌市",NULL,0,
    (U8 *)"440282",(U8 *)"南雄市",NULL,0,
  };
 //440300",(U8 *)"深圳市",
 const AREAnode GD_shenz[6] = 
{
    (U8 *)"440303",(U8 *)"罗湖区",NULL,0,
    (U8 *)"440304",(U8 *)"福田区",NULL,0,
    (U8 *)"440305",(U8 *)"南山区",NULL,0,
    (U8 *)"440306",(U8 *)"宝安区",NULL,0,
    (U8 *)"440307",(U8 *)"龙岗区",NULL,0,
    (U8 *)"440308",(U8 *)"盐田区",NULL,0,
  };
 //440400",(U8 *)"珠海市",
 const AREAnode GD_zhuh[3] = 
{
    (U8 *)"440402",(U8 *)"香洲区",NULL,0,
    (U8 *)"440403",(U8 *)"斗门区",NULL,0,
    (U8 *)"440404",(U8 *)"金湾区",NULL,0,
  };
 //440500",(U8 *)"汕头市",
 const AREAnode GD_shant[7] = 
{
    (U8 *)"440507",(U8 *)"龙湖区",NULL,0,
    (U8 *)"440511",(U8 *)"金平区",NULL,0,
    (U8 *)"440512",(U8 *)"濠江区",NULL,0,
    (U8 *)"440513",(U8 *)"潮阳区",NULL,0,
    (U8 *)"440514",(U8 *)"潮南区",NULL,0,
    (U8 *)"440515",(U8 *)"澄海区",NULL,0,
    (U8 *)"440523",(U8 *)"南澳县",NULL,0,
  };
 //440600",(U8 *)"佛山市",
 const AREAnode GD_fos[5] = 
{
    (U8 *)"440604",(U8 *)"禅城区",NULL,0,
    (U8 *)"440605",(U8 *)"南海区",NULL,0,
    (U8 *)"440606",(U8 *)"顺德区",NULL,0,
    (U8 *)"440607",(U8 *)"三水区",NULL,0,
    (U8 *)"440608",(U8 *)"高明区",NULL,0,
  };
 //440700",(U8 *)"江门市",
 const AREAnode GD_jiangm[7] = 
{
    (U8 *)"440703",(U8 *)"蓬江区",NULL,0,
    (U8 *)"440704",(U8 *)"江海区",NULL,0,
    (U8 *)"440705",(U8 *)"新会区",NULL,0,
    (U8 *)"440781",(U8 *)"台山市",NULL,0,
    (U8 *)"440783",(U8 *)"开平市",NULL,0,
    (U8 *)"440784",(U8 *)"鹤山市",NULL,0,
    (U8 *)"440785",(U8 *)"恩平市",NULL,0,
  };
 //440800",(U8 *)"湛江市",
 const AREAnode GD_zhanj[9] = 
{
    (U8 *)"440802",(U8 *)"赤坎区",NULL,0,
    (U8 *)"440803",(U8 *)"霞山区",NULL,0,
    (U8 *)"440804",(U8 *)"坡头区",NULL,0,
    (U8 *)"440811",(U8 *)"麻章区",NULL,0,
    (U8 *)"440823",(U8 *)"遂溪县",NULL,0,
    (U8 *)"440825",(U8 *)"徐闻县",NULL,0,
    (U8 *)"440881",(U8 *)"廉江市",NULL,0,
    (U8 *)"440882",(U8 *)"雷州市",NULL,0,
    (U8 *)"440883",(U8 *)"吴川市",NULL,0,
  };
 //440900",(U8 *)"茂名市",
 const AREAnode GD_maom[6] = 
{
    (U8 *)"440902",(U8 *)"茂南区",NULL,0,
    (U8 *)"440903",(U8 *)"茂港区",NULL,0,
    (U8 *)"440923",(U8 *)"电白县",NULL,0,
    (U8 *)"440981",(U8 *)"高州市",NULL,0,
    (U8 *)"440982",(U8 *)"化州市",NULL,0,
    (U8 *)"440983",(U8 *)"信宜市",NULL,0,
  };
 //441200",(U8 *)"肇庆市",
 const AREAnode GD_zaoq[8] = 
{
    (U8 *)"441202",(U8 *)"端州区",NULL,0,
    (U8 *)"441203",(U8 *)"鼎湖区",NULL,0,
    (U8 *)"441223",(U8 *)"广宁县",NULL,0,
    (U8 *)"441224",(U8 *)"怀集县",NULL,0,
    (U8 *)"441225",(U8 *)"封开县",NULL,0,
    (U8 *)"441226",(U8 *)"德庆县",NULL,0,
    (U8 *)"441283",(U8 *)"高要市",NULL,0,
    (U8 *)"441284",(U8 *)"四会市",NULL,0,
  };
 //441300",(U8 *)"惠州市",
 const AREAnode GD_zhongz[5] = 
{
    (U8 *)"441302",(U8 *)"惠城区",NULL,0,
    (U8 *)"441303",(U8 *)"惠阳区",NULL,0,
    (U8 *)"441322",(U8 *)"博罗县",NULL,0,
    (U8 *)"441323",(U8 *)"惠东县",NULL,0,
    (U8 *)"441324",(U8 *)"龙门县",NULL,0,
  };
 //441400",(U8 *)"梅州市",
 const AREAnode GD_meiz[8] = 
{
    (U8 *)"441402",(U8 *)"梅江区",NULL,0,
    (U8 *)"441421",(U8 *)"梅　县",NULL,0,
    (U8 *)"441422",(U8 *)"大埔县",NULL,0,
    (U8 *)"441423",(U8 *)"丰顺县",NULL,0,
    (U8 *)"441424",(U8 *)"五华县",NULL,0,
    (U8 *)"441426",(U8 *)"平远县",NULL,0,
    (U8 *)"441427",(U8 *)"蕉岭县",NULL,0,
    (U8 *)"441481",(U8 *)"兴宁市",NULL,0,
  };
 //441500",(U8 *)"汕尾市",
 const AREAnode GD_shanw[4] = 
{
    (U8 *)"441502",(U8 *)"城　区",NULL,0,
    (U8 *)"441521",(U8 *)"海丰县",NULL,0,
    (U8 *)"441523",(U8 *)"陆河县",NULL,0,
    (U8 *)"441581",(U8 *)"陆丰市",NULL,0,
  };
 //441600",(U8 *)"河源市",
 const AREAnode GD_hey[6] = 
{
    (U8 *)"441602",(U8 *)"源城区",NULL,0,
    (U8 *)"441621",(U8 *)"紫金县",NULL,0,
    (U8 *)"441622",(U8 *)"龙川县",NULL,0,
    (U8 *)"441623",(U8 *)"连平县",NULL,0,
    (U8 *)"441624",(U8 *)"和平县",NULL,0,
    (U8 *)"441625",(U8 *)"东源县",NULL,0,
  };
 //441700",(U8 *)"阳江市",
 const AREAnode GD_yangj[4] = 
{
    (U8 *)"441702",(U8 *)"江城区",NULL,0,
    (U8 *)"441721",(U8 *)"阳西县",NULL,0,
    (U8 *)"441723",(U8 *)"阳东县",NULL,0,
    (U8 *)"441781",(U8 *)"阳春市",NULL,0,
  };
 //441800",(U8 *)"清远市",
 const AREAnode GD_qingy[8] = 
{
    (U8 *)"441802",(U8 *)"清城区",NULL,0,
    (U8 *)"441821",(U8 *)"佛冈县",NULL,0,
    (U8 *)"441823",(U8 *)"阳山县",NULL,0,
    (U8 *)"441825",(U8 *)"连山壮族瑶族自治县",NULL,0,
    (U8 *)"441826",(U8 *)"连南瑶族自治县",NULL,0,
    (U8 *)"441827",(U8 *)"清新县",NULL,0,
    (U8 *)"441881",(U8 *)"英德市",NULL,0,
    (U8 *)"441882",(U8 *)"连州市",NULL,0,
  };
 //441900",(U8 *)"东莞市",
 const AREAnode GD_dongw[1] = 
{
	(U8 *)" ",(U8 *)" ",
};
 //442000",(U8 *)"中山市",
 const AREAnode GD_zhongs[1] = 
{
	(U8 *)" ",(U8 *)" ",
};
 //445100",(U8 *)"潮州市",
 const AREAnode GD_chaoz[3] = 
{
    (U8 *)"445102",(U8 *)"湘桥区",NULL,0,
    (U8 *)"445121",(U8 *)"潮安县",NULL,0,
    (U8 *)"445122",(U8 *)"饶平县",NULL,0,
  };
 //445200",(U8 *)"揭阳市",
 const AREAnode GD_jiey[5] = 
{
    (U8 *)"445202",(U8 *)"榕城区",NULL,0,
    (U8 *)"445221",(U8 *)"揭东县",NULL,0,
    (U8 *)"445222",(U8 *)"揭西县",NULL,0,
    (U8 *)"445224",(U8 *)"惠来县",NULL,0,
    (U8 *)"445281",(U8 *)"普宁市",NULL,0,
  };
 //445300",(U8 *)"云浮市",
 const AREAnode GD_yunf[5] = 
{
    (U8 *)"445302",(U8 *)"云城区",NULL,0,
    (U8 *)"445321",(U8 *)"新兴县",NULL,0,
    (U8 *)"445322",(U8 *)"郁南县",NULL,0,
    (U8 *)"445323",(U8 *)"云安县",NULL,0,
    (U8 *)"445381",(U8 *)"罗定市",

  };
//----------------------------450000",(U8 *)"广西壮族自治区",-------------------------------
 //450100",(U8 *)"南宁市",
 const AREAnode GX_nann[12] = 
{
    (U8 *)"450102",(U8 *)"兴宁区",NULL,0,
    (U8 *)"450103",(U8 *)"青秀区",NULL,0,
    (U8 *)"450105",(U8 *)"江南区",NULL,0,
    (U8 *)"450107",(U8 *)"西乡塘区",NULL,0,
    (U8 *)"450108",(U8 *)"良庆区",NULL,0,
    (U8 *)"450109",(U8 *)"邕宁区",NULL,0,
    (U8 *)"450122",(U8 *)"武鸣县",NULL,0,
    (U8 *)"450123",(U8 *)"隆安县",NULL,0,
    (U8 *)"450124",(U8 *)"马山县",NULL,0,
    (U8 *)"450125",(U8 *)"上林县",NULL,0,
    (U8 *)"450126",(U8 *)"宾阳县",NULL,0,
    (U8 *)"450127",(U8 *)"横　县",NULL,0,
  };
 //450200",(U8 *)"柳州市",
 const AREAnode GX_liuz[10] = 
{
    (U8 *)"450202",(U8 *)"城中区",NULL,0,
    (U8 *)"450203",(U8 *)"鱼峰区",NULL,0,
    (U8 *)"450204",(U8 *)"柳南区",NULL,0,
    (U8 *)"450205",(U8 *)"柳北区",NULL,0,
    (U8 *)"450221",(U8 *)"柳江县",NULL,0,
    (U8 *)"450222",(U8 *)"柳城县",NULL,0,
    (U8 *)"450223",(U8 *)"鹿寨县",NULL,0,
    (U8 *)"450224",(U8 *)"融安县",NULL,0,
    (U8 *)"450225",(U8 *)"融水苗族自治县",NULL,0,
    (U8 *)"450226",(U8 *)"三江侗族自治县",NULL,0,
  };
 //450300",(U8 *)"桂林市",
 const AREAnode GX_guil[17] = 
{
    (U8 *)"450302",(U8 *)"秀峰区",NULL,0,
    (U8 *)"450303",(U8 *)"叠彩区",NULL,0,
    (U8 *)"450304",(U8 *)"象山区",NULL,0,
    (U8 *)"450305",(U8 *)"七星区",NULL,0,
    (U8 *)"450311",(U8 *)"雁山区",NULL,0,
    (U8 *)"450321",(U8 *)"阳朔县",NULL,0,
    (U8 *)"450322",(U8 *)"临桂县",NULL,0,
    (U8 *)"450323",(U8 *)"灵川县",NULL,0,
    (U8 *)"450324",(U8 *)"全州县",NULL,0,
    (U8 *)"450325",(U8 *)"兴安县",NULL,0,
    (U8 *)"450326",(U8 *)"永福县",NULL,0,
    (U8 *)"450327",(U8 *)"灌阳县",NULL,0,
    (U8 *)"450328",(U8 *)"龙胜各族自治县",NULL,0,
    (U8 *)"450329",(U8 *)"资源县",NULL,0,
    (U8 *)"450330",(U8 *)"平乐县",NULL,0,
    (U8 *)"450331",(U8 *)"荔蒲县",NULL,0,
    (U8 *)"450332",(U8 *)"恭城瑶族自治县",NULL,0,
  };
 //450400",(U8 *)"梧州市",
 const AREAnode GX_wuz[7] = 
{
    (U8 *)"450403",(U8 *)"万秀区",NULL,0,
    (U8 *)"450404",(U8 *)"蝶山区",NULL,0,
    (U8 *)"450405",(U8 *)"长洲区",NULL,0,
    (U8 *)"450421",(U8 *)"苍梧县",NULL,0,
    (U8 *)"450422",(U8 *)"藤　县",NULL,0,
    (U8 *)"450423",(U8 *)"蒙山县",NULL,0,
    (U8 *)"450481",(U8 *)"岑溪市",NULL,0,
  };
 //450500",(U8 *)"北海市",
 const AREAnode GX_beih[4] = 
{
    (U8 *)"450502",(U8 *)"海城区",NULL,0,
    (U8 *)"450503",(U8 *)"银海区",NULL,0,
    (U8 *)"450512",(U8 *)"铁山港区",NULL,0,
    (U8 *)"450521",(U8 *)"合浦县",NULL,0,
  };
 //450600",(U8 *)"防城港市",
 const AREAnode GX_fangcg[4] = 
{
    (U8 *)"450602",(U8 *)"港口区",NULL,0,
    (U8 *)"450603",(U8 *)"防城区",NULL,0,
    (U8 *)"450621",(U8 *)"上思县",NULL,0,
    (U8 *)"450681",(U8 *)"东兴市",NULL,0,
  };
 //450700",(U8 *)"钦州市",
 const AREAnode GX_qingz[4] = 
{
    (U8 *)"450702",(U8 *)"钦南区",NULL,0,
    (U8 *)"450703",(U8 *)"钦北区",NULL,0,
    (U8 *)"450721",(U8 *)"灵山县",NULL,0,
    (U8 *)"450722",(U8 *)"浦北县",NULL,0,
  };
 //450800",(U8 *)"贵港市",
 const AREAnode GX_guig[5] = 
{
    (U8 *)"450802",(U8 *)"港北区",NULL,0,
    (U8 *)"450803",(U8 *)"港南区",NULL,0,
    (U8 *)"450804",(U8 *)"覃塘区",NULL,0,
    (U8 *)"450821",(U8 *)"平南县",NULL,0,
    (U8 *)"450881",(U8 *)"桂平市",NULL,0,
  };
 //450900",(U8 *)"玉林市",
 const AREAnode GX_yul[6] = 
{
    (U8 *)"450902",(U8 *)"玉州区",NULL,0,
    (U8 *)"450921",(U8 *)"容　县",NULL,0,
    (U8 *)"450922",(U8 *)"陆川县",NULL,0,
    (U8 *)"450923",(U8 *)"博白县",NULL,0,
    (U8 *)"450924",(U8 *)"兴业县",NULL,0,
    (U8 *)"450981",(U8 *)"北流市",NULL,0,
  };
 //451000",(U8 *)"百色市",
 const AREAnode GX_bais[12] = 
{
    (U8 *)"451002",(U8 *)"右江区",NULL,0,
    (U8 *)"451021",(U8 *)"田阳县",NULL,0,
    (U8 *)"451022",(U8 *)"田东县",NULL,0,
    (U8 *)"451023",(U8 *)"平果县",NULL,0,
    (U8 *)"451024",(U8 *)"德保县",NULL,0,
    (U8 *)"451025",(U8 *)"靖西县",NULL,0,
    (U8 *)"451026",(U8 *)"那坡县",NULL,0,
    (U8 *)"451027",(U8 *)"凌云县",NULL,0,
    (U8 *)"451028",(U8 *)"乐业县",NULL,0,
    (U8 *)"451029",(U8 *)"田林县",NULL,0,
    (U8 *)"451030",(U8 *)"西林县",NULL,0,
    (U8 *)"451031",(U8 *)"隆林各族自治县",NULL,0,
  };
 //451100",(U8 *)"贺州市",
 const AREAnode GX_hez[4] = 
{
    (U8 *)"451102",(U8 *)"八步区",NULL,0,
    (U8 *)"451121",(U8 *)"昭平县",NULL,0,
    (U8 *)"451122",(U8 *)"钟山县",NULL,0,
    (U8 *)"451123",(U8 *)"富川瑶族自治县",NULL,0,
  };
 //451200",(U8 *)"河池市",
 const AREAnode GX_hec[11] = 
{
    (U8 *)"451202",(U8 *)"金城江区",NULL,0,
    (U8 *)"451221",(U8 *)"南丹县",NULL,0,
    (U8 *)"451222",(U8 *)"天峨县",NULL,0,
    (U8 *)"451223",(U8 *)"凤山县",NULL,0,
    (U8 *)"451224",(U8 *)"东兰县",NULL,0,
    (U8 *)"451225",(U8 *)"罗城仫佬族自治县",NULL,0,
    (U8 *)"451226",(U8 *)"环江毛南族自治县",NULL,0,
    (U8 *)"451227",(U8 *)"巴马瑶族自治县",NULL,0,
    (U8 *)"451228",(U8 *)"都安瑶族自治县",NULL,0,
    (U8 *)"451229",(U8 *)"大化瑶族自治县",NULL,0,
    (U8 *)"451281",(U8 *)"宜州市",NULL,0,
  };
 //451300",(U8 *)"来宾市",
 const AREAnode GX_laib[6] = 
{
    (U8 *)"451302",(U8 *)"兴宾区",NULL,0,
    (U8 *)"451321",(U8 *)"忻城县",NULL,0,
    (U8 *)"451322",(U8 *)"象州县",NULL,0,
    (U8 *)"451323",(U8 *)"武宣县",NULL,0,
    (U8 *)"451324",(U8 *)"金秀瑶族自治县",NULL,0,
    (U8 *)"451381",(U8 *)"合山市",NULL,0,
  };
 //451400",(U8 *)"崇左市",
 const AREAnode GX_songz[7] = 
{
    (U8 *)"451402",(U8 *)"江洲区",NULL,0,
    (U8 *)"451421",(U8 *)"扶绥县",NULL,0,
    (U8 *)"451422",(U8 *)"宁明县",NULL,0,
    (U8 *)"451423",(U8 *)"龙州县",NULL,0,
    (U8 *)"451424",(U8 *)"大新县",NULL,0,
    (U8 *)"451425",(U8 *)"天等县",NULL,0,
    (U8 *)"451481",(U8 *)"凭祥市",

  };
//----------------------------------460000",(U8 *)"海南省",------------------------------
 //460100",(U8 *)"海口市",
 const AREAnode HN_haik[4] = 
{
    (U8 *)"460105",(U8 *)"秀英区",NULL,0,
    (U8 *)"460106",(U8 *)"龙华区",NULL,0,
    (U8 *)"460107",(U8 *)"琼山区",NULL,0,
    (U8 *)"460108",(U8 *)"美兰区",NULL,0,
  };
 //460200",(U8 *)"三亚市",
 const AREAnode HN_sany[1] = 
{
	(U8 *)" ",(U8 *)" "
};



 //469000",(U8 *)"省直辖县级行政区划",
 const AREAnode HN_xingz[19] = 
{
    (U8 *)"469001",(U8 *)"五指山市",NULL,0,
    (U8 *)"469002",(U8 *)"琼海市",NULL,0,
    (U8 *)"469003",(U8 *)"儋州市",NULL,0,
    (U8 *)"469005",(U8 *)"文昌市",NULL,0,
    (U8 *)"469006",(U8 *)"万宁市",NULL,0,
    (U8 *)"469007",(U8 *)"东方市",NULL,0,
    (U8 *)"469021",(U8 *)"定安县",NULL,0,
    (U8 *)"469022",(U8 *)"屯昌县",NULL,0,
    (U8 *)"469023",(U8 *)"澄迈县",NULL,0,
    (U8 *)"469024",(U8 *)"临高县",NULL,0,
    (U8 *)"469025",(U8 *)"白沙黎族自治县",NULL,0,
    (U8 *)"469026",(U8 *)"昌江黎族自治县",NULL,0,
    (U8 *)"469027",(U8 *)"乐东黎族自治县",NULL,0,
    (U8 *)"469028",(U8 *)"陵水黎族自治县",NULL,0,
    (U8 *)"469029",(U8 *)"保亭黎族苗族自治县",NULL,0,
    (U8 *)"469030",(U8 *)"琼中黎族苗族自治县",NULL,0,
    (U8 *)"469031",(U8 *)"西沙群岛",NULL,0,
    (U8 *)"469032",(U8 *)"南沙群岛",NULL,0,
    (U8 *)"469033",(U8 *)"中沙群岛的岛礁及其海域"
};

//500000",(U8 *)"重庆市",
    
//510000",(U8 *)"四川省",

 //510100",(U8 *)"成都市",
 const AREAnode SC_chengd[19] = 
{
    (U8 *)"510104",(U8 *)"锦江区",NULL,0,
    (U8 *)"510105",(U8 *)"青羊区",NULL,0,
    (U8 *)"510106",(U8 *)"金牛区",NULL,0,
    (U8 *)"510107",(U8 *)"武侯区",NULL,0,
    (U8 *)"510108",(U8 *)"成华区",NULL,0,
    (U8 *)"510112",(U8 *)"龙泉驿区",NULL,0,
    (U8 *)"510113",(U8 *)"青白江区",NULL,0,
    (U8 *)"510114",(U8 *)"新都区",NULL,0,
    (U8 *)"510115",(U8 *)"温江区",NULL,0,
    (U8 *)"510121",(U8 *)"金堂县",NULL,0,
    (U8 *)"510122",(U8 *)"双流县",NULL,0,
    (U8 *)"510124",(U8 *)"郫　县",NULL,0,
    (U8 *)"510129",(U8 *)"大邑县",NULL,0,
    (U8 *)"510131",(U8 *)"蒲江县",NULL,0,
    (U8 *)"510132",(U8 *)"新津县",NULL,0,
    (U8 *)"510181",(U8 *)"都江堰市",NULL,0,
    (U8 *)"510182",(U8 *)"彭州市",NULL,0,
    (U8 *)"510183",(U8 *)"邛崃市",NULL,0,
    (U8 *)"510184",(U8 *)"崇州市",NULL,0,
  };
 //510300",(U8 *)"自贡市",
 const AREAnode SC_zig[6] = 
{
    (U8 *)"510302",(U8 *)"自流井区",NULL,0,
    (U8 *)"510303",(U8 *)"贡井区",NULL,0,
    (U8 *)"510304",(U8 *)"大安区",NULL,0,
    (U8 *)"510311",(U8 *)"沿滩区",NULL,0,
    (U8 *)"510321",(U8 *)"荣　县",NULL,0,
    (U8 *)"510322",(U8 *)"富顺县",NULL,0,
  };
 //510400",(U8 *)"攀枝花市",
 const AREAnode SC_panzh[5] = 
{
    (U8 *)"510402",(U8 *)"东　区",NULL,0,
    (U8 *)"510403",(U8 *)"西　区",NULL,0,
    (U8 *)"510411",(U8 *)"仁和区",NULL,0,
    (U8 *)"510421",(U8 *)"米易县",NULL,0,
    (U8 *)"510422",(U8 *)"盐边县",NULL,0,
  };
 //510500",(U8 *)"泸州市",
 const AREAnode SC_luz[7] = 
{
    (U8 *)"510502",(U8 *)"江阳区",NULL,0,
    (U8 *)"510503",(U8 *)"纳溪区",NULL,0,
    (U8 *)"510504",(U8 *)"龙马潭区",NULL,0,
    (U8 *)"510521",(U8 *)"泸　县",NULL,0,
    (U8 *)"510522",(U8 *)"合江县",NULL,0,
    (U8 *)"510524",(U8 *)"叙永县",NULL,0,
    (U8 *)"510525",(U8 *)"古蔺县",NULL,0,
  };
 //510600",(U8 *)"德阳市",
 const AREAnode SC_dey[6] = 
{
    (U8 *)"510603",(U8 *)"旌阳区",NULL,0,
    (U8 *)"510623",(U8 *)"中江县",NULL,0,
    (U8 *)"510626",(U8 *)"罗江县",NULL,0,
    (U8 *)"510681",(U8 *)"广汉市",NULL,0,
    (U8 *)"510682",(U8 *)"什邡市",NULL,0,
    (U8 *)"510683",(U8 *)"绵竹市",NULL,0,
  };
 //510700",(U8 *)"绵阳市",
 const AREAnode SC_miany[9] = 
{
    (U8 *)"510703",(U8 *)"涪城区",NULL,0,
    (U8 *)"510704",(U8 *)"游仙区",NULL,0,
    (U8 *)"510722",(U8 *)"三台县",NULL,0,
    (U8 *)"510723",(U8 *)"盐亭县",NULL,0,
    (U8 *)"510724",(U8 *)"安　县",NULL,0,
    (U8 *)"510725",(U8 *)"梓潼县",NULL,0,
    (U8 *)"510726",(U8 *)"北川羌族自治县",NULL,0,
    (U8 *)"510727",(U8 *)"平武县",NULL,0,
    (U8 *)"510781",(U8 *)"江油市",NULL,0,
  };
 //510800",(U8 *)"广元市",
 const AREAnode SC_guangy[7] = 
{
    (U8 *)"510802",(U8 *)"利州区",NULL,0,
    (U8 *)"510811",(U8 *)"元坝区",NULL,0,
    (U8 *)"510812",(U8 *)"朝天区",NULL,0,
    (U8 *)"510821",(U8 *)"旺苍县",NULL,0,
    (U8 *)"510822",(U8 *)"青川县",NULL,0,
    (U8 *)"510823",(U8 *)"剑阁县",NULL,0,
    (U8 *)"510824",(U8 *)"苍溪县",NULL,0,
  };
 //510900",(U8 *)"遂宁市",
 const AREAnode SC_suin[5] = 
{
    (U8 *)"510903",(U8 *)"船山区",NULL,0,
    (U8 *)"510904",(U8 *)"安居区",NULL,0,
    (U8 *)"510921",(U8 *)"蓬溪县",NULL,0,
    (U8 *)"510922",(U8 *)"射洪县",NULL,0,
    (U8 *)"510923",(U8 *)"大英县",NULL,0,
  };
 //511000",(U8 *)"内江市",
 const AREAnode SC_neij[5] = 
{
    (U8 *)"511002",(U8 *)"市中区",NULL,0,
    (U8 *)"511011",(U8 *)"东兴区",NULL,0,
    (U8 *)"511024",(U8 *)"威远县",NULL,0,
    (U8 *)"511025",(U8 *)"资中县",NULL,0,
    (U8 *)"511028",(U8 *)"隆昌县",NULL,0,
  };
 //511100",(U8 *)"乐山市",
 const AREAnode SC_les[11] = 
{
    (U8 *)"511102",(U8 *)"市中区",NULL,0,
    (U8 *)"511111",(U8 *)"沙湾区",NULL,0,
    (U8 *)"511112",(U8 *)"五通桥区",NULL,0,
    (U8 *)"511113",(U8 *)"金口河区",NULL,0,
    (U8 *)"511123",(U8 *)"犍为县",NULL,0,
    (U8 *)"511124",(U8 *)"井研县",NULL,0,
    (U8 *)"511126",(U8 *)"夹江县",NULL,0,
    (U8 *)"511129",(U8 *)"沐川县",NULL,0,
    (U8 *)"511132",(U8 *)"峨边彝族自治县",NULL,0,
    (U8 *)"511133",(U8 *)"马边彝族自治县",NULL,0,
    (U8 *)"511181",(U8 *)"峨眉山市",NULL,0,
  };
 //511300",(U8 *)"南充市",
 const AREAnode SC_nany[9] = 
{
    (U8 *)"511302",(U8 *)"顺庆区",NULL,0,
    (U8 *)"511303",(U8 *)"高坪区",NULL,0,
    (U8 *)"511304",(U8 *)"嘉陵区",NULL,0,
    (U8 *)"511321",(U8 *)"南部县",NULL,0,
    (U8 *)"511322",(U8 *)"营山县",NULL,0,
    (U8 *)"511323",(U8 *)"蓬安县",NULL,0,
    (U8 *)"511324",(U8 *)"仪陇县",NULL,0,
    (U8 *)"511325",(U8 *)"西充县",NULL,0,
    (U8 *)"511381",(U8 *)"阆中市",NULL,0,
  };
 //511400",(U8 *)"眉山市",
 const AREAnode SC_meis[6] = 
{
    (U8 *)"511402",(U8 *)"东坡区",NULL,0,
    (U8 *)"511421",(U8 *)"仁寿县",NULL,0,
    (U8 *)"511422",(U8 *)"彭山县",NULL,0,
    (U8 *)"511423",(U8 *)"洪雅县",NULL,0,
    (U8 *)"511424",(U8 *)"丹棱县",NULL,0,
    (U8 *)"511425",(U8 *)"青神县",NULL,0,
  };
 //511500",(U8 *)"宜宾市",
 const AREAnode SC_yib[10] = 
{
    (U8 *)"511502",(U8 *)"翠屏区",NULL,0,
    (U8 *)"511521",(U8 *)"宜宾县",NULL,0,
    (U8 *)"511522",(U8 *)"南溪县",NULL,0,
    (U8 *)"511523",(U8 *)"江安县",NULL,0,
    (U8 *)"511524",(U8 *)"长宁县",NULL,0,
    (U8 *)"511525",(U8 *)"高　县",NULL,0,
    (U8 *)"511526",(U8 *)"珙　县",NULL,0,
    (U8 *)"511527",(U8 *)"筠连县",NULL,0,
    (U8 *)"511528",(U8 *)"兴文县",NULL,0,
    (U8 *)"511529",(U8 *)"屏山县",NULL,0,
  };
 //511600",(U8 *)"广安市",
 const AREAnode SC_guanga[5] = 
{
    (U8 *)"511602",(U8 *)"广安区",NULL,0,
    (U8 *)"511621",(U8 *)"岳池县",NULL,0,
    (U8 *)"511622",(U8 *)"武胜县",NULL,0,
    (U8 *)"511623",(U8 *)"邻水县",NULL,0,
    (U8 *)"511681",(U8 *)"华蓥市",NULL,0,
  };
 //511700",(U8 *)"达州市",
 const AREAnode SC_daz[7] = 
{
    (U8 *)"511702",(U8 *)"通川区",NULL,0,
    (U8 *)"511721",(U8 *)"达　县",NULL,0,
    (U8 *)"511722",(U8 *)"宣汉县",NULL,0,
    (U8 *)"511723",(U8 *)"开江县",NULL,0,
    (U8 *)"511724",(U8 *)"大竹县",NULL,0,
    (U8 *)"511725",(U8 *)"渠　县",NULL,0,
    (U8 *)"511781",(U8 *)"万源市",NULL,0,
  };
 //511800",(U8 *)"雅安市",
 const AREAnode SC_yaa[8] = 
{
    (U8 *)"511802",(U8 *)"雨城区",NULL,0,
    (U8 *)"511821",(U8 *)"名山县",NULL,0,
    (U8 *)"511822",(U8 *)"荥经县",NULL,0,
    (U8 *)"511823",(U8 *)"汉源县",NULL,0,
    (U8 *)"511824",(U8 *)"石棉县",NULL,0,
    (U8 *)"511825",(U8 *)"天全县",NULL,0,
    (U8 *)"511826",(U8 *)"芦山县",NULL,0,
    (U8 *)"511827",(U8 *)"宝兴县",NULL,0,
  };
 //511900",(U8 *)"巴中市",
 const AREAnode SC_baz[4] = 
{
    (U8 *)"511902",(U8 *)"巴州区",NULL,0,
    (U8 *)"511921",(U8 *)"通江县",NULL,0,
    (U8 *)"511922",(U8 *)"南江县",NULL,0,
    (U8 *)"511923",(U8 *)"平昌县",NULL,0,
  };
 //512000",(U8 *)"资阳市",
 const AREAnode SC_ziy[4] = 
{
    (U8 *)"512002",(U8 *)"雁江区",NULL,0,
    (U8 *)"512021",(U8 *)"安岳县",NULL,0,
    (U8 *)"512022",(U8 *)"乐至县",NULL,0,
    (U8 *)"512081",(U8 *)"简阳市",NULL,0,
  };
 //513200",(U8 *)"阿坝藏族羌族自治州",
 const AREAnode SC_abz[13] = 
{
    (U8 *)"513221",(U8 *)"汶川县",NULL,0,
    (U8 *)"513222",(U8 *)"理　县",NULL,0,
    (U8 *)"513223",(U8 *)"茂　县",NULL,0,
    (U8 *)"513224",(U8 *)"松潘县",NULL,0,
    (U8 *)"513225",(U8 *)"九寨沟县",NULL,0,
    (U8 *)"513226",(U8 *)"金川县",NULL,0,
    (U8 *)"513227",(U8 *)"小金县",NULL,0,
    (U8 *)"513228",(U8 *)"黑水县",NULL,0,
    (U8 *)"513229",(U8 *)"马尔康县",NULL,0,
    (U8 *)"513230",(U8 *)"壤塘县",NULL,0,
    (U8 *)"513231",(U8 *)"阿坝县",NULL,0,
    (U8 *)"513232",(U8 *)"若尔盖县",NULL,0,
    (U8 *)"513233",(U8 *)"红原县",NULL,0,
  };
 //513300",(U8 *)"甘孜藏族自治州",
 const AREAnode SC_gzz[18] = 
{
    (U8 *)"513321",(U8 *)"康定县",NULL,0,
    (U8 *)"513322",(U8 *)"泸定县",NULL,0,
    (U8 *)"513323",(U8 *)"丹巴县",NULL,0,
    (U8 *)"513324",(U8 *)"九龙县",NULL,0,
    (U8 *)"513325",(U8 *)"雅江县",NULL,0,
    (U8 *)"513326",(U8 *)"道孚县",NULL,0,
    (U8 *)"513327",(U8 *)"炉霍县",NULL,0,
    (U8 *)"513328",(U8 *)"甘孜县",NULL,0,
    (U8 *)"513329",(U8 *)"新龙县",NULL,0,
    (U8 *)"513330",(U8 *)"德格县",NULL,0,
    (U8 *)"513331",(U8 *)"白玉县",NULL,0,
    (U8 *)"513332",(U8 *)"石渠县",NULL,0,
    (U8 *)"513333",(U8 *)"色达县",NULL,0,
    (U8 *)"513334",(U8 *)"理塘县",NULL,0,
    (U8 *)"513335",(U8 *)"巴塘县",NULL,0,
    (U8 *)"513336",(U8 *)"乡城县",NULL,0,
    (U8 *)"513337",(U8 *)"稻城县",NULL,0,
    (U8 *)"513338",(U8 *)"得荣县",NULL,0,
  };
 //513400",(U8 *)"凉山彝族自治州",
 const AREAnode SC_liangs[17] = 
{
    (U8 *)"513401",(U8 *)"西昌市",NULL,0,
    (U8 *)"513422",(U8 *)"木里藏族自治县",NULL,0,
    (U8 *)"513423",(U8 *)"盐源县",NULL,0,
    (U8 *)"513424",(U8 *)"德昌县",NULL,0,
    (U8 *)"513425",(U8 *)"会理县",NULL,0,
    (U8 *)"513426",(U8 *)"会东县",NULL,0,
    (U8 *)"513427",(U8 *)"宁南县",NULL,0,
    (U8 *)"513428",(U8 *)"普格县",NULL,0,
    (U8 *)"513429",(U8 *)"布拖县",NULL,0,
    (U8 *)"513430",(U8 *)"金阳县",NULL,0,
    (U8 *)"513431",(U8 *)"昭觉县",NULL,0,
    (U8 *)"513432",(U8 *)"喜德县",NULL,0,
    (U8 *)"513433",(U8 *)"冕宁县",NULL,0,
    (U8 *)"513434",(U8 *)"越西县",NULL,0,
    (U8 *)"513435",(U8 *)"甘洛县",NULL,0,
    (U8 *)"513436",(U8 *)"美姑县",NULL,0,
    (U8 *)"513437",(U8 *)"雷波县",

  };
 //----------------------------520000",(U8 *)"贵州省",--------------------------
 //520100",(U8 *)"贵阳市",
 const AREAnode GZ_guiy[10] = 
{
    (U8 *)"520102",(U8 *)"南明区",NULL,0,
    (U8 *)"520103",(U8 *)"云岩区",NULL,0,
    (U8 *)"520111",(U8 *)"花溪区",NULL,0,
    (U8 *)"520112",(U8 *)"乌当区",NULL,0,
    (U8 *)"520113",(U8 *)"白云区",NULL,0,
    (U8 *)"520114",(U8 *)"小河区",NULL,0,
    (U8 *)"520121",(U8 *)"开阳县",NULL,0,
    (U8 *)"520122",(U8 *)"息烽县",NULL,0,
    (U8 *)"520123",(U8 *)"修文县",NULL,0,
    (U8 *)"520181",(U8 *)"清镇市",NULL,0,
  };
 //520200",(U8 *)"六盘水市",
 const AREAnode GZ_liups[4] = 
{
    (U8 *)"520201",(U8 *)"钟山区",NULL,0,
    (U8 *)"520203",(U8 *)"六枝特区",NULL,0,
    (U8 *)"520221",(U8 *)"水城县",NULL,0,
    (U8 *)"520222",(U8 *)"盘　县",NULL,0,
  };
 //520300",(U8 *)"遵义市",
 const AREAnode GZ_zuny[14] = 
{
    (U8 *)"520302",(U8 *)"红花岗区",NULL,0,
    (U8 *)"520303",(U8 *)"汇川区",NULL,0,
    (U8 *)"520321",(U8 *)"遵义县",NULL,0,
    (U8 *)"520322",(U8 *)"桐梓县",NULL,0,
    (U8 *)"520323",(U8 *)"绥阳县",NULL,0,
    (U8 *)"520324",(U8 *)"正安县",NULL,0,
    (U8 *)"520325",(U8 *)"道真仡佬族苗族自治县",NULL,0,
    (U8 *)"520326",(U8 *)"务川仡佬族苗族自治县",NULL,0,
    (U8 *)"520327",(U8 *)"凤冈县",NULL,0,
    (U8 *)"520328",(U8 *)"湄潭县",NULL,0,
    (U8 *)"520329",(U8 *)"余庆县",NULL,0,
    (U8 *)"520330",(U8 *)"习水县",NULL,0,
    (U8 *)"520381",(U8 *)"赤水市",NULL,0,
    (U8 *)"520382",(U8 *)"仁怀市",NULL,0,
  };
 //520400",(U8 *)"安顺市",
 const AREAnode GZ_ans[6] = 
{
    (U8 *)"520402",(U8 *)"西秀区",NULL,0,
    (U8 *)"520421",(U8 *)"平坝县",NULL,0,
    (U8 *)"520422",(U8 *)"普定县",NULL,0,
    (U8 *)"520423",(U8 *)"镇宁布依族苗族自治县",NULL,0,
    (U8 *)"520424",(U8 *)"关岭布依族苗族自治县",NULL,0,
    (U8 *)"520425",(U8 *)"紫云苗族布依族自治县",NULL,0,
  };
 //522200",(U8 *)"铜仁地区",
 const AREAnode GZ_tongr[10] = 
{
    (U8 *)"522201",(U8 *)"铜仁市",NULL,0,
    (U8 *)"522222",(U8 *)"江口县",NULL,0,
    (U8 *)"522223",(U8 *)"玉屏侗族自治县",NULL,0,
    (U8 *)"522224",(U8 *)"石阡县",NULL,0,
    (U8 *)"522225",(U8 *)"思南县",NULL,0,
    (U8 *)"522226",(U8 *)"印江土家族苗族自治县",NULL,0,
    (U8 *)"522227",(U8 *)"德江县",NULL,0,
    (U8 *)"522228",(U8 *)"沿河土家族自治县",NULL,0,
    (U8 *)"522229",(U8 *)"松桃苗族自治县",NULL,0,
    (U8 *)"522230",(U8 *)"万山特区",NULL,0,
  };
 //522300",(U8 *)"黔西南布依族苗族自治州",
 const AREAnode GZ_qianxn[8] = 
{
    (U8 *)"522301",(U8 *)"兴义市",NULL,0,
    (U8 *)"522322",(U8 *)"兴仁县",NULL,0,
    (U8 *)"522323",(U8 *)"普安县",NULL,0,
    (U8 *)"522324",(U8 *)"晴隆县",NULL,0,
    (U8 *)"522325",(U8 *)"贞丰县",NULL,0,
    (U8 *)"522326",(U8 *)"望谟县",NULL,0,
    (U8 *)"522327",(U8 *)"册亨县",NULL,0,
    (U8 *)"522328",(U8 *)"安龙县",NULL,0,
  };
 //522400",(U8 *)"毕节地区",
 const AREAnode GZ_bij[8] = 
{
    (U8 *)"522401",(U8 *)"毕节市",NULL,0,
    (U8 *)"522422",(U8 *)"大方县",NULL,0,
    (U8 *)"522423",(U8 *)"黔西县",NULL,0,
    (U8 *)"522424",(U8 *)"金沙县",NULL,0,
    (U8 *)"522425",(U8 *)"织金县",NULL,0,
    (U8 *)"522426",(U8 *)"纳雍县",NULL,0,
    (U8 *)"522427",(U8 *)"威宁彝族回族苗族自治县",NULL,0,
    (U8 *)"522428",(U8 *)"赫章县",NULL,0,
  };
 //522600",(U8 *)"黔东南苗族侗族自治州",
 const AREAnode GZ_qiandn[16] = 
{
    (U8 *)"522601",(U8 *)"凯里市",NULL,0,
    (U8 *)"522622",(U8 *)"黄平县",NULL,0,
    (U8 *)"522623",(U8 *)"施秉县",NULL,0,
    (U8 *)"522624",(U8 *)"三穗县",NULL,0,
    (U8 *)"522625",(U8 *)"镇远县",NULL,0,
    (U8 *)"522626",(U8 *)"岑巩县",NULL,0,
    (U8 *)"522627",(U8 *)"天柱县",NULL,0,
    (U8 *)"522628",(U8 *)"锦屏县",NULL,0,
    (U8 *)"522629",(U8 *)"剑河县",NULL,0,
    (U8 *)"522630",(U8 *)"台江县",NULL,0,
    (U8 *)"522631",(U8 *)"黎平县",NULL,0,
    (U8 *)"522632",(U8 *)"榕江县",NULL,0,
    (U8 *)"522633",(U8 *)"从江县",NULL,0,
    (U8 *)"522634",(U8 *)"雷山县",NULL,0,
    (U8 *)"522635",(U8 *)"麻江县",NULL,0,
    (U8 *)"522636",(U8 *)"丹寨县",NULL,0,
  };
 //522700",(U8 *)"黔南布依族苗族自治州",
 const AREAnode GZ_qiannby[12] = 
{
    (U8 *)"522701",(U8 *)"都匀市",NULL,0,
    (U8 *)"522702",(U8 *)"福泉市",NULL,0,
    (U8 *)"522722",(U8 *)"荔波县",NULL,0,
    (U8 *)"522723",(U8 *)"贵定县",NULL,0,
    (U8 *)"522725",(U8 *)"瓮安县",NULL,0,
    (U8 *)"522726",(U8 *)"独山县",NULL,0,
    (U8 *)"522727",(U8 *)"平塘县",NULL,0,
    (U8 *)"522728",(U8 *)"罗甸县",NULL,0,
    (U8 *)"522729",(U8 *)"长顺县",NULL,0,
    (U8 *)"522730",(U8 *)"龙里县",NULL,0,
    (U8 *)"522731",(U8 *)"惠水县",NULL,0,
    (U8 *)"522732",(U8 *)"三都水族自治县",

  };
 //-------------------------530000",(U8 *)"云南省",-------------------------
 //530100",(U8 *)"昆明市",
 const AREAnode YN_kunm[14] = 
{
    (U8 *)"530102",(U8 *)"五华区",NULL,0,
    (U8 *)"530103",(U8 *)"盘龙区",NULL,0,
    (U8 *)"530111",(U8 *)"官渡区",NULL,0,
    (U8 *)"530112",(U8 *)"西山区",NULL,0,
    (U8 *)"530113",(U8 *)"东川区",NULL,0,
    (U8 *)"530121",(U8 *)"呈贡县",NULL,0,
    (U8 *)"530122",(U8 *)"晋宁县",NULL,0,
    (U8 *)"530124",(U8 *)"富民县",NULL,0,
    (U8 *)"530125",(U8 *)"宜良县",NULL,0,
    (U8 *)"530126",(U8 *)"石林彝族自治县",NULL,0,
    (U8 *)"530127",(U8 *)"嵩明县",NULL,0,
    (U8 *)"530128",(U8 *)"禄劝彝族苗族自治县",NULL,0,
    (U8 *)"530129",(U8 *)"寻甸回族彝族自治县",NULL,0,
    (U8 *)"530181",(U8 *)"安宁市",NULL,0,
  };
 //530300",(U8 *)"曲靖市",
 const AREAnode YN_quj[9] = 
{
    (U8 *)"530302",(U8 *)"麒麟区",NULL,0,
    (U8 *)"530321",(U8 *)"马龙县",NULL,0,
    (U8 *)"530322",(U8 *)"陆良县",NULL,0,
    (U8 *)"530323",(U8 *)"师宗县",NULL,0,
    (U8 *)"530324",(U8 *)"罗平县",NULL,0,
    (U8 *)"530325",(U8 *)"富源县",NULL,0,
    (U8 *)"530326",(U8 *)"会泽县",NULL,0,
    (U8 *)"530328",(U8 *)"沾益县",NULL,0,
    (U8 *)"530381",(U8 *)"宣威市",NULL,0,
  };
 //530400",(U8 *)"玉溪市",
 const AREAnode YN_yux[9] = 
{
    (U8 *)"530402",(U8 *)"红塔区",NULL,0,
    (U8 *)"530421",(U8 *)"江川县",NULL,0,
    (U8 *)"530422",(U8 *)"澄江县",NULL,0,
    (U8 *)"530423",(U8 *)"通海县",NULL,0,
    (U8 *)"530424",(U8 *)"华宁县",NULL,0,
    (U8 *)"530425",(U8 *)"易门县",NULL,0,
    (U8 *)"530426",(U8 *)"峨山彝族自治县",NULL,0,
    (U8 *)"530427",(U8 *)"新平彝族傣族自治县",NULL,0,
    (U8 *)"530428",(U8 *)"元江哈尼族彝族傣族自治县",NULL,0,
  };
 //530500",(U8 *)"保山市",
 const AREAnode YN_baos[5] = 
{
    (U8 *)"530502",(U8 *)"隆阳区",NULL,0,
    (U8 *)"530521",(U8 *)"施甸县",NULL,0,
    (U8 *)"530522",(U8 *)"腾冲县",NULL,0,
    (U8 *)"530523",(U8 *)"龙陵县",NULL,0,
    (U8 *)"530524",(U8 *)"昌宁县",NULL,0,
  };
 //530600",(U8 *)"昭通市",
 const AREAnode YN_shaot[11] = 
{
    (U8 *)"530602",(U8 *)"昭阳区",NULL,0,
    (U8 *)"530621",(U8 *)"鲁甸县",NULL,0,
    (U8 *)"530622",(U8 *)"巧家县",NULL,0,
    (U8 *)"530623",(U8 *)"盐津县",NULL,0,
    (U8 *)"530624",(U8 *)"大关县",NULL,0,
    (U8 *)"530625",(U8 *)"永善县",NULL,0,
    (U8 *)"530626",(U8 *)"绥江县",NULL,0,
    (U8 *)"530627",(U8 *)"镇雄县",NULL,0,
    (U8 *)"530628",(U8 *)"彝良县",NULL,0,
    (U8 *)"530629",(U8 *)"威信县",NULL,0,
    (U8 *)"530630",(U8 *)"水富县",NULL,0,
  };
 //530700",(U8 *)"丽江市",
 const AREAnode YN_lij[5] = 
{
    (U8 *)"530702",(U8 *)"古城区",NULL,0,
    (U8 *)"530721",(U8 *)"玉龙纳西族自治县",NULL,0,
    (U8 *)"530722",(U8 *)"永胜县",NULL,0,
    (U8 *)"530723",(U8 *)"华坪县",NULL,0,
    (U8 *)"530724",(U8 *)"宁蒗彝族自治县",NULL,0,
  };
 //530800",(U8 *)"普洱市",
 const AREAnode YN_pue[10] = 
{
    (U8 *)"530802",(U8 *)"思茅区",NULL,0,
    (U8 *)"530821",(U8 *)"宁洱哈尼族彝族自治县",NULL,0,
    (U8 *)"530822",(U8 *)"墨江哈尼族自治县",NULL,0,
    (U8 *)"530823",(U8 *)"景东彝族自治县",NULL,0,
    (U8 *)"530824",(U8 *)"景谷傣族彝族自治县",NULL,0,
    (U8 *)"530825",(U8 *)"镇沅彝族哈尼族拉祜族自治县",NULL,0,
    (U8 *)"530826",(U8 *)"江城哈尼族彝族自治县",NULL,0,
    (U8 *)"530827",(U8 *)"孟连傣族拉祜族佤族自治县",NULL,0,
    (U8 *)"530828",(U8 *)"澜沧拉祜族自治县",NULL,0,
    (U8 *)"530829",(U8 *)"西盟佤族自治县",NULL,0,
  };
 //530900",(U8 *)"临沧市",
 const AREAnode YN_linc[8] = 
{
    (U8 *)"530902",(U8 *)"临翔区",NULL,0,
    (U8 *)"530921",(U8 *)"凤庆县",NULL,0,
    (U8 *)"530922",(U8 *)"云　县",NULL,0,
    (U8 *)"530923",(U8 *)"永德县",NULL,0,
    (U8 *)"530924",(U8 *)"镇康县",NULL,0,
    (U8 *)"530925",(U8 *)"双江拉祜族佤族布朗族傣族自治县",NULL,0,
    (U8 *)"530926",(U8 *)"耿马傣族佤族自治县",NULL,0,
    (U8 *)"530927",(U8 *)"沧源佤族自治县",NULL,0,
  };
 //532300",(U8 *)"楚雄彝族自治州",
 const AREAnode YN_chuxyz[10] = 
{
    (U8 *)"532301",(U8 *)"楚雄市",NULL,0,
    (U8 *)"532322",(U8 *)"双柏县",NULL,0,
    (U8 *)"532323",(U8 *)"牟定县",NULL,0,
    (U8 *)"532324",(U8 *)"南华县",NULL,0,
    (U8 *)"532325",(U8 *)"姚安县",NULL,0,
    (U8 *)"532326",(U8 *)"大姚县",NULL,0,
    (U8 *)"532327",(U8 *)"永仁县",NULL,0,
    (U8 *)"532328",(U8 *)"元谋县",NULL,0,
    (U8 *)"532329",(U8 *)"武定县",NULL,0,
    (U8 *)"532331",(U8 *)"禄丰县",NULL,0,
  };
 //532500",(U8 *)"红河哈尼族彝族自治州",
 const AREAnode YN_honghhn[13] = 
{
    (U8 *)"532501",(U8 *)"个旧市",NULL,0,
    (U8 *)"532502",(U8 *)"开远市",NULL,0,
    (U8 *)"532522",(U8 *)"蒙自县",NULL,0,
    (U8 *)"532523",(U8 *)"屏边苗族自治县",NULL,0,
    (U8 *)"532524",(U8 *)"建水县",NULL,0,
    (U8 *)"532525",(U8 *)"石屏县",NULL,0,
    (U8 *)"532526",(U8 *)"弥勒县",NULL,0,
    (U8 *)"532527",(U8 *)"泸西县",NULL,0,
    (U8 *)"532528",(U8 *)"元阳县",NULL,0,
    (U8 *)"532529",(U8 *)"红河县",NULL,0,
    (U8 *)"532530",(U8 *)"金平苗族瑶族傣族自治县",NULL,0,
    (U8 *)"532531",(U8 *)"绿春县",NULL,0,
    (U8 *)"532532",(U8 *)"河口瑶族自治县",NULL,0,
  };
 //532600",(U8 *)"文山壮族苗族自治州",
 const AREAnode YN_wens[8] = 
{
    (U8 *)"532621",(U8 *)"文山县",NULL,0,
    (U8 *)"532622",(U8 *)"砚山县",NULL,0,
    (U8 *)"532623",(U8 *)"西畴县",NULL,0,
    (U8 *)"532624",(U8 *)"麻栗坡县",NULL,0,
    (U8 *)"532625",(U8 *)"马关县",NULL,0,
    (U8 *)"532626",(U8 *)"丘北县",NULL,0,
    (U8 *)"532627",(U8 *)"广南县",NULL,0,
    (U8 *)"532628",(U8 *)"富宁县",NULL,0,
  };
 //532800",(U8 *)"西双版纳傣族自治州",
 const AREAnode YN_xisbn[3] = 
{
    (U8 *)"532801",(U8 *)"景洪市",NULL,0,
    (U8 *)"532822",(U8 *)"勐海县",NULL,0,
    (U8 *)"532823",(U8 *)"勐腊县",NULL,0,
  };
 //532900",(U8 *)"大理白族自治州",
 const AREAnode YN_dal[12] = 
{
    (U8 *)"532901",(U8 *)"大理市",NULL,0,
    (U8 *)"532922",(U8 *)"漾濞彝族自治县",NULL,0,
    (U8 *)"532923",(U8 *)"祥云县",NULL,0,
    (U8 *)"532924",(U8 *)"宾川县",NULL,0,
    (U8 *)"532925",(U8 *)"弥渡县",NULL,0,
    (U8 *)"532926",(U8 *)"南涧彝族自治县",NULL,0,
    (U8 *)"532927",(U8 *)"巍山彝族回族自治县",NULL,0,
    (U8 *)"532928",(U8 *)"永平县",NULL,0,
    (U8 *)"532929",(U8 *)"云龙县",NULL,0,
    (U8 *)"532930",(U8 *)"洱源县",NULL,0,
    (U8 *)"532931",(U8 *)"剑川县",NULL,0,
    (U8 *)"532932",(U8 *)"鹤庆县",NULL,0,
  };
 //533100",(U8 *)"德宏傣族景颇族自治州",
 const AREAnode YN_deh[5] = 
{
    (U8 *)"533102",(U8 *)"瑞丽市",NULL,0,
    (U8 *)"533103",(U8 *)"潞西市",NULL,0,
    (U8 *)"533122",(U8 *)"梁河县",NULL,0,
    (U8 *)"533123",(U8 *)"盈江县",NULL,0,
    (U8 *)"533124",(U8 *)"陇川县",NULL,0,
  };
 //533300",(U8 *)"怒江傈僳族自治州",
 const AREAnode YN_nuj[4] = 
{
    (U8 *)"533321",(U8 *)"泸水县",NULL,0,
    (U8 *)"533323",(U8 *)"福贡县",NULL,0,
    (U8 *)"533324",(U8 *)"贡山独龙族怒族自治县",NULL,0,
    (U8 *)"533325",(U8 *)"兰坪白族普米族自治县",NULL,0,
  };
 //533400",(U8 *)"迪庆藏族自治州",
 const AREAnode YN_diq[3] = 
{
    (U8 *)"533421",(U8 *)"香格里拉县",NULL,0,
    (U8 *)"533422",(U8 *)"德钦县",NULL,0,
    (U8 *)"533423",(U8 *)"维西傈僳族自治县",

  };
//-----------------------540000",(U8 *)"西藏自治区",-------------------------
 //540100",(U8 *)"拉萨市",
 const AREAnode XZ_las[8] = 
{
    (U8 *)"540102",(U8 *)"城关区",NULL,0,
    (U8 *)"540121",(U8 *)"林周县",NULL,0,
    (U8 *)"540122",(U8 *)"当雄县",NULL,0,
    (U8 *)"540123",(U8 *)"尼木县",NULL,0,
    (U8 *)"540124",(U8 *)"曲水县",NULL,0,
    (U8 *)"540125",(U8 *)"堆龙德庆县",NULL,0,
    (U8 *)"540126",(U8 *)"达孜县",NULL,0,
    (U8 *)"540127",(U8 *)"墨竹工卡县",NULL,0,
  };
 //542100",(U8 *)"昌都地区",
 const AREAnode XZ_changd[11] = 
{
    (U8 *)"542121",(U8 *)"昌都县",NULL,0,
    (U8 *)"542122",(U8 *)"江达县",NULL,0,
    (U8 *)"542123",(U8 *)"贡觉县",NULL,0,
    (U8 *)"542124",(U8 *)"类乌齐县",NULL,0,
    (U8 *)"542125",(U8 *)"丁青县",NULL,0,
    (U8 *)"542126",(U8 *)"察雅县",NULL,0,
    (U8 *)"542127",(U8 *)"八宿县",NULL,0,
    (U8 *)"542128",(U8 *)"左贡县",NULL,0,
    (U8 *)"542129",(U8 *)"芒康县",NULL,0,
    (U8 *)"542132",(U8 *)"洛隆县",NULL,0,
    (U8 *)"542133",(U8 *)"边坝县",NULL,0,
  };
 //542200",(U8 *)"山南地区",
 const AREAnode XZ_shann[12] = 
{
    (U8 *)"542221",(U8 *)"乃东县",NULL,0,
    (U8 *)"542222",(U8 *)"扎囊县",NULL,0,
    (U8 *)"542223",(U8 *)"贡嘎县",NULL,0,
    (U8 *)"542224",(U8 *)"桑日县",NULL,0,
    (U8 *)"542225",(U8 *)"琼结县",NULL,0,
    (U8 *)"542226",(U8 *)"曲松县",NULL,0,
    (U8 *)"542227",(U8 *)"措美县",NULL,0,
    (U8 *)"542228",(U8 *)"洛扎县",NULL,0,
    (U8 *)"542229",(U8 *)"加查县",NULL,0,
    (U8 *)"542231",(U8 *)"隆子县",NULL,0,
    (U8 *)"542232",(U8 *)"错那县",NULL,0,
    (U8 *)"542233",(U8 *)"浪卡子县",NULL,0,
  };
 //542300",(U8 *)"日喀则地区",
 const AREAnode XZ_rikz[18] = 
{
    (U8 *)"542301",(U8 *)"日喀则市",NULL,0,
    (U8 *)"542322",(U8 *)"南木林县",NULL,0,
    (U8 *)"542323",(U8 *)"江孜县",NULL,0,
    (U8 *)"542324",(U8 *)"定日县",NULL,0,
    (U8 *)"542325",(U8 *)"萨迦县",NULL,0,
    (U8 *)"542326",(U8 *)"拉孜县",NULL,0,
    (U8 *)"542327",(U8 *)"昂仁县",NULL,0,
    (U8 *)"542328",(U8 *)"谢通门县",NULL,0,
    (U8 *)"542329",(U8 *)"白朗县",NULL,0,
    (U8 *)"542330",(U8 *)"仁布县",NULL,0,
    (U8 *)"542331",(U8 *)"康马县",NULL,0,
    (U8 *)"542332",(U8 *)"定结县",NULL,0,
    (U8 *)"542333",(U8 *)"仲巴县",NULL,0,
    (U8 *)"542334",(U8 *)"亚东县",NULL,0,
    (U8 *)"542335",(U8 *)"吉隆县",NULL,0,
    (U8 *)"542336",(U8 *)"聂拉木县",NULL,0,
    (U8 *)"542337",(U8 *)"萨嘎县",NULL,0,
    (U8 *)"542338",(U8 *)"岗巴县",NULL,0,
  };
 //542400",(U8 *)"那曲地区",
 const AREAnode XZ_naq[10] = 
{
    (U8 *)"542421",(U8 *)"那曲县",NULL,0,
    (U8 *)"542422",(U8 *)"嘉黎县",NULL,0,
    (U8 *)"542423",(U8 *)"比如县",NULL,0,
    (U8 *)"542424",(U8 *)"聂荣县",NULL,0,
    (U8 *)"542425",(U8 *)"安多县",NULL,0,
    (U8 *)"542426",(U8 *)"申扎县",NULL,0,
    (U8 *)"542427",(U8 *)"索　县",NULL,0,
    (U8 *)"542428",(U8 *)"班戈县",NULL,0,
    (U8 *)"542429",(U8 *)"巴青县",NULL,0,
    (U8 *)"542430",(U8 *)"尼玛县",NULL,0,
  };
 //542500",(U8 *)"阿里地区",
 const AREAnode XZ_als[7] = 
{
    (U8 *)"542521",(U8 *)"普兰县",NULL,0,
    (U8 *)"542522",(U8 *)"札达县",NULL,0,
    (U8 *)"542523",(U8 *)"噶尔县",NULL,0,
    (U8 *)"542524",(U8 *)"日土县",NULL,0,
    (U8 *)"542525",(U8 *)"革吉县",NULL,0,
    (U8 *)"542526",(U8 *)"改则县",NULL,0,
    (U8 *)"542527",(U8 *)"措勤县",NULL,0,
  };
 //542600",(U8 *)"林芝地区",
 const AREAnode XZ_linz[7] = 
{
    (U8 *)"542621",(U8 *)"林芝县",NULL,0,
    (U8 *)"542622",(U8 *)"工布江达县",NULL,0,
    (U8 *)"542623",(U8 *)"米林县",NULL,0,
    (U8 *)"542624",(U8 *)"墨脱县",NULL,0,
    (U8 *)"542625",(U8 *)"波密县",NULL,0,
    (U8 *)"542626",(U8 *)"察隅县",NULL,0,
    (U8 *)"542627",(U8 *)"朗　县",

  };
//-------------------------610000",(U8 *)"陕西省",-------------------------
 //610100",(U8 *)"西安市",
 const AREAnode SX_xia[13] = 
{
    (U8 *)"610102",(U8 *)"新城区",NULL,0,
    (U8 *)"610103",(U8 *)"碑林区",NULL,0,
    (U8 *)"610104",(U8 *)"莲湖区",NULL,0,
    (U8 *)"610111",(U8 *)"灞桥区",NULL,0,
    (U8 *)"610112",(U8 *)"未央区",NULL,0,
    (U8 *)"610113",(U8 *)"雁塔区",NULL,0,
    (U8 *)"610114",(U8 *)"阎良区",NULL,0,
    (U8 *)"610115",(U8 *)"临潼区",NULL,0,
    (U8 *)"610116",(U8 *)"长安区",NULL,0,
    (U8 *)"610122",(U8 *)"蓝田县",NULL,0,
    (U8 *)"610124",(U8 *)"周至县",NULL,0,
    (U8 *)"610125",(U8 *)"户　县",NULL,0,
    (U8 *)"610126",(U8 *)"高陵县",NULL,0,
  };
 //610200",(U8 *)"铜川市",
 const AREAnode SX_tongc[4] = 
{
    (U8 *)"610202",(U8 *)"王益区",NULL,0,
    (U8 *)"610203",(U8 *)"印台区",NULL,0,
    (U8 *)"610204",(U8 *)"耀州区",NULL,0,
    (U8 *)"610222",(U8 *)"宜君县",NULL,0,
  };
 //610300",(U8 *)"宝鸡市",
 const AREAnode SX_baoj[12] = 
{
    (U8 *)"610302",(U8 *)"渭滨区",NULL,0,
    (U8 *)"610303",(U8 *)"金台区",NULL,0,
    (U8 *)"610304",(U8 *)"陈仓区",NULL,0,
    (U8 *)"610322",(U8 *)"凤翔县",NULL,0,
    (U8 *)"610323",(U8 *)"岐山县",NULL,0,
    (U8 *)"610324",(U8 *)"扶风县",NULL,0,
    (U8 *)"610326",(U8 *)"眉　县",NULL,0,
    (U8 *)"610327",(U8 *)"陇　县",NULL,0,
    (U8 *)"610328",(U8 *)"千阳县",NULL,0,
    (U8 *)"610329",(U8 *)"麟游县",NULL,0,
    (U8 *)"610330",(U8 *)"凤　县",NULL,0,
    (U8 *)"610331",(U8 *)"太白县",NULL,0,
  };
 //610400",(U8 *)"咸阳市",
 const AREAnode SX_xiany[14] = 
{
    (U8 *)"610402",(U8 *)"秦都区",NULL,0,
    (U8 *)"610403",(U8 *)"杨陵区",NULL,0,
    (U8 *)"610404",(U8 *)"渭城区",NULL,0,
    (U8 *)"610422",(U8 *)"三原县",NULL,0,
    (U8 *)"610423",(U8 *)"泾阳县",NULL,0,
    (U8 *)"610424",(U8 *)"乾　县",NULL,0,
    (U8 *)"610425",(U8 *)"礼泉县",NULL,0,
    (U8 *)"610426",(U8 *)"永寿县",NULL,0,
    (U8 *)"610427",(U8 *)"彬　县",NULL,0,
    (U8 *)"610428",(U8 *)"长武县",NULL,0,
    (U8 *)"610429",(U8 *)"旬邑县",NULL,0,
    (U8 *)"610430",(U8 *)"淳化县",NULL,0,
    (U8 *)"610431",(U8 *)"武功县",NULL,0,
    (U8 *)"610481",(U8 *)"兴平市",NULL,0,
  };
 //610500",(U8 *)"渭南市",
 const AREAnode SX_wein[11] = 
{
    (U8 *)"610502",(U8 *)"临渭区",NULL,0,
    (U8 *)"610521",(U8 *)"华　县",NULL,0,
    (U8 *)"610522",(U8 *)"潼关县",NULL,0,
    (U8 *)"610523",(U8 *)"大荔县",NULL,0,
    (U8 *)"610524",(U8 *)"合阳县",NULL,0,
    (U8 *)"610525",(U8 *)"澄城县",NULL,0,
    (U8 *)"610526",(U8 *)"蒲城县",NULL,0,
    (U8 *)"610527",(U8 *)"白水县",NULL,0,
    (U8 *)"610528",(U8 *)"富平县",NULL,0,
    (U8 *)"610581",(U8 *)"韩城市",NULL,0,
    (U8 *)"610582",(U8 *)"华阴市",NULL,0,
  };
 //610600",(U8 *)"延安市",
 const AREAnode SX_yana[13] = 
{
    (U8 *)"610602",(U8 *)"宝塔区",NULL,0,
    (U8 *)"610621",(U8 *)"延长县",NULL,0,
    (U8 *)"610622",(U8 *)"延川县",NULL,0,
    (U8 *)"610623",(U8 *)"子长县",NULL,0,
    (U8 *)"610624",(U8 *)"安塞县",NULL,0,
    (U8 *)"610625",(U8 *)"志丹县",NULL,0,
    (U8 *)"610626",(U8 *)"吴起县",NULL,0,
    (U8 *)"610627",(U8 *)"甘泉县",NULL,0,
    (U8 *)"610628",(U8 *)"富　县",NULL,0,
    (U8 *)"610629",(U8 *)"洛川县",NULL,0,
    (U8 *)"610630",(U8 *)"宜川县",NULL,0,
    (U8 *)"610631",(U8 *)"黄龙县",NULL,0,
    (U8 *)"610632",(U8 *)"黄陵县",NULL,0,
  };
 //610700",(U8 *)"汉中市",
 const AREAnode SX_hanz[11] = 
{
    (U8 *)"610702",(U8 *)"汉台区",NULL,0,
    (U8 *)"610721",(U8 *)"南郑县",NULL,0,
    (U8 *)"610722",(U8 *)"城固县",NULL,0,
    (U8 *)"610723",(U8 *)"洋　县",NULL,0,
    (U8 *)"610724",(U8 *)"西乡县",NULL,0,
    (U8 *)"610725",(U8 *)"勉　县",NULL,0,
    (U8 *)"610726",(U8 *)"宁强县",NULL,0,
    (U8 *)"610727",(U8 *)"略阳县",NULL,0,
    (U8 *)"610728",(U8 *)"镇巴县",NULL,0,
    (U8 *)"610729",(U8 *)"留坝县",NULL,0,
    (U8 *)"610730",(U8 *)"佛坪县",NULL,0,
  };
 //610800",(U8 *)"榆林市",
 const AREAnode SX_yul[12] = 
{
    (U8 *)"610802",(U8 *)"榆阳区",NULL,0,
    (U8 *)"610821",(U8 *)"神木县",NULL,0,
    (U8 *)"610822",(U8 *)"府谷县",NULL,0,
    (U8 *)"610823",(U8 *)"横山县",NULL,0,
    (U8 *)"610824",(U8 *)"靖边县",NULL,0,
    (U8 *)"610825",(U8 *)"定边县",NULL,0,
    (U8 *)"610826",(U8 *)"绥德县",NULL,0,
    (U8 *)"610827",(U8 *)"米脂县",NULL,0,
    (U8 *)"610828",(U8 *)"佳　县",NULL,0,
    (U8 *)"610829",(U8 *)"吴堡县",NULL,0,
    (U8 *)"610830",(U8 *)"清涧县",NULL,0,
    (U8 *)"610831",(U8 *)"子洲县",NULL,0,
  };
 //610900",(U8 *)"安康市",
 const AREAnode SX_ank[10] = 
{
    (U8 *)"610902",(U8 *)"汉滨区",NULL,0,
    (U8 *)"610921",(U8 *)"汉阴县",NULL,0,
    (U8 *)"610922",(U8 *)"石泉县",NULL,0,
    (U8 *)"610923",(U8 *)"宁陕县",NULL,0,
    (U8 *)"610924",(U8 *)"紫阳县",NULL,0,
    (U8 *)"610925",(U8 *)"岚皋县",NULL,0,
    (U8 *)"610926",(U8 *)"平利县",NULL,0,
    (U8 *)"610927",(U8 *)"镇坪县",NULL,0,
    (U8 *)"610928",(U8 *)"旬阳县",NULL,0,
    (U8 *)"610929",(U8 *)"白河县",NULL,0,
  };
 //611000",(U8 *)"商洛市",
 const AREAnode SX_shangl[7] = 
{
    (U8 *)"611002",(U8 *)"商州区",NULL,0,
    (U8 *)"611021",(U8 *)"洛南县",NULL,0,
    (U8 *)"611022",(U8 *)"丹凤县",NULL,0,
    (U8 *)"611023",(U8 *)"商南县",NULL,0,
    (U8 *)"611024",(U8 *)"山阳县",NULL,0,
    (U8 *)"611025",(U8 *)"镇安县",NULL,0,
    (U8 *)"611026",(U8 *)"柞水县",

  };
//------------------------620000",(U8 *)"甘肃省",----------------------------
 //620100",(U8 *)"兰州市",
 const AREAnode GS_lanz[8] = 
{
    (U8 *)"620102",(U8 *)"城关区",NULL,0,
    (U8 *)"620103",(U8 *)"七里河区",NULL,0,
    (U8 *)"620104",(U8 *)"西固区",NULL,0,
    (U8 *)"620105",(U8 *)"安宁区",NULL,0,
    (U8 *)"620111",(U8 *)"红古区",NULL,0,
    (U8 *)"620121",(U8 *)"永登县",NULL,0,
    (U8 *)"620122",(U8 *)"皋兰县",NULL,0,
    (U8 *)"620123",(U8 *)"榆中县",NULL,0,
  };
 //620200",(U8 *)"嘉峪关市",
 const AREAnode GS_jiayg[1] = 
{
	(U8 *)" ",(U8 *)" "
  };
 //620300",(U8 *)"金昌市",
 const AREAnode GS_jinc[2] = 
{
    (U8 *)"620302",(U8 *)"金川区",NULL,0,
    (U8 *)"620321",(U8 *)"永昌县",NULL,0,
  };
 //620400",(U8 *)"白银市",
 const AREAnode GS_baiy[5] = 
{
    (U8 *)"620402",(U8 *)"白银区",NULL,0,
    (U8 *)"620403",(U8 *)"平川区",NULL,0,
    (U8 *)"620421",(U8 *)"靖远县",NULL,0,
    (U8 *)"620422",(U8 *)"会宁县",NULL,0,
    (U8 *)"620423",(U8 *)"景泰县",NULL,0,
  };
 //620500",(U8 *)"天水市",
 const AREAnode GS_tians[7] = 
{
    (U8 *)"620502",(U8 *)"秦州区",NULL,0,
    (U8 *)"620503",(U8 *)"麦积区",NULL,0,
    (U8 *)"620521",(U8 *)"清水县",NULL,0,
    (U8 *)"620522",(U8 *)"秦安县",NULL,0,
    (U8 *)"620523",(U8 *)"甘谷县",NULL,0,
    (U8 *)"620524",(U8 *)"武山县",NULL,0,
    (U8 *)"620525",(U8 *)"张家川回族自治县",NULL,0,
  };
 //620600",(U8 *)"武威市",
 const AREAnode GS_wud[4] = 
{
    (U8 *)"620602",(U8 *)"凉州区",NULL,0,
    (U8 *)"620621",(U8 *)"民勤县",NULL,0,
    (U8 *)"620622",(U8 *)"古浪县",NULL,0,
    (U8 *)"620623",(U8 *)"天祝藏族自治县",NULL,0,
  };
 //620700",(U8 *)"张掖市",
 const AREAnode GS_zhangy[6] = 
{
    (U8 *)"620702",(U8 *)"甘州区",NULL,0,
    (U8 *)"620721",(U8 *)"肃南裕固族自治县",NULL,0,
    (U8 *)"620722",(U8 *)"民乐县",NULL,0,
    (U8 *)"620723",(U8 *)"临泽县",NULL,0,
    (U8 *)"620724",(U8 *)"高台县",NULL,0,
    (U8 *)"620725",(U8 *)"山丹县",NULL,0,
  };
 //620800",(U8 *)"平凉市",
 const AREAnode GS_pingl[7] = 
{
    (U8 *)"620802",(U8 *)"崆峒区",NULL,0,
    (U8 *)"620821",(U8 *)"泾川县",NULL,0,
    (U8 *)"620822",(U8 *)"灵台县",NULL,0,
    (U8 *)"620823",(U8 *)"崇信县",NULL,0,
    (U8 *)"620824",(U8 *)"华亭县",NULL,0,
    (U8 *)"620825",(U8 *)"庄浪县",NULL,0,
    (U8 *)"620826",(U8 *)"静宁县",NULL,0,
  };
 //620900",(U8 *)"酒泉市",
 const AREAnode GS_jiuq[7] = 
{
    (U8 *)"620902",(U8 *)"肃州区",NULL,0,
    (U8 *)"620921",(U8 *)"金塔县",NULL,0,
    (U8 *)"620922",(U8 *)"瓜州县",NULL,0,
    (U8 *)"620923",(U8 *)"肃北蒙古族自治县",NULL,0,
    (U8 *)"620924",(U8 *)"阿克塞哈萨克族自治县",NULL,0,
    (U8 *)"620981",(U8 *)"玉门市",NULL,0,
    (U8 *)"620982",(U8 *)"敦煌市",NULL,0,
  };
 //621000",(U8 *)"庆阳市",
 const AREAnode GS_qingy[8] = 
{
    (U8 *)"621002",(U8 *)"西峰区",NULL,0,
    (U8 *)"621021",(U8 *)"庆城县",NULL,0,
    (U8 *)"621022",(U8 *)"环　县",NULL,0,
    (U8 *)"621023",(U8 *)"华池县",NULL,0,
    (U8 *)"621024",(U8 *)"合水县",NULL,0,
    (U8 *)"621025",(U8 *)"正宁县",NULL,0,
    (U8 *)"621026",(U8 *)"宁　县",NULL,0,
    (U8 *)"621027",(U8 *)"镇原县",NULL,0,
  };
 //621100",(U8 *)"定西市",
 const AREAnode GS_dingx[7] = 
{
    (U8 *)"621102",(U8 *)"安定区",NULL,0,
    (U8 *)"621121",(U8 *)"通渭县",NULL,0,
    (U8 *)"621122",(U8 *)"陇西县",NULL,0,
    (U8 *)"621123",(U8 *)"渭源县",NULL,0,
    (U8 *)"621124",(U8 *)"临洮县",NULL,0,
    (U8 *)"621125",(U8 *)"漳　县",NULL,0,
    (U8 *)"621126",(U8 *)"岷　县",NULL,0,
  };
 //621200",(U8 *)"陇南市",
 const AREAnode GS_longn[9] = 
{
    (U8 *)"621202",(U8 *)"武都区",NULL,0,
    (U8 *)"621221",(U8 *)"成　县",NULL,0,
    (U8 *)"621222",(U8 *)"文　县",NULL,0,
    (U8 *)"621223",(U8 *)"宕昌县",NULL,0,
    (U8 *)"621224",(U8 *)"康　县",NULL,0,
    (U8 *)"621225",(U8 *)"西和县",NULL,0,
    (U8 *)"621226",(U8 *)"礼　县",NULL,0,
    (U8 *)"621227",(U8 *)"徽　县",NULL,0,
    (U8 *)"621228",(U8 *)"两当县",NULL,0,
  };
 //622900",(U8 *)"临夏回族自治州",
 const AREAnode GS_linx[8] = 
{
    (U8 *)"622901",(U8 *)"临夏市",NULL,0,
    (U8 *)"622921",(U8 *)"临夏县",NULL,0,
    (U8 *)"622922",(U8 *)"康乐县",NULL,0,
    (U8 *)"622923",(U8 *)"永靖县",NULL,0,
    (U8 *)"622924",(U8 *)"广河县",NULL,0,
    (U8 *)"622925",(U8 *)"和政县",NULL,0,
    (U8 *)"622926",(U8 *)"东乡族自治县",NULL,0,
    (U8 *)"622927",(U8 *)"积石山保安族东乡族撒拉族自治县",NULL,0,
  };
 //623000",(U8 *)"甘南藏族自治州",
 const AREAnode GS_gannz[8] = 
{
    (U8 *)"623001",(U8 *)"合作市",NULL,0,
    (U8 *)"623021",(U8 *)"临潭县",NULL,0,
    (U8 *)"623022",(U8 *)"卓尼县",NULL,0,
    (U8 *)"623023",(U8 *)"舟曲县",NULL,0,
    (U8 *)"623024",(U8 *)"迭部县",NULL,0,
    (U8 *)"623025",(U8 *)"玛曲县",NULL,0,
    (U8 *)"623026",(U8 *)"碌曲县",NULL,0,
    (U8 *)"623027",(U8 *)"夏河县",

  };
//-----------------------------630000",(U8 *)"青海省",-----------------------
 //630100",(U8 *)"西宁市",
 const AREAnode QH_xin[7] = 
{
    (U8 *)"630102",(U8 *)"城东区",NULL,0,
    (U8 *)"630103",(U8 *)"城中区",NULL,0,
    (U8 *)"630104",(U8 *)"城西区",NULL,0,
    (U8 *)"630105",(U8 *)"城北区",NULL,0,
    (U8 *)"630121",(U8 *)"大通回族土族自治县",NULL,0,
    (U8 *)"630122",(U8 *)"湟中县",NULL,0,
    (U8 *)"630123",(U8 *)"湟源县",NULL,0,
  };
 //632100",(U8 *)"海东地区",
 const AREAnode QH_haid[6] = 
{
    (U8 *)"632121",(U8 *)"平安县",NULL,0,
    (U8 *)"632122",(U8 *)"民和回族土族自治县",NULL,0,
    (U8 *)"632123",(U8 *)"乐都县",NULL,0,
    (U8 *)"632126",(U8 *)"互助土族自治县",NULL,0,
    (U8 *)"632127",(U8 *)"化隆回族自治县",NULL,0,
    (U8 *)"632128",(U8 *)"循化撒拉族自治县",NULL,0,
  };
 //632200",(U8 *)"海北藏族自治州",
 const AREAnode QH_haib[4] = 
{
    (U8 *)"632221",(U8 *)"门源回族自治县",NULL,0,
    (U8 *)"632222",(U8 *)"祁连县",NULL,0,
    (U8 *)"632223",(U8 *)"海晏县",NULL,0,
    (U8 *)"632224",(U8 *)"刚察县",NULL,0,
  };
 //632300",(U8 *)"黄南藏族自治州",
 const AREAnode QH_huangn[4] = 
{
    (U8 *)"632321",(U8 *)"同仁县",NULL,0,
    (U8 *)"632322",(U8 *)"尖扎县",NULL,0,
    (U8 *)"632323",(U8 *)"泽库县",NULL,0,
    (U8 *)"632324",(U8 *)"河南蒙古族自治县",NULL,0,
  };
 //632500",(U8 *)"海南藏族自治州",
 const AREAnode QH_hain[5] = 
{
    (U8 *)"632521",(U8 *)"共和县",NULL,0,
    (U8 *)"632522",(U8 *)"同德县",NULL,0,
    (U8 *)"632523",(U8 *)"贵德县",NULL,0,
    (U8 *)"632524",(U8 *)"兴海县",NULL,0,
    (U8 *)"632525",(U8 *)"贵南县",NULL,0,
  };
 //632600",(U8 *)"果洛藏族自治州",
 const AREAnode QH_guol[6] = 
{
    (U8 *)"632621",(U8 *)"玛沁县",NULL,0,
    (U8 *)"632622",(U8 *)"班玛县",NULL,0,
    (U8 *)"632623",(U8 *)"甘德县",NULL,0,
    (U8 *)"632624",(U8 *)"达日县",NULL,0,
    (U8 *)"632625",(U8 *)"久治县",NULL,0,
    (U8 *)"632626",(U8 *)"玛多县",NULL,0,
  };
 //632700",(U8 *)"玉树藏族自治州",
 const AREAnode QH_yus[6] = 
{
    (U8 *)"632721",(U8 *)"玉树县",NULL,0,
    (U8 *)"632722",(U8 *)"杂多县",NULL,0,
    (U8 *)"632723",(U8 *)"称多县",NULL,0,
    (U8 *)"632724",(U8 *)"治多县",NULL,0,
    (U8 *)"632725",(U8 *)"囊谦县",NULL,0,
    (U8 *)"632726",(U8 *)"曲麻莱县",NULL,0,
  };
 //632800",(U8 *)"海西蒙古族藏族自治州",
 const AREAnode QH_haix[5] = 
{
    (U8 *)"632801",(U8 *)"格尔木市",NULL,0,
    (U8 *)"632802",(U8 *)"德令哈市",NULL,0,
    (U8 *)"632821",(U8 *)"乌兰县",NULL,0,
    (U8 *)"632822",(U8 *)"都兰县",NULL,0,
    (U8 *)"632823",(U8 *)"天峻县",

  };
//------------------------------640000",(U8 *)"宁夏回族自治区",---------------------
 //640100",(U8 *)"银川市",
 const AREAnode NX_yic[6] = 
{
    (U8 *)"640104",(U8 *)"兴庆区",NULL,0,
    (U8 *)"640105",(U8 *)"西夏区",NULL,0,
    (U8 *)"640106",(U8 *)"金凤区",NULL,0,
    (U8 *)"640121",(U8 *)"永宁县",NULL,0,
    (U8 *)"640122",(U8 *)"贺兰县",NULL,0,
    (U8 *)"640181",(U8 *)"灵武市",NULL,0,
  };
 //640200",(U8 *)"石嘴山市",
 const AREAnode NX_shizs[3] = 
{
    (U8 *)"640202",(U8 *)"大武口区",NULL,0,
    (U8 *)"640205",(U8 *)"惠农区",NULL,0,
    (U8 *)"640221",(U8 *)"平罗县",NULL,0,
  };
 //640300",(U8 *)"吴忠市",
 const AREAnode NX_wuz[5] = 
{
    (U8 *)"640302",(U8 *)"利通区",NULL,0,
    (U8 *)"640303",(U8 *)"红寺堡区",NULL,0,
    (U8 *)"640323",(U8 *)"盐池县",NULL,0,
    (U8 *)"640324",(U8 *)"同心县",NULL,0,
    (U8 *)"640381",(U8 *)"青铜峡市",NULL,0,
  };
 //640400",(U8 *)"固原市",
 const AREAnode NX_guy[5] = 
{
    (U8 *)"640402",(U8 *)"原州区",NULL,0,
    (U8 *)"640422",(U8 *)"西吉县",NULL,0,
    (U8 *)"640423",(U8 *)"隆德县",NULL,0,
    (U8 *)"640424",(U8 *)"泾源县",NULL,0,
    (U8 *)"640425",(U8 *)"彭阳县",NULL,0,
  };
 //640500",(U8 *)"中卫市",
 const AREAnode NX_zhongw[3] = 
{
    (U8 *)"640502",(U8 *)"沙坡头区",NULL,0,
    (U8 *)"640521",(U8 *)"中宁县",NULL,0,
    (U8 *)"640522",(U8 *)"海原县",

  };
//-----------------------650000",(U8 *)"新疆维吾尔自治区",------------------------
 //650100",(U8 *)"乌鲁木齐市",
 const AREAnode XJ_wulmq[8] = 
{
    (U8 *)"650102",(U8 *)"天山区",NULL,0,
    (U8 *)"650103",(U8 *)"沙依巴克区",NULL,0,
    (U8 *)"650104",(U8 *)"新市区",NULL,0,
    (U8 *)"650105",(U8 *)"水磨沟区",NULL,0,
    (U8 *)"650106",(U8 *)"头屯河区",NULL,0,
    (U8 *)"650107",(U8 *)"达坂城区",NULL,0,
    (U8 *)"650109",(U8 *)"米东区",NULL,0,
    (U8 *)"650121",(U8 *)"乌鲁木齐县",NULL,0,
  };
 //650200",(U8 *)"克拉玛依市",
 const AREAnode XJ_kelmy[4] = 
{
    (U8 *)"650202",(U8 *)"独山子区",NULL,0,
    (U8 *)"650203",(U8 *)"克拉玛依区",NULL,0,
    (U8 *)"650204",(U8 *)"白碱滩区",NULL,0,
    (U8 *)"650205",(U8 *)"乌尔禾区",NULL,0,
  };
 //652100",(U8 *)"吐鲁番地区",
 const AREAnode XJ_tulf[3] = 
{
    (U8 *)"652101",(U8 *)"吐鲁番市",NULL,0,
    (U8 *)"652122",(U8 *)"鄯善县",NULL,0,
    (U8 *)"652123",(U8 *)"托克逊县",NULL,0,
  };
 //652200",(U8 *)"哈密地区",
 const AREAnode XJ_ham[3] = 
{
    (U8 *)"652201",(U8 *)"哈密市",NULL,0,
    (U8 *)"652222",(U8 *)"巴里坤哈萨克自治县",NULL,0,
    (U8 *)"652223",(U8 *)"伊吾县",NULL,0,
  };
 //652300",(U8 *)"昌吉回族自治州",
 const AREAnode XJ_changj[7] = 
{
    (U8 *)"652301",(U8 *)"昌吉市",NULL,0,
    (U8 *)"652302",(U8 *)"阜康市",NULL,0,
    (U8 *)"652323",(U8 *)"呼图壁县",NULL,0,
    (U8 *)"652324",(U8 *)"玛纳斯县",NULL,0,
    (U8 *)"652325",(U8 *)"奇台县",NULL,0,
    (U8 *)"652327",(U8 *)"吉木萨尔县",NULL,0,
    (U8 *)"652328",(U8 *)"木垒哈萨克自治县",NULL,0,
  };
 //652700",(U8 *)"博尔塔拉蒙古自治州",
 const AREAnode XJ_boetl[3] = 
{
    (U8 *)"652701",(U8 *)"博乐市",NULL,0,
    (U8 *)"652722",(U8 *)"精河县",NULL,0,
    (U8 *)"652723",(U8 *)"温泉县",NULL,0,
  };
 //652800",(U8 *)"巴音郭楞蒙古自治州",
 const AREAnode XJ_baygl[9] = 
{
    (U8 *)"652801",(U8 *)"库尔勒市",NULL,0,
    (U8 *)"652822",(U8 *)"轮台县",NULL,0,
    (U8 *)"652823",(U8 *)"尉犁县",NULL,0,
    (U8 *)"652824",(U8 *)"若羌县",NULL,0,
    (U8 *)"652825",(U8 *)"且末县",NULL,0,
    (U8 *)"652826",(U8 *)"焉耆回族自治县",NULL,0,
    (U8 *)"652827",(U8 *)"和静县",NULL,0,
    (U8 *)"652828",(U8 *)"和硕县",NULL,0,
    (U8 *)"652829",(U8 *)"博湖县",NULL,0,
  };
 //652900",(U8 *)"阿克苏地区",
 const AREAnode XJ_aks[9] = 
{
    (U8 *)"652901",(U8 *)"阿克苏市",NULL,0,
    (U8 *)"652922",(U8 *)"温宿县",NULL,0,
    (U8 *)"652923",(U8 *)"库车县",NULL,0,
    (U8 *)"652924",(U8 *)"沙雅县",NULL,0,
    (U8 *)"652925",(U8 *)"新和县",NULL,0,
    (U8 *)"652926",(U8 *)"拜城县",NULL,0,
    (U8 *)"652927",(U8 *)"乌什县",NULL,0,
    (U8 *)"652928",(U8 *)"阿瓦提县",NULL,0,
    (U8 *)"652929",(U8 *)"柯坪县",NULL,0,
  };
 //653000",(U8 *)"克孜勒苏柯尔克孜自治州",
 const AREAnode XJ_kezl[4] = 
{
    (U8 *)"653001",(U8 *)"阿图什市",NULL,0,
    (U8 *)"653022",(U8 *)"阿克陶县",NULL,0,
    (U8 *)"653023",(U8 *)"阿合奇县",NULL,0,
    (U8 *)"653024",(U8 *)"乌恰县",NULL,0,
  };
 //653100",(U8 *)"喀什地区",
 const AREAnode XJ_kas[12] = 
{
    (U8 *)"653101",(U8 *)"喀什市",NULL,0,
    (U8 *)"653121",(U8 *)"疏附县",NULL,0,
    (U8 *)"653122",(U8 *)"疏勒县",NULL,0,
    (U8 *)"653123",(U8 *)"英吉沙县",NULL,0,
    (U8 *)"653124",(U8 *)"泽普县",NULL,0,
    (U8 *)"653125",(U8 *)"莎车县",NULL,0,
    (U8 *)"653126",(U8 *)"叶城县",NULL,0,
    (U8 *)"653127",(U8 *)"麦盖提县",NULL,0,
    (U8 *)"653128",(U8 *)"岳普湖县",NULL,0,
    (U8 *)"653129",(U8 *)"伽师县",NULL,0,
    (U8 *)"653130",(U8 *)"巴楚县",NULL,0,
    (U8 *)"653131",(U8 *)"塔什库尔干塔吉克自治县",NULL,0,
  };
 //653200",(U8 *)"和田地区",
 const AREAnode XJ_het[8] = 
{
    (U8 *)"653201",(U8 *)"和田市",NULL,0,
    (U8 *)"653221",(U8 *)"和田县",NULL,0,
    (U8 *)"653222",(U8 *)"墨玉县",NULL,0,
    (U8 *)"653223",(U8 *)"皮山县",NULL,0,
    (U8 *)"653224",(U8 *)"洛浦县",NULL,0,
    (U8 *)"653225",(U8 *)"策勒县",NULL,0,
    (U8 *)"653226",(U8 *)"于田县",NULL,0,
    (U8 *)"653227",(U8 *)"民丰县",NULL,0,
  };
 //654000",(U8 *)"伊犁哈萨克自治州",
 const AREAnode XJ_yilhsk[10] = 
{
    (U8 *)"654002",(U8 *)"伊宁市",NULL,0,
    (U8 *)"654003",(U8 *)"奎屯市",NULL,0,
    (U8 *)"654021",(U8 *)"伊宁县",NULL,0,
    (U8 *)"654022",(U8 *)"察布查尔锡伯自治县",NULL,0,
    (U8 *)"654023",(U8 *)"霍城县",NULL,0,
    (U8 *)"654024",(U8 *)"巩留县",NULL,0,
    (U8 *)"654025",(U8 *)"新源县",NULL,0,
    (U8 *)"654026",(U8 *)"昭苏县",NULL,0,
    (U8 *)"654027",(U8 *)"特克斯县",NULL,0,
    (U8 *)"654028",(U8 *)"尼勒克县",NULL,0,
  };
 //654200",(U8 *)"塔城地区",
 const AREAnode XJ_tac[7] = 
{
    (U8 *)"654201",(U8 *)"塔城市",NULL,0,
    (U8 *)"654202",(U8 *)"乌苏市",NULL,0,
    (U8 *)"654221",(U8 *)"额敏县",NULL,0,
    (U8 *)"654223",(U8 *)"沙湾县",NULL,0,
    (U8 *)"654224",(U8 *)"托里县",NULL,0,
    (U8 *)"654225",(U8 *)"裕民县",NULL,0,
    (U8 *)"654226",(U8 *)"和布克赛尔蒙古自治县",NULL,0,
  };
 //654300",(U8 *)"阿勒泰地区",
 const AREAnode XJ_alt[7] = 
{
    (U8 *)"654301",(U8 *)"阿勒泰市",NULL,0,
    (U8 *)"654321",(U8 *)"布尔津县",NULL,0,
    (U8 *)"654322",(U8 *)"富蕴县",NULL,0,
    (U8 *)"654323",(U8 *)"福海县",NULL,0,
    (U8 *)"654324",(U8 *)"哈巴河县",NULL,0,
    (U8 *)"654325",(U8 *)"青河县",NULL,0,
    (U8 *)"654326",(U8 *)"吉木乃县",
};
 //659000",(U8 *)"自治区直辖县级行政区划",
 const AREAnode XJ_zizq[4] = 
{
    (U8 *)"659001",(U8 *)"石河子市",NULL,0,
    (U8 *)"659002",(U8 *)"阿拉尔市",NULL,0,
    (U8 *)"659003",(U8 *)"图木舒克市",NULL,0,
    (U8 *)"659004",(U8 *)"五家渠市",
};


/* -------------------------市/市级区------------------------------ */
 //110000",(U8 *)"北京市",
const AREAnode BeiJing[18] = 
{
    (U8 *)"110101",(U8 *)"东城区",NULL,0,
    (U8 *)"110102",(U8 *)"西城区",NULL,0,
    (U8 *)"110103",(U8 *)"崇文区",NULL,0,
    (U8 *)"110104",(U8 *)"宣武区",NULL,0,
    (U8 *)"110105",(U8 *)"朝阳区",NULL,0,
    (U8 *)"110106",(U8 *)"丰台区",NULL,0,
    (U8 *)"110107",(U8 *)"石景山区",NULL,0,
    (U8 *)"110108",(U8 *)"海淀区",NULL,0,
    (U8 *)"110109",(U8 *)"门头沟区",NULL,0,
    (U8 *)"110111",(U8 *)"房山区",NULL,0,
    (U8 *)"110112",(U8 *)"通州区",NULL,0,
    (U8 *)"110113",(U8 *)"顺义区",NULL,0,
    (U8 *)"110114",(U8 *)"昌平区",NULL,0,
    (U8 *)"110115",(U8 *)"大兴区",NULL,0,
    (U8 *)"110116",(U8 *)"怀柔区",NULL,0,
    (U8 *)"110117",(U8 *)"平谷区",NULL,0,
    (U8 *)"110228",(U8 *)"密云县",NULL,0,
    (U8 *)"110229",(U8 *)"延庆县",NULL,0,
};
 //120000",(U8 *)"天津市",
 const AREAnode TianJin[15] = 
{
    (U8 *)"120101",(U8 *)"和平区",NULL,0,
    (U8 *)"120102",(U8 *)"河东区",NULL,0,
    (U8 *)"120103",(U8 *)"河西区",NULL,0,
    (U8 *)"120104",(U8 *)"南开区",NULL,0,
    (U8 *)"120105",(U8 *)"河北区",NULL,0,
    (U8 *)"120106",(U8 *)"红桥区",NULL,0,
    (U8 *)"120110",(U8 *)"东丽区",NULL,0,
    (U8 *)"120111",(U8 *)"西青区",NULL,0,
    (U8 *)"120112",(U8 *)"津南区",NULL,0,
    (U8 *)"120113",(U8 *)"北辰区",NULL,0,
    (U8 *)"120114",(U8 *)"武清区",NULL,0,
    (U8 *)"120115",(U8 *)"宝坻区",NULL,0,
    (U8 *)"120221",(U8 *)"宁河县",NULL,0,
    (U8 *)"120223",(U8 *)"静海县",NULL,0,
    (U8 *)"120225",(U8 *)"蓟　县",NULL,0,

};
 //130000",(U8 *)"河北省",
 const AREAnode HeBei[11] = 
{
  (U8 *)"130100",(U8 *)"石家庄市",HB_shijiazh,13,
  (U8 *)"130200",(U8 *)"唐山市",  HB_tangsh,14,
  (U8 *)"130300",(U8 *)"秦皇岛市",HB_qinhd,7,
  (U8 *)"130400",(U8 *)"邯郸市",  HB_hand,19,
  (U8 *)"130500",(U8 *)"邢台市",  HB_xingt,19,
  (U8 *)"130600",(U8 *)"保定市",  HB_baod,25,
  (U8 *)"130700",(U8 *)"张家口市",HB_zhangjk,17,
  (U8 *)"130800",(U8 *)"承德市",  HB_chengd,11,
  (U8 *)"130900",(U8 *)"沧州市",  HB_cangzh,16,
  (U8 *)"131000",(U8 *)"廊坊市",  HB_langf,10,
  (U8 *)"131100",(U8 *)"衡水市",  HB_hengsh,11,
};
 //140000",(U8 *)"山西省",
 const AREAnode ShanXi[11] = 
{
  (U8 *)"140100",(U8 *)"太原市",SX_taiy,10,
  (U8 *)"140200",(U8 *)"大同市",SX_dat,11,
  (U8 *)"140300",(U8 *)"阳泉市",SX_yangq,5,
  (U8 *)"140400",(U8 *)"长治市",SX_changzh,13,
  (U8 *)"140500",(U8 *)"晋城市",SX_jich,6,
  (U8 *)"140600",(U8 *)"朔州市",SX_shuozh,6,
  (U8 *)"140700",(U8 *)"晋中市",SX_jizh,11,
  (U8 *)"140800",(U8 *)"运城市",SX_yunch,13,
  (U8 *)"140900",(U8 *)"忻州市",SX_qinzh,14,
  (U8 *)"141000",(U8 *)"临汾市",SX_linf,17,
  (U8 *)"141100",(U8 *)"吕梁市",SX_lvl,13,
};
 //150000",(U8 *)"内蒙古自治区",
 const AREAnode NeiMeng[12] = 
{
  (U8 *)"150100",(U8 *)"呼和浩特市",NM_huheh,9,
  (U8 *)"150200",(U8 *)"包头市",    NM_baot,9,
  (U8 *)"150300",(U8 *)"乌海市",    NM_wuhai,3,
  (U8 *)"150400",(U8 *)"赤峰市",    NM_chif,12,
  (U8 *)"150500",(U8 *)"通辽市",    NM_tongl,8,
  (U8 *)"150600",(U8 *)"鄂尔多斯市",NM_eerds,8,
  (U8 *)"150700",(U8 *)"呼伦贝尔市",NM_hulber,13,
  (U8 *)"150800",(U8 *)"巴彦淖尔市",NM_bayzer,7,
  (U8 *)"150900",(U8 *)"乌兰察布市",NM_wulchb,11,
  (U8 *)"152200",(U8 *)"兴安盟",    NM_xinga,6,
  (U8 *)"152500",(U8 *)"锡林郭勒盟",NM_xilgl,12,
  (U8 *)"152900",(U8 *)"阿拉善盟",  NM_alsh,3,
};
 //210000",(U8 *)"辽宁省",
 const AREAnode LiaoNing[14] = 
{
  (U8 *)"210100",(U8 *)"沈阳市",LN_sheny,13,
  (U8 *)"210200",(U8 *)"大连市",LN_dal,10,
  (U8 *)"210300",(U8 *)"鞍山市",LN_ansh,7,
  (U8 *)"210400",(U8 *)"抚顺市",LN_fush,7,
  (U8 *)"210500",(U8 *)"本溪市",LN_benx,6,
  (U8 *)"210600",(U8 *)"丹东市",LN_dand,6,
  (U8 *)"210700",(U8 *)"锦州市",LN_jinzh,7,
  (U8 *)"210800",(U8 *)"营口市",LN_yingk,6,
  (U8 *)"210900",(U8 *)"阜新市",LN_fux,7,
  (U8 *)"211000",(U8 *)"辽阳市",LN_liaoy,7,
  (U8 *)"211100",(U8 *)"盘锦市",LN_panj,4,
  (U8 *)"211200",(U8 *)"铁岭市",LN_tiel,7,
  (U8 *)"211300",(U8 *)"朝阳市",LN_chaoy,7,
  (U8 *)"211400",(U8 *)"葫芦岛市",LN_huld,6,
};
 //220000",(U8 *)"吉林省",
 const AREAnode JiLin[9] = 
{
  (U8 *)"220100",(U8 *)"长春市",JL_changch,10,
  (U8 *)"220200",(U8 *)"吉林市",JL_jil,9,
  (U8 *)"220300",(U8 *)"四平市",JL_sip,6,
  (U8 *)"220400",(U8 *)"辽源市",JL_liaoy,4,
  (U8 *)"220500",(U8 *)"通化市",JL_tongh,7,
  (U8 *)"220600",(U8 *)"白山市",JL_changbsh,6,
  (U8 *)"220700",(U8 *)"松原市",JL_songy,5,
  (U8 *)"220800",(U8 *)"白城市",JL_baich,5,
  (U8 *)"222400",(U8 *)"延边朝鲜族自治州",JL_yanb,8,
};
 //230000",(U8 *)"黑龙江省",
 const AREAnode HeiLongJ[13] = 
{
  (U8 *)"230100",(U8 *)"哈尔滨市",     HLJ_haerb,17,
  (U8 *)"230200",(U8 *)"齐齐哈尔市",   HLJ_qiqher,16,
  (U8 *)"230300",(U8 *)"鸡西市",	   HLJ_jix,9,
  (U8 *)"230400",(U8 *)"鹤岗市",	   HLJ_heg,8,
  (U8 *)"230500",(U8 *)"双鸭山市",	   HLJ_shuangysh,8,
  (U8 *)"230600",(U8 *)"大庆市",	   HLJ_daq,9,
  (U8 *)"230700",(U8 *)"伊春市",	   HLJ_yich,17,
  (U8 *)"230800",(U8 *)"佳木斯市",	   HLJ_jiams,10,
  (U8 *)"230900",(U8 *)"七台河市",	   HLJ_qith,4,
  (U8 *)"231000",(U8 *)"牡丹江市",	   HLJ_mudj,10,
  (U8 *)"231100",(U8 *)"黑河市",	   HLJ_heih,6,
  (U8 *)"231200",(U8 *)"绥化市",	   HLJ_suih,10,
  (U8 *)"232700",(U8 *)"大兴安岭地区", HLJ_daxal,3,
};
 //310000",(U8 *)"上海市",
 const AREAnode ShangHai[18] = 
{
    (U8 *)"310101",(U8 *)"黄浦区",NULL,0,
    (U8 *)"310103",(U8 *)"卢湾区",NULL,0,
    (U8 *)"310104",(U8 *)"徐汇区",NULL,0,
    (U8 *)"310105",(U8 *)"长宁区",NULL,0,
    (U8 *)"310106",(U8 *)"静安区",NULL,0,
    (U8 *)"310107",(U8 *)"普陀区",NULL,0,
    (U8 *)"310108",(U8 *)"闸北区",NULL,0,
    (U8 *)"310109",(U8 *)"虹口区",NULL,0,
    (U8 *)"310110",(U8 *)"杨浦区",NULL,0,
    (U8 *)"310112",(U8 *)"闵行区",NULL,0,
    (U8 *)"310113",(U8 *)"宝山区",NULL,0,
    (U8 *)"310114",(U8 *)"嘉定区",NULL,0,
    (U8 *)"310115",(U8 *)"浦东新区",NULL,0,
    (U8 *)"310116",(U8 *)"金山区",NULL,0,
    (U8 *)"310117",(U8 *)"松江区",NULL,0,
    (U8 *)"310118",(U8 *)"青浦区",NULL,0,
    (U8 *)"310120",(U8 *)"奉贤区",NULL,0,
    (U8 *)"310230",(U8 *)"崇明县",NULL,0,

};
 //320000",(U8 *)"江苏省",
 const AREAnode JiangSu[13] = 
{
  (U8 *)"320100",(U8 *)"南京市",  JS_nanj,13,
  (U8 *)"320200",(U8 *)"无锡市",  JS_wux,8,
  (U8 *)"320300",(U8 *)"徐州市",  JS_xuzh,11,
  (U8 *)"320400",(U8 *)"常州市",  JS_changzh,7,
  (U8 *)"320500",(U8 *)"苏州市",  JS_suzh,11,
  (U8 *)"320600",(U8 *)"南通市",  JS_nant,7,
  (U8 *)"320700",(U8 *)"连云港市",JS_lianyg,7,
  (U8 *)"320800",(U8 *)"淮安市",  JS_huaia,8,
  (U8 *)"320900",(U8 *)"盐城市",  JS_yanch,9,
  (U8 *)"321000",(U8 *)"扬州市",  JS_yangzh,7,
  (U8 *)"321100",(U8 *)"镇江市",  JS_zhenj,6,
  (U8 *)"321200",(U8 *)"泰州市",  JS_taizh,6,
  (U8 *)"321300",(U8 *)"宿迁市",  JS_suq,5,
};
 //330000",(U8 *)"浙江省",
 const AREAnode ZheJiang[11] = 
{
  (U8 *)"330100",(U8 *)"杭州市",ZJ_hangzh,13,
  (U8 *)"330200",(U8 *)"宁波市",ZJ_ningb,11,
  (U8 *)"330300",(U8 *)"温州市",ZJ_wenzh,11,
  (U8 *)"330400",(U8 *)"嘉兴市",ZJ_xingh,7,
  (U8 *)"330500",(U8 *)"湖州市",ZJ_huzh,5,
  (U8 *)"330600",(U8 *)"绍兴市",ZJ_shaox,6,
  (U8 *)"330700",(U8 *)"金华市",ZJ_jinh,9,
  (U8 *)"330800",(U8 *)"衢州市",ZJ_yingzh,6,
  (U8 *)"330900",(U8 *)"舟山市",ZJ_zhoush,4,
  (U8 *)"331000",(U8 *)"台州市",ZJ_taizh,9,
  (U8 *)"331100",(U8 *)"丽水市",ZJ_lish,9,
};
 //340000",(U8 *)"安徽省",
 const AREAnode AnHui[17] = 
{
  (U8 *)"340100",(U8 *)"合肥市",  AH_hef,7,
  (U8 *)"340200",(U8 *)"芜湖市",  AH_wuh,7,
  (U8 *)"340300",(U8 *)"蚌埠市",  AH_bengb,7,
  (U8 *)"340400",(U8 *)"淮南市",  AH_huain,6,
  (U8 *)"340500",(U8 *)"马鞍山市",AH_maash,4,
  (U8 *)"340600",(U8 *)"淮北市",  AH_huaib,4,
  (U8 *)"340700",(U8 *)"铜陵市",  AH_tongl,4,
  (U8 *)"340800",(U8 *)"安庆市",  AH_anq,11,
  (U8 *)"341000",(U8 *)"黄山市",  AH_huangsh,7,
  (U8 *)"341100",(U8 *)"滁州市",  AH_chuzh,8,
  (U8 *)"341200",(U8 *)"阜阳市",  AH_fuy,8,
  (U8 *)"341300",(U8 *)"宿州市",  AH_suq,5,
  (U8 *)"341400",(U8 *)"巢湖市",  AH_chaoh,5,
  (U8 *)"341500",(U8 *)"六安市",  AH_liuan,7,
  (U8 *)"341600",(U8 *)"亳州市",  AH_haozh,4,
  (U8 *)"341700",(U8 *)"池州市",  AH_chizh,4,
  (U8 *)"341800",(U8 *)"宣城市",  AH_yich,7,
};
 //350000",(U8 *)"福建省",
 const AREAnode FuJian[9] = 
{
  (U8 *)"350100",(U8 *)"福州市",FJ_fuzh,13,
  (U8 *)"350200",(U8 *)"厦门市",FJ_xiam,6,
  (U8 *)"350300",(U8 *)"莆田市",FJ_put,5,
  (U8 *)"350400",(U8 *)"三明市",FJ_sanm,12,
  (U8 *)"350500",(U8 *)"泉州市",FJ_quanzh,12,
  (U8 *)"350600",(U8 *)"漳州市",FJ_zhangzh,11,
  (U8 *)"350700",(U8 *)"南平市",FJ_nanp,10,
  (U8 *)"350800",(U8 *)"龙岩市",FJ_longy,7,
  (U8 *)"350900",(U8 *)"宁德市",FJ_ningd,9,
};
 //360000",(U8 *)"江西省",
 const AREAnode JiangXi[11] = 
{
  (U8 *)"360100",(U8 *)"南昌市",  JX_nanch,9,
  (U8 *)"360200",(U8 *)"景德镇市",JX_jingdzh,4,
  (U8 *)"360300",(U8 *)"萍乡市",  JX_pingx,5,
  (U8 *)"360400",(U8 *)"九江市",  JX_jiuj,12,
  (U8 *)"360500",(U8 *)"新余市",  JX_xiny,2,
  (U8 *)"360600",(U8 *)"鹰潭市",  JX_yingt,3,
  (U8 *)"360700",(U8 *)"赣州市",  JX_ganzh,18,
  (U8 *)"360800",(U8 *)"吉安市",  JX_jia,13,
  (U8 *)"360900",(U8 *)"宜春市",  JX_yich,10,
  (U8 *)"361000",(U8 *)"抚州市",  JX_fuzh,11,
  (U8 *)"361100",(U8 *)"上饶市",  JX_shangr,12,
};
 //370000",(U8 *)"山东省",
 const AREAnode ShanDong[17] = 
{
  (U8 *)"370100",(U8 *)"济南市",SD_jin,10,
  (U8 *)"370200",(U8 *)"青岛市",SD_qingd,12,
  (U8 *)"370300",(U8 *)"淄博市",SD_zib,8,
  (U8 *)"370400",(U8 *)"枣庄市",SD_zaozh,6,
  (U8 *)"370500",(U8 *)"东营市",SD_dongy,5,
  (U8 *)"370600",(U8 *)"烟台市",SD_yant,12,
  (U8 *)"370700",(U8 *)"潍坊市",SD_weif,12,
  (U8 *)"370800",(U8 *)"济宁市",SD_jining,12,
  (U8 *)"370900",(U8 *)"泰安市",SD_taia,6,
  (U8 *)"371000",(U8 *)"威海市",SD_weih,4,
  (U8 *)"371100",(U8 *)"日照市",SD_rizh,4,
  (U8 *)"371200",(U8 *)"莱芜市",SD_laiw,2,
  (U8 *)"371300",(U8 *)"临沂市",SD_liny,2,
  (U8 *)"371400",(U8 *)"德州市",SD_dezh,11,
  (U8 *)"371500",(U8 *)"聊城市",SD_liaoch,8,
  (U8 *)"371600",(U8 *)"滨州市",SD_binzh,7,
  (U8 *)"371700",(U8 *)"菏泽市",SD_hez,9,
};
 //410000",(U8 *)"河南省",
 const AREAnode HeNan[17] = 
{
  (U8 *)"410100",(U8 *)"郑州市",  HN_zhengzh,12,
  (U8 *)"410200",(U8 *)"开封市",  HN_kaif,10,
  (U8 *)"410300",(U8 *)"洛阳市",  HN_luoy,15,
  (U8 *)"410400",(U8 *)"平顶山市",HN_pingdsh,10,
  (U8 *)"410500",(U8 *)"安阳市",  HN_any,9,
  (U8 *)"410600",(U8 *)"鹤壁市",  HN_heb,5,
  (U8 *)"410700",(U8 *)"新乡市",  HN_xinx,12,
  (U8 *)"410800",(U8 *)"焦作市",  HN_jiaoz,10,
  (U8 *)"410900",(U8 *)"濮阳市",  HN_puy,6,
  (U8 *)"411000",(U8 *)"许昌市",  HN_xuch,6,
  (U8 *)"411100",(U8 *)"漯河市",  HN_luoh,5,
  (U8 *)"411200",(U8 *)"三门峡市",HN_sanmx,6,
  (U8 *)"411300",(U8 *)"南阳市",  HN_nany,13,
  (U8 *)"411400",(U8 *)"商丘市",  HN_shangq,9,
  (U8 *)"411500",(U8 *)"信阳市",  HN_xiny,10,
  (U8 *)"411600",(U8 *)"周口市",  HN_zhouk,10,
  (U8 *)"411700",(U8 *)"驻马店市",HN_zhumd,11,
};
 //420000",(U8 *)"湖北省",
 const AREAnode HuBei[14] = 
{
  (U8 *)"420100",(U8 *)"武汉市",HuB_wuh,3,
  (U8 *)"420200",(U8 *)"黄石市",HuB_huangsh,6,
  (U8 *)"420300",(U8 *)"十堰市",HuB_shiy,8,
  (U8 *)"420500",(U8 *)"宜昌市",HuB_yich,13,
  (U8 *)"420600",(U8 *)"襄樊市",HuB_xiangf,9,
  (U8 *)"420700",(U8 *)"鄂州市",HuB_ezh,3,
  (U8 *)"420800",(U8 *)"荆门市",HuB_jingm,5,
  (U8 *)"420900",(U8 *)"孝感市",HuB_xiaog,7,
  (U8 *)"421000",(U8 *)"荆州市",HuB_jingzh,8,
  (U8 *)"421100",(U8 *)"黄冈市",HuB_huangg,10,
  (U8 *)"421200",(U8 *)"咸宁市",HuB_xiann,6,
  (U8 *)"421300",(U8 *)"随州市",HuB_suizh,2,
  (U8 *)"422800",(U8 *)"恩施土家族苗族自治州",HuB_ensht,8,
  (U8 *)"429000",(U8 *)"省直辖县级行政区划",HuB_quh,4,
};
 //430000",(U8 *)"湖南省",
 const AREAnode HuNan[14] = 
{
  (U8 *)"430100",(U8 *)"长沙市",HN_changs,9,
  (U8 *)"430200",(U8 *)"株洲市",HN_zhuz,9,
  (U8 *)"430300",(U8 *)"湘潭市",HN_xiangt,5,
  (U8 *)"430400",(U8 *)"衡阳市",HN_hengy,12,
  (U8 *)"430500",(U8 *)"邵阳市",HN_shaoy,12,
  (U8 *)"430600",(U8 *)"岳阳市",HN_yuey,9,
  (U8 *)"430700",(U8 *)"常德市",HN_changd,9,
  (U8 *)"430800",(U8 *)"张家界市",HN_zhangjj,4,
  (U8 *)"430900",(U8 *)"益阳市",HN_yiy,6,
  (U8 *)"431000",(U8 *)"郴州市",HN_chenz,11,
  (U8 *)"431100",(U8 *)"永州市",HN_yongz,11,
  (U8 *)"431200",(U8 *)"怀化市",HN_huaih,12,
  (U8 *)"431300",(U8 *)"娄底市",HN_loud,5,
  (U8 *)"433100",(U8 *)"湘西土家族苗族自治州",HN_xiangxtj,8,
};
 //440000",(U8 *)"广东省",
 const AREAnode GuangDong[21] = 
{
  (U8 *)"440100",(U8 *)"广州市",GD_guangz,12,
  (U8 *)"440200",(U8 *)"韶关市",GD_shaog,10,
  (U8 *)"440300",(U8 *)"深圳市",GD_shenz,6,
  (U8 *)"440400",(U8 *)"珠海市",GD_zhuh,3,
  (U8 *)"440500",(U8 *)"汕头市",GD_shant,7,
  (U8 *)"440600",(U8 *)"佛山市",GD_fos,5,
  (U8 *)"440700",(U8 *)"江门市",GD_jiangm,7,
  (U8 *)"440800",(U8 *)"湛江市",GD_zhanj,9,
  (U8 *)"440900",(U8 *)"茂名市",GD_maom,6,
  (U8 *)"441200",(U8 *)"肇庆市",GD_zaoq,8,
  (U8 *)"441300",(U8 *)"惠州市",GD_zhongz,5,
  (U8 *)"441400",(U8 *)"梅州市",GD_meiz,8,
  (U8 *)"441500",(U8 *)"汕尾市",GD_shanw,4,
  (U8 *)"441600",(U8 *)"河源市",GD_hey,6,
  (U8 *)"441700",(U8 *)"阳江市",GD_yangj,4,
  (U8 *)"441800",(U8 *)"清远市",GD_qingy,8,
  (U8 *)"441900",(U8 *)"东莞市",NULL,0,
  (U8 *)"442000",(U8 *)"中山市",NULL,0,
  (U8 *)"445100",(U8 *)"潮州市",GD_chaoz,3,
  (U8 *)"445200",(U8 *)"揭阳市",GD_jiey,5,
  (U8 *)"445300",(U8 *)"云浮市",GD_yunf,5,
};
 //450000",(U8 *)"广西壮族自治区",
 const AREAnode GuangXi[14] = 
{
  (U8 *)"450100",(U8 *)"南宁市",  GX_nann,12,
  (U8 *)"450200",(U8 *)"柳州市",  GX_liuz,10,
  (U8 *)"450300",(U8 *)"桂林市",  GX_guil,17,
  (U8 *)"450400",(U8 *)"梧州市",  GX_wuz,7,
  (U8 *)"450500",(U8 *)"北海市",  GX_beih,4,
  (U8 *)"450600",(U8 *)"防城港市",GX_fangcg,4,
  (U8 *)"450700",(U8 *)"钦州市",  GX_qingz,4,
  (U8 *)"450800",(U8 *)"贵港市",  GX_guig,5,
  (U8 *)"450900",(U8 *)"玉林市",  GX_yul,6,
  (U8 *)"451000",(U8 *)"百色市",  GX_bais,12,
  (U8 *)"451100",(U8 *)"贺州市",  GX_hez,4,
  (U8 *)"451200",(U8 *)"河池市",  GX_hec,11,
  (U8 *)"451300",(U8 *)"来宾市",  GX_laib,6,
  (U8 *)"451400",(U8 *)"崇左市",  GX_songz,7,
};
 //460000",(U8 *)"海南省",
 const AREAnode HaiNan[3] = 
{
  (U8 *)"460100",(U8 *)"海口市",HN_haik,4,
  (U8 *)"460200",(U8 *)"三亚市",NULL,0,
  (U8 *)"469000",(U8 *)"省直辖县级行政区划",HN_xingz,19,
};
 //500000",(U8 *)"重庆市",
 const AREAnode ChongQing[40] = 
{
    (U8 *)"500101",(U8 *)"万州区",NULL,0,
    (U8 *)"500102",(U8 *)"涪陵区",NULL,0,
    (U8 *)"500103",(U8 *)"渝中区",NULL,0,
    (U8 *)"500104",(U8 *)"大渡口区",NULL,0,
    (U8 *)"500105",(U8 *)"江北区",NULL,0,
    (U8 *)"500106",(U8 *)"沙坪坝区",NULL,0,
    (U8 *)"500107",(U8 *)"九龙坡区",NULL,0,
    (U8 *)"500108",(U8 *)"南岸区",NULL,0,
    (U8 *)"500109",(U8 *)"北碚区",NULL,0,
    (U8 *)"500110",(U8 *)"万盛区",NULL,0,
    (U8 *)"500111",(U8 *)"双桥区",NULL,0,
    (U8 *)"500112",(U8 *)"渝北区",NULL,0,
    (U8 *)"500113",(U8 *)"巴南区",NULL,0,
    (U8 *)"500114",(U8 *)"黔江区",NULL,0,
    (U8 *)"500115",(U8 *)"长寿区",NULL,0,
    (U8 *)"500116",(U8 *)"江津区",NULL,0,
    (U8 *)"500117",(U8 *)"合川区",NULL,0,
    (U8 *)"500118",(U8 *)"永川区",NULL,0,
    (U8 *)"500119",(U8 *)"南川区",NULL,0,
    (U8 *)"500222",(U8 *)"綦江县",NULL,0,
    (U8 *)"500223",(U8 *)"潼南县",NULL,0,
    (U8 *)"500224",(U8 *)"铜梁县",NULL,0,
    (U8 *)"500225",(U8 *)"大足县",NULL,0,
    (U8 *)"500226",(U8 *)"荣昌县",NULL,0,
    (U8 *)"500227",(U8 *)"璧山县",NULL,0,
    (U8 *)"500228",(U8 *)"梁平县",NULL,0,
    (U8 *)"500229",(U8 *)"城口县",NULL,0,
    (U8 *)"500230",(U8 *)"丰都县",NULL,0,
    (U8 *)"500231",(U8 *)"垫江县",NULL,0,
    (U8 *)"500232",(U8 *)"武隆县",NULL,0,
    (U8 *)"500233",(U8 *)"忠　县",NULL,0,
    (U8 *)"500234",(U8 *)"开　县",NULL,0,
    (U8 *)"500235",(U8 *)"云阳县",NULL,0,
    (U8 *)"500236",(U8 *)"奉节县",NULL,0,
    (U8 *)"500237",(U8 *)"巫山县",NULL,0,
    (U8 *)"500238",(U8 *)"巫溪县",NULL,0,
    (U8 *)"500240",(U8 *)"石柱土家族自治县",NULL,0,
    (U8 *)"500241",(U8 *)"秀山土家族苗族自治县",NULL,0,
    (U8 *)"500242",(U8 *)"酉阳土家族苗族自治县",NULL,0,
    (U8 *)"500243",(U8 *)"彭水苗族土家族自治县",NULL,0,
};
 //510000",(U8 *)"四川省",
 const AREAnode SiChuan[21] = 
{
  (U8 *)"510100",(U8 *)"成都市",  SC_chengd,19,
  (U8 *)"510300",(U8 *)"自贡市",  SC_zig,6,
  (U8 *)"510400",(U8 *)"攀枝花市",SC_panzh,5,
  (U8 *)"510500",(U8 *)"泸州市",  SC_luz,7,
  (U8 *)"510600",(U8 *)"德阳市",  SC_dey,6,
  (U8 *)"510700",(U8 *)"绵阳市",  SC_miany,9,
  (U8 *)"510800",(U8 *)"广元市",  SC_guangy,7,
  (U8 *)"510900",(U8 *)"遂宁市",  SC_suin,5,
  (U8 *)"511000",(U8 *)"内江市",  SC_neij,5,
  (U8 *)"511100",(U8 *)"乐山市",  SC_les,11,
  (U8 *)"511300",(U8 *)"南充市",  SC_nany,9,
  (U8 *)"511400",(U8 *)"眉山市",  SC_meis,6,
  (U8 *)"511500",(U8 *)"宜宾市",  SC_yib,10,
  (U8 *)"511600",(U8 *)"广安市",  SC_guanga,5,
  (U8 *)"511700",(U8 *)"达州市",  SC_daz,7,
  (U8 *)"511800",(U8 *)"雅安市",  SC_yaa,8,
  (U8 *)"511900",(U8 *)"巴中市",  SC_baz,4,
  (U8 *)"512000",(U8 *)"资阳市",  SC_ziy,4,
  (U8 *)"513200",(U8 *)"阿坝藏族羌族自治州",SC_abz,13,
  (U8 *)"513300",(U8 *)"甘孜藏族自治州",SC_gzz,18,
  (U8 *)"513400",(U8 *)"凉山彝族自治州",SC_liangs,17,
};
 //520000",(U8 *)"贵州省",
 const AREAnode GuiZhou[9] = 
{
  (U8 *)"520100",(U8 *)"贵阳市", GZ_guiy,10,
  (U8 *)"520200",(U8 *)"六盘水市",GZ_liups,4,
  (U8 *)"520300",(U8 *)"遵义市", GZ_zuny,14,
  (U8 *)"520400",(U8 *)"安顺市", GZ_ans,6,
  (U8 *)"522200",(U8 *)"铜仁地区",GZ_tongr,10,
  (U8 *)"522300",(U8 *)"黔西南布依族苗族自治州",GZ_qianxn,8,
  (U8 *)"522400",(U8 *)"毕节地区",GZ_bij,8,
  (U8 *)"522600",(U8 *)"黔东南苗族侗族自治州",GZ_qiandn,16,
  (U8 *)"522700",(U8 *)"黔南布依族苗族自治州",GZ_qiannby,12,
};
 //530000",(U8 *)"云南省",
 const AREAnode YunNan[16] = 
{
  (U8 *)"530100",(U8 *)"昆明市",              YN_kunm,14,
  (U8 *)"530300",(U8 *)"曲靖市",			  YN_quj,9,
  (U8 *)"530400",(U8 *)"玉溪市",			  YN_yux,9,
  (U8 *)"530500",(U8 *)"保山市",			  YN_baos,5,
  (U8 *)"530600",(U8 *)"昭通市",			  YN_shaot,11,
  (U8 *)"530700",(U8 *)"丽江市",			  YN_lij,5,
  (U8 *)"530800",(U8 *)"普洱市",			  YN_pue,10,
  (U8 *)"530900",(U8 *)"临沧市",			  YN_linc,8,
  (U8 *)"532300",(U8 *)"楚雄彝族自治州",	  YN_chuxyz,10,
  (U8 *)"532500",(U8 *)"红河哈尼族彝族自治州",YN_honghhn,13,
  (U8 *)"532600",(U8 *)"文山壮族苗族自治州",  YN_wens,8,
  (U8 *)"532800",(U8 *)"西双版纳傣族自治州",  YN_xisbn,3,
  (U8 *)"532900",(U8 *)"大理白族自治州",	  YN_dal,12,
  (U8 *)"533100",(U8 *)"德宏傣族景颇族自治州",YN_deh,5,
  (U8 *)"533300",(U8 *)"怒江傈僳族自治州",	  YN_nuj,4,
  (U8 *)"533400",(U8 *)"迪庆藏族自治州",	  YN_diq,3,
};
 //540000",(U8 *)"西藏自治区",
 const AREAnode XiZang[7] = 
{
  (U8 *)"540100",(U8 *)"拉萨市",    XZ_las,8,
  (U8 *)"542100",(U8 *)"昌都地区",  XZ_changd,11,
  (U8 *)"542200",(U8 *)"山南地区",  XZ_shann,12,
  (U8 *)"542300",(U8 *)"日喀则地区",XZ_rikz,18,
  (U8 *)"542400",(U8 *)"那曲地区",  XZ_naq,10,
  (U8 *)"542500",(U8 *)"阿里地区",  XZ_als,7,
  (U8 *)"542600",(U8 *)"林芝地区",  XZ_linz,7,
};
 //610000",(U8 *)"陕西省",
 const AREAnode Shan3Xi[10] = 
{
  (U8 *)"610100",(U8 *)"西安市",SX_xia,13,
  (U8 *)"610200",(U8 *)"铜川市",SX_tongc,4,
  (U8 *)"610300",(U8 *)"宝鸡市",SX_baoj,12,
  (U8 *)"610400",(U8 *)"咸阳市",SX_xiany,14,
  (U8 *)"610500",(U8 *)"渭南市",SX_wein,11,
  (U8 *)"610600",(U8 *)"延安市",SX_yana,13,
  (U8 *)"610700",(U8 *)"汉中市",SX_hanz,11,
  (U8 *)"610800",(U8 *)"榆林市",SX_yul,12,
  (U8 *)"610900",(U8 *)"安康市",SX_ank,10,
  (U8 *)"611000",(U8 *)"商洛市",SX_shangl,7,
};
 //620000",(U8 *)"甘肃省",
 const AREAnode GanSu[14] = 
{
  (U8 *)"620100",(U8 *)"兰州市",         GS_lanz,8,
  (U8 *)"620200",(U8 *)"嘉峪关市",		 NULL,0,
  (U8 *)"620300",(U8 *)"金昌市",		 GS_jinc,2,
  (U8 *)"620400",(U8 *)"白银市",		 GS_baiy,5,
  (U8 *)"620500",(U8 *)"天水市",		 GS_tians,7,
  (U8 *)"620600",(U8 *)"武威市",		 GS_wud,4,
  (U8 *)"620700",(U8 *)"张掖市",		 GS_zhangy,6,
  (U8 *)"620800",(U8 *)"平凉市",		 GS_pingl,7,
  (U8 *)"620900",(U8 *)"酒泉市",		 GS_jiuq,7,
  (U8 *)"621000",(U8 *)"庆阳市",		 GS_qingy,8,
  (U8 *)"621100",(U8 *)"定西市",		 GS_dingx,7,
  (U8 *)"621200",(U8 *)"陇南市",		 GS_longn,9,
  (U8 *)"622900",(U8 *)"临夏回族自治州", GS_linx,8,
  (U8 *)"623000",(U8 *)"甘南藏族自治州", GS_gannz,8,
};
 //630000",(U8 *)"青海省",
 const AREAnode QingHai[8] =     
{
  (U8 *)"630100",(U8 *)"西宁市",              QH_xin,7,
  (U8 *)"632100",(U8 *)"海东地区",			  QH_haid,6,
  (U8 *)"632200",(U8 *)"海北藏族自治州",	  QH_haib,4,
  (U8 *)"632300",(U8 *)"黄南藏族自治州",	  QH_huangn,4,
  (U8 *)"632500",(U8 *)"海南藏族自治州",	  QH_hain,5,
  (U8 *)"632600",(U8 *)"果洛藏族自治州",	  QH_guol,6,
  (U8 *)"632700",(U8 *)"玉树藏族自治州",	  QH_yus,6,
  (U8 *)"632800",(U8 *)"海西蒙古族藏族自治州",QH_haix,5,
};
 //640000",(U8 *)"宁夏回族自治区",
 const AREAnode NingXia[5] = 
{
  (U8 *)"640100",(U8 *)"银川市",  NX_yic,6,
  (U8 *)"640200",(U8 *)"石嘴山市",NX_shizs,3,
  (U8 *)"640300",(U8 *)"吴忠市",  NX_wuz,5,
  (U8 *)"640400",(U8 *)"固原市",  NX_guy,5,
  (U8 *)"640500",(U8 *)"中卫市",  NX_zhongw,3,
};
 //650000",(U8 *)"新疆维吾尔自治区",
 const AREAnode XinJiang[15] = 
{
  (U8 *)"650100",(U8 *)"乌鲁木齐市",            XJ_wulmq,8,
  (U8 *)"650200",(U8 *)"克拉玛依市",			XJ_kelmy,4,
  (U8 *)"652100",(U8 *)"吐鲁番地区",			XJ_tulf,3,
  (U8 *)"652200",(U8 *)"哈密地区",				XJ_ham,3,
  (U8 *)"652300",(U8 *)"昌吉回族自治州",		XJ_changj,7,
  (U8 *)"652700",(U8 *)"博尔塔拉蒙古自治州",    XJ_boetl,3,
  (U8 *)"652800",(U8 *)"巴音郭楞蒙古自治州",    XJ_baygl,9,
  (U8 *)"652900",(U8 *)"阿克苏地区",			XJ_aks,9,
  (U8 *)"653000",(U8 *)"克孜勒苏柯尔克孜自治州",XJ_kezl,4,
  (U8 *)"653100",(U8 *)"喀什地区",				XJ_kas,12,
  (U8 *)"653200",(U8 *)"和田地区",				XJ_het,8,
  (U8 *)"654000",(U8 *)"伊犁哈萨克自治州",		XJ_yilhsk,10,
  (U8 *)"654200",(U8 *)"塔城地区",				XJ_tac,7,
  (U8 *)"654300",(U8 *)"阿勒泰地区",			XJ_alt,7,
  (U8 *)"659000",(U8 *)"自治区直辖县级行政区划",XJ_zizq,4,
};
 //710000",(U8 *)"台湾省",
/* const AREAnode TaiWan[] = 
{
};*/
 //810000",(U8 *)"香港特别行政区",
/* const AREAnode Hongkong[] = 
{
};*/
 //820000",(U8 *)"澳门特别行政区",
/* const AREAnode Macao[] = 
{
};*/


/* -------------------------省------------------------------ */

const AREAnode province[34] = 
{
	(U8 *)"110000",(U8 *)"北京市",BeiJing,18,
	(U8 *)"120000",(U8 *)"天津市",TianJin,15,
	(U8 *)"130000",(U8 *)"河北省",HeBei,11,
	(U8 *)"140000",(U8 *)"山西省",ShanXi,11,
	(U8 *)"150000",(U8 *)"内蒙古",NeiMeng,12,
	(U8 *)"210000",(U8 *)"辽宁省",LiaoNing,14,
	(U8 *)"220000",(U8 *)"吉林省",JiLin,9,
	(U8 *)"230000",(U8 *)"黑龙江省",HeiLongJ,13,
	(U8 *)"310000",(U8 *)"上海市",ShangHai,18,
	(U8 *)"320000",(U8 *)"江苏省",JiangSu,13,
	(U8 *)"330000",(U8 *)"浙江省",ZheJiang,11,
	(U8 *)"340000",(U8 *)"安徽省",AnHui,17,
	(U8 *)"350000",(U8 *)"福建省",FuJian,9,
	(U8 *)"360000",(U8 *)"江西省",JiangXi,11,
	(U8 *)"370000",(U8 *)"山东省",ShanDong,17,
	(U8 *)"410000",(U8 *)"河南省",HeNan,17,
	(U8 *)"420000",(U8 *)"湖北省",HuBei,14,
	(U8 *)"430000",(U8 *)"湖南省",HuNan,14,
	(U8 *)"440000",(U8 *)"广东省",GuangDong,21,
	(U8 *)"450000",(U8 *)"广西",GuangXi,14,
	(U8 *)"460000",(U8 *)"海南省",HaiNan,3,
	(U8 *)"500000",(U8 *)"重庆市",ChongQing,40,
	(U8 *)"510000",(U8 *)"四川省",SiChuan,21,
	(U8 *)"520000",(U8 *)"贵州省",GuiZhou,9,
	(U8 *)"530000",(U8 *)"云南省",YunNan,16,
	(U8 *)"540000",(U8 *)"西藏",XiZang,7,
	(U8 *)"610000",(U8 *)"陕西省",Shan3Xi,10,
	(U8 *)"620000",(U8 *)"甘肃省",GanSu,14,
	(U8 *)"630000",(U8 *)"青海省",QingHai,8,
	(U8 *)"640000",(U8 *)"宁夏",NingXia,5,
	(U8 *)"650000",(U8 *)"新疆",XinJiang,15,
	(U8 *)"710000",(U8 *)"台湾省",NULL,0,
	(U8 *)"810000",(U8 *)"香港",NULL,0,
	(U8 *)"820000",(U8 *)"澳门",NULL,0,
};

#endif