/*----------------------文件描述--------------------------------
*创建日期: 08/03/07
*描述    : 开机进程
*--------------------------------------------------------------*/

/*
*include standard files
*/
#include "hyOsCpuCfg.h"
#include "hyTypes.h"
#include "hyErrors.h"

/*
*include local files
*/


/*---------------------------------------------------------
*函数: PowerOn_ThreadMethod
*功能: 系统初始化后调用该进程，
*参数: 
*返回: none
*---------------------------------------------------------*/
int PowerOn_ThreadMethod(void);
