#ifndef __SCANNER_UART_H__
#define __SCANNER_UART_H__

/*----------------------------------------------------------------------------
   Standard include files:
   --------------------------------------------------------------------------*/
#include "hyTypes.h"
#include "hyhwChip.h"
#include "hyErrors.h"
/*---------------------------------------------------------------------------
   Local Types and defines:
-----------------------------------------------------------------------------*/
#include "hyhwGpio.h"
#include "hyhwUart.h"

#include "hardWare_Resource.h"

//#define SCANNER_UART		(UART3)//(UART1)
//#define SCANNER_UART_PORT	(UART_PORT_3)//(UART_PORT_5)

/* 扫描头类型 */
#define SCANNER_TYPE_SYMBOL		(0)		//symbol scanner
#define SCANNER_TYPE_OPTICON	(1)		//opticon scanner


#define BARCODE_END_CHAR		(0x0D)	/* 条码组的结束字符 */


/*-----------------------------------------------------------------------------
* 函数:	scanner_init
* 功能:	初始化扫描头的电源控制端口
* 参数:	none
* 返回:	none
*----------------------------------------------------------------------------*/
void scanner_init(void);

/*-----------------------------------------------------------------------------
* 函数:	scanner_reinit
* 功能:	重新初始化扫描头的电源控制端口
* 参数:	none
* 返回:	none
*----------------------------------------------------------------------------*/
void scanner_reinit(void);

#if 0
/*-----------------------------------------------------------------------------
* 函数:	scanner_update_init_102
* 功能:	升级并初始化102程序(欧光扫描头才有102)，
		注意：102升级程序必须为("C:/image102.hyc")
* 参数:	none
* 返回:	none
*----------------------------------------------------------------------------*/
void scanner_update_init_102(void);
#endif

/*-----------------------------------------------------------------------------
* 函数:	scanner_getType
* 功能:	获取扫描头类型
* 参数:	none
* 返回:	扫描头类型
*		0---symbol scanner(讯宝扫描头)
*		1---option scanner(欧光扫描头)
*----------------------------------------------------------------------------*/
int scanner_getType(void);


/*-----------------------------------------------------------------
* 函数: barBuf_init
* 功能: 初始化barBuf
* 参数: none
* 返回: none
*-----------------------------------------------------------------*/
void barBuf_init(void);

/*-----------------------------------------------------------------
* 函数: barBuf_readBarCode
* 功能: 从barBuf中读取条码数据，以BARCODE_END_CHAR为一组数据的判别条件
* 参数: pData----数据buf
*		len-----需要写入数据的长度
* 返回: 0----读取成功
		-1---读取失败
*-----------------------------------------------------------------*/
int barBuf_readBarCode(U8 *pData, int *pLen);


#endif	//#ifndef __SCANNER_UART_H__