/*-----------------------------------------------------------------
硬件相关API

------------------------------------------------------------------*/
#include "hyco_api.h"



/*==============================================１．电源相关控制============================================*/
/*---------------------------------------
* 函数:Power_SetBattAutoOffTimer
* 功能:自动关机时间的控制。 如果 timeStr 不为NULL,则以该时间作为关键时间, 否则以delaySecond延迟做关机时间
* 参数:timeStr:时间字符串, 格式:yyyymmddhhmmss (20121202121000)
       delaySecond:从当前时间开始计算延迟秒数
* 返回:0:设置成功    -1:失败
*----------------------------------------*/
int Power_SetBattAutoOffTimer(char *timeStr, unsigned int delaySecond)
{
	
	
	
	return 0;
}


/*---------------------------------------
* 函数:Power_DisablePOff
* 功能:电源键禁止使用
* 参数:none
* 返回:none
*----------------------------------------*/
void Power_DisablePOff()
{
	
}


/*---------------------------------------
* 函数:Power_EnablePOff
* 功能:电源键允许使用
* 参数:none
* 返回:none
*----------------------------------------*/
void Power_EnablePOff()
{
	
}

/*---------------------------------------
* 函数:Power_GetVoltageLevel
* 功能:电量的取得
* 参数:none
* 返回:0~4:0格到4格   5:电量满
*----------------------------------------*/
U32 Power_GetVoltageLevel()
{
	return Battery_Level();
}

/*---------------------------------------
* 函数:Power_
* 功能:电池图标的控制
* 参数:none
* 返回:none
*----------------------------------------*/
//void Power_();

/*===========================================２．ＬＣＤ控制(很重要需要提供尽量详细的API)=========================================*/
/*---------------------------------------
* 函数:LCD_OpenBacklight
* 功能:打开显示屏背光
* 参数:none
* 返回:none
*----------------------------------------*/
void LCD_OpenBacklight()
{
	LcdModulePowerOnOff(1);
}

/*---------------------------------------
* 函数:LCD_CloseBacklight
* 功能:关闭显示屏背光
* 参数:none
* 返回:none
*----------------------------------------*/
void LCD_CloseBacklight()
{
	LcdModulePowerOnOff(0);
}

/*---------------------------------------
* 函数:LCD_SetBacklightGrade
* 功能:设置显示屏背光亮度等级
* 参数:grade:亮度等级  1~5级 对应亮度值 12  8  5  3  2
* 返回:none
*----------------------------------------*/
void LCD_SetBacklightGrade(unsigned char grade)
{
	hyhwLcd_lightSet(grade);
}

//to do.......

/*===========================================3．状态栏的控制=========================================*/
/*---------------------------------------
* 函数:JT_SetIMEState
* 功能:设置输入法状态
* 参数:state:0:关闭  1:123  2:abc  3:ABC  4:手写  5:拼音
* 返回:none
*----------------------------------------*/
void JT_SetIMEState(unsigned char state)
{
	
}

/*===========================================4．操作的控制(很重要需要提供尽量详细的API)=========================================*/
/*---------------------------------------
* 函数:
* 功能:按键键值的取得和控制
* 参数:none
* 返回:none
*----------------------------------------*/
//void ();

/*---------------------------------------
* 函数:
* 功能:按键输入相关
* 参数:none
* 返回:none
*----------------------------------------*/
//void ();

/*---------------------------------------
* 函数:
* 功能:触摸控制相关
* 参数:none
* 返回:none
*----------------------------------------*/
//void ();

/*---------------------------------------
* 函数:
* 功能:涉及到按键输入和按键相应相关的API
* 参数:none
* 返回:none
*----------------------------------------*/
//void ();

/*===========================================5．LED 控制=========================================*/
/*---------------------------------------
* 函数:LED_Control
* 功能:提示灯颜色
* 参数:color: 0:关闭  1:红  2:绿  4:蓝  3:黄  5:品红  6:青  7:白
       times:闪烁次数   (暂时没有功能)
* 返回:none
*----------------------------------------*/
void LED_Control(int color, int times)
{
	Led_ctrl(color);
}

/*===========================================6．蜂鸣控制=========================================*/
/*---------------------------------------
* 函数:Buzzer_On
* 功能:启动蜂鸣器
* 参数:beepType: 声音类型 0:滴  6:滴滴滴滴 
       ledType:LED类型 0:关闭  1:红  2:绿  4:蓝  3:黄  5:品红  6:青  7:白
* 返回:none
*----------------------------------------*/
void Buzzer_On(int beepType, int ledType)
{
	beeper_Start(beepType, 1, ledType);
}

/*---------------------------------------
* 函数:Buzzer_Off
* 功能:停止蜂鸣器
* 参数:none
* 返回:none
*----------------------------------------*/
void Buzzer_Off()
{
	beeper_Stop();
}
		
/*===========================================7．震动控制=========================================*/
/*---------------------------------------
* 函数:VIB_On
* 功能:启动
* 参数:millisecond:震动时间 单位 ms
* 返回:none
*----------------------------------------*/
void VIB_On(unsigned int millisecond)
{
	VibratorCtrl_Start(millisecond);
}

/*---------------------------------------
* 函数:VIB_Off
* 功能:停止
* 参数:none
* 返回:none
*----------------------------------------*/
void VIB_Off()
{
	VibratorCtrl_Stop();
}

/*===========================================8．扫描控制=========================================*/
/*---------------------------------------
* 函数:Scan_InitEx
* 功能:扫描设备的初始化
* 参数:none
* 返回:none
*----------------------------------------*/
void Scan_InitEx()
{
	
}

/*---------------------------------------
* 函数:Scan_DeinitEx
* 功能:扫描设备的关闭
* 参数:none
* 返回:none
*----------------------------------------*/
void Scan_DeinitEx()
{
	
}

/*---------------------------------------
* 函数:Scan_EnableOn
* 功能:开扫描 (打开激光)
* 参数:none
* 返回:none
*----------------------------------------*/
void Scan_EnableOn()
{
	
}

/*---------------------------------------
* 函数:Scan_EnableOff
* 功能:关扫描 (关闭激光)
* 参数:none
* 返回:none
*----------------------------------------*/
void Scan_EnableOff()
{
	
}

/*---------------------------------------
* 函数:Scan_SetScannerParam
* 功能:扫描相关参数的设置，按键动作、扫描方式、条码类型、checkdigt等等。
* 参数:none
* 返回:none
*----------------------------------------*/
void Scan_SetScannerParam()
{
	
}

/*---------------------------------------
* 函数:Scan_GetScannerParam
* 功能:扫描相关参数的取得。
* 参数:none
* 返回:none
*----------------------------------------*/
void Scan_GetScannerParam()
{
	
}

/*===========================================9．Bluetooth通讯控制=========================================*/
/*---------------------------------------
* 函数:BLT_PowerOn
* 功能:蓝牙设备的启动。 
* 参数:none
* 返回:none
*----------------------------------------*/
void BLT_PowerOn()
{
	
}

/*---------------------------------------
* 函数:BLT_PowerOff
* 功能:蓝牙设备的关闭。  
* 参数:none
* 返回:none
*----------------------------------------*/
void BLT_PowerOff()
{
	
}

//Master模式整个通信过程涉及到的函数，以及相关参数的设置和取得
//Slave模式整个通信过程涉及到的函数，以及相关参数的设置和取得
			
/*===========================================10．硬件相关信息的取得=========================================*/
//类似操作系统版本，产品序列号等等
			
/*===========================================11．WIFI和GPRS的通讯相关=========================================*/
//wifi连接的获取及选择	
//wifi与GPRS通讯模式的互相转换



