/*----------------------文件描述--------------------------------
*创建日期: 08/03/07
*描述    : 关机进程
*--------------------------------------------------------------*/

/*
*include standard files
*/
#include "hyOsCpuCfg.h"
#include "hyTypes.h"
#include "hyErrors.h"

/*
*include local files
*/



/*---------------------------------------------------------
*函数: PowerDown_ThreadMethod
*功能: 系统关机时调用该进程，显示关机动画
*参数: 
*返回: none
*---------------------------------------------------------*/
int PowerDown_ThreadMethod(void);
