#ifndef HYC_BARCOED_P_H
#define HYC_BARCOED_P_H

#include "hyTypes.h"

#include "hyhwChip.h"
#include "hyhwGpio.h"


/*---------------------------------------------------------------------------
 函数: barDecode_p_Start
 功能: 启动扫描进程，但不启动激光
 参数: 
 返回: HY_ERROR---该进程正在运行，当前设置无效
 	   HY_OK------启动成功
* -----------------------------------------------------------------------------*/
int barDecode_p_Start(void);

/*---------------------------------------------------------------------------
* 函数:	barDecode_Enable
* 功能:	使能扫描功能，如果扫描成功，立即熄灭激光；否则，超时熄灭激光
* 参数:	enableSecond----扫描激光点亮时间(秒)
* 返回:	none
* -----------------------------------------------------------------------------*/
void barDecode_Enable(U32 enableSecond);

/*---------------------------------------------------------------------------
* 函数:	barDecode_Enable
* 功能:	禁止扫描功能，但不销毁进程
* 参数:	none
* 返回:	none
* -----------------------------------------------------------------------------*/
void barDecode_Disable(void);

/*---------------------------------------------------------------------------
 函数: barDecode_p_Exit
 功能: 停止扫描功能
 参数: 无
 返回: 无
* -----------------------------------------------------------------------------*/
void barDecode_p_Exit(void);

#endif //#ifndef HYC_BARCOED_P_H