#include "hyTypes.h"
#include "backGroundMain.h"

/*---------------------------------------------------------
*函数: bgrd_intial
*功能: 后台扫描初始化
*参数: none 
*返回: none
*---------------------------------------------------------*/
static bgrd_intial(void)
{

}

/*---------------------------------------------------------
*函数: bgrd_main
*功能: 后台扫描主函数
*参数: none 
*返回: none
*---------------------------------------------------------*/
void bgrd_main(void)
{
    
    bgrd_intial(); 
    while(1)
    {
    
         syssleep(2);
    }
}